zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
/**
  ******************************************************************************
  * @file    stm32u3xx_hal_hsp.c
  * @author  MCD Application Team
  * @brief   HSP HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Hardware Signal Processor (HSP) peripheral:
  *           + Initialization and de-initialization functions
  *           + Peripheral Configuration functions
  *           + Peripheral State and Error functions
  *           + IRQ Handlers and Callbacks functions
  *           + Setter and Getter of the user data
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
  [..]
    The HSP HAL driver can be used as follows:

    (#) Declare a HSP_HandleTypeDef handle structure (eg. HSP_HandleTypeDef hhsp).
    (#) Initialize the HSP low level resources by implementing the HAL_HSP_MspInit() API:
        (##) Enable the HSP interface clock.
        (##) Enable the SRAM related to the HSP (if not already enabled).
        (##) NVIC configuration if you need to use interrupt process:
            (+++) Configure the HSP interrupt priority.
            (+++) Enable the NVIC HSP IRQ handle.

    (#) Initialize the HSP handle by calling the HAL_HSP_Init() API which calls HAL_HSP_MspInit()

    (#) Load the Firmware Code part & Data part with HAL_HSP_LoadFirmware.
        The Firmware is based on the Firmware Code Part version embedded in the CROM.
        The Firmwares are delivered through the Middleware HSP Engine.

    (#) Load Plugin with HAL_HSP_LoadPlugin (Optional).
          This step requires one call per Plugin.
          Plugins are delivered through the Middleware HSP Engine.

    (#) Boot the HSP peripheral with HAL_HSP_Boot.
        If the boot fails, the handle state is set to HAL_HSP_STATE_FAULT to prohibit any configuration or processing.
        HAL_HSP_DeInit must be called, and an HSP Hardware Reset is required from RCC.

        If the boot succeeds, the handle state is set to HAL_HSP_STATE_RUNNING.
        The HSP peripheral is ready to be used.

    *** HSP HAL driver Processing List ***
    ======================================
    (#) To process a processing function (Accelerator mode), call in order, the following APIs:
          - HAL_HSP_DIRECT_WriteCommand(): to send the Processing Function Command ID
          - HAL_HSP_WriteParameter(): to send a parameter value (one call per parameter)
          - HAL_HSP_DIRECT_WriteCommandPointer() to send a pointer of buffer (one call per pointer)

        Refer to the HSP Processing Functions User Manual to find all processing functions available
        for the Accelerator mode.
        The Middleware HSP Engine embeds High level API for each Processing Function available in Accelerator Mode.

    (#) To record a processing list (Sequencer mode), use the following APIs:
          - HAL_HSP_RunTask(): to active the HSP Supervisor (HAL_HSP_TASK_SUPERVISOR)
          - HAL_HSP_MSGBOX_SendCommand(): to start/stop the recording
          - HAL_HSP_WriteParameter(): to send a parameter value (one call per parameter)

          1 - Start the recording:
              - Running the Task HAL_HSP_TASK_SUPERVISOR with HAL_HSP_RunTask
              - Send the Processing List ID with HAL_HSP_WriteParameter (HAL_HSP_PARAM_0)
              - Send the START command ID with HAL_HSP_MSGBOX_SendCommand() (The command ID is defined in the HSP FW)
          2 - Record a Processing function:
              - Prepare all the parameters with HAL_HSP_WriteParameter according to the Processing Function User Manual.
              - Send the Processing Function ID with HAL_HSP_MSGBOX_SendCommand() (The ID is defined in the HSP FW)
          3 - Stop the recording:
              - Send the STOP command ID with HAL_HSP_MSGBOX_SendCommand() (The command ID is defined in the HSP FW)

    *** HSP HAL driver Event configuration ***
    ==========================================
    [..]
    (#) To configure an event with STREAM Buffer as source:
          + Configure the STREAM Buffer <y> with the following API:
            - HAL_HSP_STREAM_EnableIntToFloat(/HAL_HSP_STREAM_DisableIntToFloat() to enable/disable the data conversion
              from Integer to Float
            - HAL_HSP_STREAM_SetConfig() to configure a STREAM Buffer

          + Configure an event <x> by calling HAL_HSP_EVENT_SetConfig() with HAL_HSP_EVENT_<x>_STREAM<y>

        When all STREAM Buffer are configured, enable the STREAM block with HAL_HSP_STREAM_Start().
        To change any STREAM Buffer configuration, first disable the STREAM block with HAL_HSP_STREAM_Stop.

    (#) To configure an event with a TRGIN trigger as source:
          + Configure the TRGIN <y> trigger with HAL_HSP_TRGIN_SetConfig()
          + Configure an event <x> by calling HAL_HSP_EVENT_SetConfig() with HAL_HSP_EVENT_<x>_TRGIN<y>

        When the TRGIN is configured, enable it with HAL_HSP_TRGIN_Enable().

        To change any TRGIN configuration, first disable it with HAL_HSP_TRGIN_Disable().

        In polling mode, the HAL provides these APIs:
          - HAL_HSP_TRGIN_IsActiveFlag_Overrun to get the Overrun Flag status
          - HAL_HSP_TRGIN_GetOverrun to get the mask of TRGINs in overrun
          - HAL_HSP_TRGIN_ClearFlag_Overrun to clear the Overrun Flag

        In interrupt mode, enable the TRGIN Event ITs with HAL_HSP_TRGIN_EnableIT().

    (#) To configure an event triggered by the CPU (CSEG interface):
          + Configure an event <x> by calling HAL_HSP_EVENT_SetConfig with HAL_HSP_EVENT_<x>_CSEG

