zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
    (#) To configure an event triggered by the SPE itself (HSEG interface):
          + Configure an event <x> by calling HAL_HSP_EVENT_SetConfig with HAL_HSP_EVENT_<x>_HSEG

        Note: a processing list will trig this event by calling the Processing Function SEND_EVENT (ref HSP Processing
              Function User Manual)

    *** HSP HAL driver processing list execution ***
    ================================================
    [..]
    (#) To execute a Processing List by software, call the following APIs:
          - HAL_HSP_TASK_Run: Post the Processing List ID in polling mode. The execution is scheduled with
                              the lowest priority.
          - HAL_HSP_TASK_Run_IT: Post the Processing List ID in interrupt mode. The execution is scheduled with
                                 the lowest priority. The callback HAL_HSP_EVT_SPE_TaskCpltCallback is called
                                 when the process is terminated.
          - HAL_HSP_EVENT_RequestSWTrigger: Post the trig of event linked to the Processing List ID. The execution is
                                 scheduled with the Event Level priority.
                                 The Processing List must have the same ID number than the Event to configure.
                                 The Event must be configured with HAL_HSP_Event_SetConfig and the source must be
                                 one of HAL_HSP_EVENT_x_CSEG.

                                 To wait the end of execution, call HAL_HSP_EVENT_PollForPending.

    (#) To execute a Processing List by external trigger, just ensure:
         - The trigger is well configured and enabled
         - The Event (related to the Processing List) linked to this trigger is well enabled also.

        If all conditions are done, the HW will trig the HSP Event. The execution of the Processing List
        will be scheduled by the SPE.

    (#) To execute a Processing List by the HSP itself (SPE), record the Processing Function SEND_EVENT
        in another Processing List (see HSP Processing Function User Manual)

        The execution of this Processing List with be scheduled by the SPE:
          - with a highest priority if HDEG interface is selected,
          - with the event priority level attached to the processing list if HSEG interface is selected.

    (#) To manage the HSP Outputs call the following APIs:
          - HAL_HSP_OUTPUT_SetConfigTrigger() to configure the source of each TRGOx output
          - HAL_HSP_OUTPUT_Enable() to enable all the TRGO & GPO Outputs
          - HAL_HSP_OUTPUT_Disable() to disable all the TRGO & GPO Outputs

    *** SPE Event in Interrupt mode ***
    ====================================
    [..]
      (#) To enable SPE Event ITs, call the HAL_HSP_SPE_EVENT_EnableIT()
      (#) To enable SPE Error ITs, call the HAL_HSP_SPE_ERROR_EnableIT()
          All selected SPE Error ITs will call the unique HAL_HSP_ErrorCallback callback

              (+) by selecting a Task Comparator Unit (@ref HAL_HSP_TASK_ComparatorTypeDef)
              (+) by setting HAL_HSP_EVENT_SYNC_ENABLE for the attribute "state"
            + Configure and Enable a Task Comparator Unit to select the Task to monitor and
             active the Start/End Of Task Event with the API HAL_HSP_TCU_EnableComparator

    *** HSP HAL Driver Performance & Debug ***
    ==========================================
    [..]
      (#) To synchronize the execution of a process list (linked to an event) by the end of another task:
            + When configuring the EVENT, configure the attribute "sync" (HAL_HSP_EVENT_SyncTypeDef):
              (+) by selecting a Task Comparator Unit (@ref HAL_HSP_TASK_ComparatorTypeDef)
              (+) by setting HAL_HSP_EVENT_SYNC_ENABLE for the attribute "state"
            + Configure and Enable a Task Comparator Unit to select the Task to monitor and
             active the Start/End Of Task Event with the API HAL_HSP_TCU_EnableComparator

      (#) To reduce BRAM conflict access shared between CPU and HSP:
            + Enable the Conflict Access Counter HAL_HSP_BRAM_EnableConflictAccessCounter()
            + Run your processing sequence and Get the counter value with HAL_HSP_BRAM_GetConflictAccessCounter()
            + Change the BRAM Arbitration with HAL_HSP_BRAM_SetBandwidthArbitration() to try
              to reduce BRAM conflict access
            + Run your processing sequence a second time and Get the counter value
              with HAL_HSP_BRAM_GetConflictAccessCounter()
            + Check if the BRAM Arbitration changes reduce the number of conflict access

      (#) To debug the processing lists execution, enable the TimeStamp Capture capability:
            + Configure the TimeStamp Capture with HAL_HSP_TSC_SetConfig()
            + Enable the TimeStamp Capture with:
                (+) HAL_HSP_TSC_Enable() for polling mode
                (+) HAL_HSP_TSC_Enable_IT() for interrupt mode

      (#) Use HAL_HSP_SNOOP_Enable() to observe key signals to ease application tuning.
          For this capability, HSP pins must be configured:
            (++) Enable the clock for the HSP GPIOs
            (++) Configure HSP pins as alternate function

      (#) To manage the power consumption of HSP blocks call the following APIs:
          + HAL_HSP_SMARTCLOCKING_Enable() enables the Smart Clocking of some clocks (Default mode)
          + HAL_HSP_SMARTCLOCKING_Disable() disables the Smart Clocking of some clocks (increase the power consumption)

      (#) Use HAL_HSP_BREAK_EnableFreezeEvent() to freeze the SPE when selected Events occurred.

    *** HSP HAL Driver Break feature ***
    ====================================
    [..]
      (+) Use HAL_HSP_BREAK_EnableCriticalEvent() to stop sensitive peripheral
          when a critical issue is detected in the HSP.

    *** Callback registration ***
    =============================
    [..]
        The compilation define USE_HAL_HSP_REGISTER_CALLBACKS, when set to 1,
        allows the user to configure dynamically the driver callbacks.

