zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
    [..]
        Use the HAL_HSP_Register<Xxxx>Callback() functions to register callbacks:
            (+) HAL_HSP_RegisterMspInitCallback               : HSP MspInit callback.
            (+) HAL_HSP_RegisterMspDeInitCallback             : HSP MspDeInit callback.
            (+) HAL_HSP_RegisterSPE_DirectCommandCpltCallback : HSP Direct Command Complete callback.
            (+) HAL_HSP_RegisterSPE_TaskCpltCallback          : HSP Task Complete callback.
            (+) HAL_HSP_RegisterSPE_FPUSaturationCallback     : HSP FPU Saturation callback.
            (+) HAL_HSP_RegisterSPE_RunStateCallback          : HSP SPE Running State callback.
            (+) HAL_HSP_RegisterSTREAM_BufferEmptyCallback    : HSP STREAM Buffer Empty callback.
            (+) HAL_HSP_RegisterSTREAM_BufferFullCallback     : HSP STREAM Buffer Full callback.
            (+) HAL_HSP_RegisterTCU_TaskOverlapCallback       : HSP Task Overlap callback.
            (+) HAL_HSP_RegisterTCU_TaskStartedCallback       : HSP Task Started callback.
            (+) HAL_HSP_RegisterTCU_TaskEndedCallback         : HSP Task Ended callback.
            (+) HAL_HSP_RegisterTSC_TimestampReadyCallback    : HSP TimeStamp Capture Ready callback.
            (+) HAL_HSP_RegisterErrorCallback                 : HSP Errors callback.
            (+) HAL_HSP_RegisterFWEVT_ProcessingEventCallback : HSP Processing Event callback.

    [..]
        Use the HAL_HSP_Register<xxx>Callback() function to unregister callback by passing
        the corresponding weak function.

    [..]
        By default, after the HAL_HSP_Init and when the state is HAL_HSP_STATE_RESET,
        all callbacks are reset to the corresponding legacy weak functions.

        Exception done for MspInit and MspDeInit callbacks that are respectively
        reset to the legacy weak function in the HAL_HSP_Init() and HAL_HSP_DeInit() only when
        these callbacks are NULL (not registered beforehand).
        If not, MspInit or MspDeInit are not NULL, the HAL_HSP_Init() and HAL_HSP_DeInit()
        keep and use the user MspInit/MspDeInit callbacks (registered beforehand).

    [..]
        Callbacks can be registered/unregistered in HAL_HSP_STATE_RUNNING state only.
        Exception done for MspInit/MspDeInit callbacks that can be registered/unregistered
        in HAL_HSP_STATE_RUNNING or HAL_HSP_STATE_RESET state,
        thus registered (user) MspInit/DeInit callbacks can be used during the Init/DeInit.
        In that case, first register the MspInit/MspDeInit user callbacks
        using HAL_HSP_RegisterCallback before calling HAL_HSP_DeInit() or HAL_HSP_Init() function.

    [..]
        When the compilation define USE_HAL_HSP_REGISTER_CALLBACKS is set to 0 or
        not defined, the callback registering feature is not available and all callbacks
        are set to the corresponding weak functions.

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32u3xx_hal.h"

/** @addtogroup STM32U3xx_HAL_Driver
  * @{
  */

#if defined(HSP1)

/** @addtogroup HSP
  * @{
  */

#ifdef HAL_HSP_MODULE_ENABLED

/* Private types -------------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup HSP_Private_Constants  HSP Private Constants
  * @{
  */
/**
  * @defgroup  HSP_Firmware_Constants HSP Firmware Constants
  * @{
  */
#define HSP_FW_STATUS_INIT             (0U)                      /*!< Firmware is in INIT phase                     */
#define HSP_FW_STATUS_WAIT_INIT_CMD    (1U << HSP_CR_BSTAT_Pos)  /*!< Firmware is waiting the Init command          */
#define HSP_FW_STATUS_RUN              (2U << HSP_CR_BSTAT_Pos)  /*!< Firmware is in RUN phase: SPE is in WFE state */
#define HSP_FW_STATUS_PROCFG           (3U << HSP_CR_BSTAT_Pos)  /*!< Firmware is recording a Processing list       */
#define HSP_FW_STATUS_RESET_ALL_PL     (4U << HSP_CR_BSTAT_Pos)  /*!< Firmware is resetting all the Processing list */
#define HSP_FW_STATUS_ADD_PLUGIN       (8U << HSP_CR_BSTAT_Pos)  /*!< Firmware is adding Plugin                     */

#define HSP_FW_END_PATTERN  0xFFFFFFFFUL  /*!< Pattern to close the Firmware CRAM */

/**
  * @}
  */

/**
  * @defgroup  HSP_Hardware_Constants HSP Hardware Constants
  * @{
  */
#define HSP_REG_TRGINSEL_CFG_NBR  4U  /*!< Number of TRGIN Config bitfield per TRGINSELRx register */
#define HSP_REG_TRGINSEL_SELECT_FIELD_SIZE  8U  /*!< Size in bit for Source Selection bitfield in TRGINSELRx register */
#define HSP_REG_EVTSRC_CFG_NBR  8U  /*!< Number of EVTSRC Config bitfield per HSP_EVTSRCxR register */
#define HSP_REG_EVTSRC_FIELD_SIZE  4U  /*!< Size in bit for Source Selection bitfield in HSP_EVTSRCxR register */
#define HSP_REG_TCUCFGR_BITFIELD_SIZE  8U  /*!< Size in bit for all bitfields of a TCU Config
                                                in HSP_TCUCFGR_TSKCMPx register */
#define HSP_REG_TRGOCFGR_BITFIELD_SRC_SIZE  2U  /*!< Size in bit for Source bitfield in HSP_TRGOCGGR register */

/**
  * @}
  */

/**
  * @defgroup  HSP_Interrupt_Constants HSP Interrupt Constants
  * @{
  */
/** HSP Mask of all TCU Start Of Task flags */
#define HSP_EVT_ISR_TCU_START_OF_TASK_FLAGS_MASK  \
  (HSP_EVT_ISR_SOTECP0F   | HSP_EVT_ISR_SOTECP1F  \
   | HSP_EVT_ISR_SOTECP2F | HSP_EVT_ISR_SOTECP3F)

/** HSP Mask of all TCU End Of Task flags */
#define HSP_EVT_ISR_TCU_END_OF_TASK_FLAGS_MASK    \
  (HSP_EVT_ISR_EOTECP0F   | HSP_EVT_ISR_EOTECP1F  \
   | HSP_EVT_ISR_EOTECP2F | HSP_EVT_ISR_EOTECP3F)

/** HSP Mask of all STREAM Buffer Event flags */
#define HSP_EVT_ISR_STREAM_READY_FLAGS_MASK   \
  (HSP_EVT_ISR_B0EVTF   | HSP_EVT_ISR_B1EVTF  \
   | HSP_EVT_ISR_B2EVTF | HSP_EVT_ISR_B3EVTF)

/** HSP Mask of all STREAM Buffer Directions */
#define HSP_BUFFCFGR_BUFFDIR_MSK                    \
  (HSP_BUFFCFGR_BUFF0DIR   | HSP_BUFFCFGR_BUFF1DIR  \
   | HSP_BUFFCFGR_BUFF2DIR | HSP_BUFFCFGR_BUFF3DIR)

/** HSP Mask of all Event Interrupts */
#define HSP_IT_EVT_ALL                                                         \
  (HAL_HSP_IT_EVT_CMD_DIRECT_COMMAND_DONE | HAL_HSP_IT_EVT_CMD_CDEG_READY      \
   | HAL_HSP_IT_EVT_TSC_DATA_READY        | HAL_HSP_IT_EVT_SPE_FPU_SATURATION  \
   | HAL_HSP_IT_EVT_SPE_ENTER_IN_WFE      | HAL_HSP_IT_EVT_SPE_EXIT_FROM_WFE   \
   | HAL_HSP_IT_EVT_STREAM_ALL            | HAL_HSP_IT_EVT_TCU_ALL)

/** HSP Mask of all Error Interrupts */
#define HSP_IT_ERR_ALL                                                                             \
  (HAL_HSP_IT_ERR_TRGIN_OVR      | HAL_HSP_IT_ERR_STREAM_ALL         | HAL_HSP_IT_ERR_TSC_OVR      \
   | HAL_HSP_IT_ERR_SPE_FW       | HAL_HSP_IT_ERR_SPE_SCHEDULER      | HAL_HSP_IT_ERR_SPE_BREAK    \
   | HAL_HSP_IT_ERR_SPE_HDEG_OVR | HAL_HSP_IT_ERR_SPE_INVALID_OPCODE | HAL_HSP_IT_ERR_SPE_ACCESS   \
   | HAL_HSP_IT_ERR_SPE_FPU_UDF  | HAL_HSP_IT_ERR_SPE_FPU_OVF        | HAL_HSP_IT_ERR_SPE_FPU_DBZ  \
   | HAL_HSP_IT_ERR_SPE_FPU_INVALID | HAL_HSP_IT_ERR_SPE_FPU_DENORMAL)

/**
  * @}
  */

