zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
/** HSP Timestamp Capture Configuration CAPCR Mask */
#define HSP_TSC_CONFIG_CAPCR_MASK  (HSP_CAPCR_PRESC_Msk | HSP_CAPCR_FRCNTEN_Msk | HSP_CAPCR_TSKFLT_Msk)

/**
  * @defgroup  HSP_Common_Constants HSP Common Constants
  * @{
  */
/** HSP Reset Request Timeout in millisecond */
#define HSP_TIMEOUT_RESET_MS 1U

/**
  * @}
  */

/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/** @defgroup HSP_Private_Macros  HSP Private Macros
  * @{
  */
/** Alias to ASSERT_DBG_PARAM macro. */
#define ASSERT_DBG_PARAM  assert_param

/**
  * @brief Retrieve the HSP hardware CMSIS instance from the hal handle.
  * @param  handle  HSP Handle
  * @retval Address of the HSP instance
  */
#define HSP_GET_INSTANCE(handle)  ((handle)->Instance)

/** @defgroup HSP_Private_Macros_Group1  HSP Private Macros for BRAM
  * @{
  */

/**
  * @brief Get the HSP BRAMAB Base Address.
  * @param  instance_id  HSP instance.
  * @retval uint32_t.
  */
#define HSP_GET_BRAMAB_BASE_ADDRESS(instance_id)  \
  ((((uint32_t)(instance_id)) == (uint32_t)HSP1_BASE)?HSP1_BRAMAB_BASE: ((uint32_t)NULL))

/**
  * @brief Retrieve the HSP CRAM Base Address.
  * @param  instance  HSP instance.
  * @retval Address  If instance supported
  * @retval NULL  If instance not supported
  */
#define HSP_GET_CRAM_BASE_ADDRESS(instance)  (((instance) == HSP1)?HSP1_CRAM_BASE:((uint32_t)NULL))

/**
  * @brief Retrieve the HSP CRAM Base Address.
  * @param  instance  HSP instance.
  * @retval Address  If instance supported
  * @retval NULL  If instance not supported
  */
#define HSP_GET_DRAM_BASE_ADDRESS(instance)  (((instance) == HSP1)?HSP1_DRAM_BASE:((uint32_t)NULL))

/**
  * @brief Retrieve the size of HSP CRAM.
  * @param  instance  HSP instance.
  * @retval Size  CRAM size in word if instance supported
  * @retval NULL  If instance not supported
  */
#define HSP_GET_CRAM_SIZE_IN_WORD(instance)  (((instance) == HSP1)?(HSP1_CRAM_SIZE / 4U):0U)

/**
  * @brief Retrieve the size of HSP DRAM.
  * @param  instance  HSP instance.
  * @retval Size  DRAM size in word if instance supported
  * @retval NULL  If instance not supported
  */
#define HSP_GET_DRAM_SIZE_IN_WORD(instance)  (((instance) == HSP1)?(HSP1_DRAM_SIZE / 4U):0U)

/**
  * @}
  */

/**
  * @brief Check if the handle state is expected in val_condition
  */
#if defined(USE_HSP_ASSERT_DBG_STATE)
/**
  * @brief  The HSP_ASSERT_DBG_STATE macro is used for function's states check.
  * @param  __STATE__ the state filed within the PPP handle
  * @param  __VAL__ the authorized states value(s) to be checked
  *                 can be a combination of states
  * @note   if __STATE__ & __VAL__ is zero (unauthorized state) then
  * @note   assert_dbg_state_failed function is called which reports
  *         the name of the source file and the source line number of the call that failed.
  *         if __STATE__ & __VAL__ is zero (unauthorized state) then, the ASSERT_DBG_STATE macro returns no value.
  */
#define HSP_ASSERT_DBG_STATE(__STATE__,__VAL__)                                         \
  do {                                                                                  \
    if ((((uint32_t)(__STATE__)) & ((uint32_t)(__VAL__))) == 0U) { return HAL_ERROR; }  \
  } while(0U)
#else
#define HSP_ASSERT_DBG_STATE(__STATE__,__VAL__)  ((void)0U)
#endif /* USE_ASSERT_DBG_STATE  */

/** @defgroup HSP_Private_Macros_Group2  HSP Private Macros for Assertion Parameters
  * @{
  */
/**
  * @brief Verify the Performance Monitor State value.
  * @param  state  Value of Performance Monitor State (@ref HAL_HSP_PERF_MONITOR_StateTypeDef).
  * @retval SET    State value is valid.
  * @retval RESET  State value is invalid.
  */
#define IS_HSP_PERF_MONITOR_STATE(state)        \
  (((state) == HAL_HSP_PERF_MONITOR_DISABLE)    \
   || ((state) == HAL_HSP_PERF_MONITOR_ENABLE))

/**
  * @brief Verify the Stream Identifier.
  * @param  id  Stream ID (@ref HAL_HSP_STREAM_BufferTypeDef).
  * @retval SET    ID value is valid.
  * @retval RESET  ID value is invalid.
  */
#define IS_HSP_STREAM_BUFFER(id)         \
  (((id) == HAL_HSP_STREAM_BUFFER_0)     \
   || ((id) == HAL_HSP_STREAM_BUFFER_1)  \
   || ((id) == HAL_HSP_STREAM_BUFFER_2)  \
   || ((id) == HAL_HSP_STREAM_BUFFER_3))

/**
  * @brief Verify the Stream Buffer Direction.
  * @param  direction  Stream Direction (@ref HAL_HSP_STREAM_Buffer_DirectionTypeDef).
  * @retval SET    direction value is valid.
  * @retval RESET  direction value is invalid.
  */
#define IS_HSP_STREAM_BUFFER_DIRECTION(direction)          \
  (((direction) == HAL_HSP_STREAM_BUFFER_DIRECTION_RX)     \
   || ((direction) == HAL_HSP_STREAM_BUFFER_DIRECTION_TX))

/**
  * @brief Verify the Stream Buffer Sync State.
  * @param  state  Stream Buffer Sync State (@ref HAL_HSP_STREAM_Buffer_Sync_StateTypeDef).
  * @retval SET    state value is valid.
  * @retval RESET  state value is invalid.
  */
#define IS_HSP_STREAM_BUFFER_SYNC_STATE(state)         \
  (((state) == HAL_HSP_STREAM_BUFFER_SYNC_DISABLE)     \
   || ((state) == HAL_HSP_STREAM_BUFFER_SYNC_ENABLE))

/**
  * @brief Verify the STREAM Event Interrupts.
  * @param  interrupts  Event Interrupt mask.
  * @retval SET    interrupts is valid.
  * @retval RESET  interrupts is invalid.
  */
#define IS_HSP_STREAM_BUFFER_IT_EVENT(interrupts)                 \
  (((interrupts) > 0UL)                                           \
   && (((interrupts) & HAL_HSP_IT_EVT_STREAM_ALL) == (interrupts)))

/**
  * @brief Verify the STREAM Error Interrupts.
  * @param  interrupts  Error Interrupt mask.
  * @retval SET    Mask value is valid.
  * @retval RESET  Mask value is invalid.
  */
#define IS_HSP_STREAM_BUFFER_IT_ERROR(interrupts)                 \
  (((interrupts) > 0UL)                                           \
   && (((interrupts) & HAL_HSP_IT_ERR_STREAM_ALL) == (interrupts)))

/**
  * @brief Verify the TRGIN Identifier.
  * @param  id  TRGIN ID.
  * @retval SET    ID value is valid.
  * @retval RESET  ID value is invalid.
  */
#define IS_HSP_TRGIN(id)         \
  (((id) == HAL_HSP_TRGIN_0)     \
   || ((id) == HAL_HSP_TRGIN_1)  \
   || ((id) == HAL_HSP_TRGIN_2)  \
   || ((id) == HAL_HSP_TRGIN_3)  \
   || ((id) == HAL_HSP_TRGIN_4)  \
   || ((id) == HAL_HSP_TRGIN_5)  \
   || ((id) == HAL_HSP_TRGIN_6)  \
   || ((id) == HAL_HSP_TRGIN_7)  \
   || ((id) == HAL_HSP_TRGIN_8)  \
   || ((id) == HAL_HSP_TRGIN_9))

/**
  * @brief Verify the TRGIN Identifiers.
  * @param  ids  TRGIN IDs.
  * @retval SET    ID value is valid.
  * @retval RESET  ID value is invalid.
  */
#define IS_HSP_TRGIN_COMBINATION(ids)       \
  (((ids) > 0UL)                            \
   && (((ids) & HAL_HSP_TRGIN_ALL) == (ids)))

/**
  * @brief Verify the TRGIN Polarity.
  * @param  polarity  Polarity value (@ref HAL_HSP_TRGIN_PolarityTypeDef).
  * @retval SET    polarity is valid.
  * @retval RESET  polarity is invalid.
  */
#define IS_HSP_TRGIN_POLARITY(polarity)               \
  (((polarity) == HAL_HSP_TRGIN_POLARITY_FALLING)     \
   || ((polarity) == HAL_HSP_TRGIN_POLARITY_RISING))

/**
  * @brief Verify the value of TRGIN source.
  * @param  source  id of the trigger signal (@ref HAL_HSP_TRGIN_SourceTypeDef).
  * @retval SET (id is valid) or RESET (id is invalid)
  */
#if defined(STM32U3C5xx) || defined(STM32U3B5xx)
#define IS_HSP_TRGIN_SOURCE(source)             \
  (((source) == HAL_HSP_TRGIN_DMA1_CH1_TC)      \
   || ((source) == HAL_HSP_TRGIN_DMA1_CH2_TC)   \
   || ((source) == HAL_HSP_TRGIN_DMA1_CH3_TC)   \
   || ((source) == HAL_HSP_TRGIN_DMA1_CH4_TC)   \
   || ((source) == HAL_HSP_TRGIN_EXTI0)         \
   || ((source) == HAL_HSP_TRGIN_EXTI1)         \
   || ((source) == HAL_HSP_TRGIN_TIM1_TRGO)     \
   || ((source) == HAL_HSP_TRGIN_TIM1_TRGO2)    \
   || ((source) == HAL_HSP_TRGIN_TIM2_TRGO)     \
   || ((source) == HAL_HSP_TRGIN_TIM3_TRGO)     \
   || ((source) == HAL_HSP_TRGIN_TIM6_TRGO)     \
   || ((source) == HAL_HSP_TRGIN_TIM7_TRGO)     \
   || ((source) == HAL_HSP_TRGIN_TIM8_TRGO)     \
   || ((source) == HAL_HSP_TRGIN_TIM8_TRGO2)    \
   || ((source) == HAL_HSP_TRGIN_TIM15_TRGO)    \
   || ((source) == HAL_HSP_TRGIN_LPTIM1_CH1)    \
   || ((source) == HAL_HSP_TRGIN_LPTIM1_CH2)    \
   || ((source) == HAL_HSP_TRGIN_LPTIM2_CH1)    \
   || ((source) == HAL_HSP_TRGIN_LPTIM2_CH2)    \
   || ((source) == HAL_HSP_TRGIN_ADF1_SAD_DET))
#else
#define IS_HSP_TRGIN_SOURCE(source)             \
  (((source) == HAL_HSP_TRGIN_DMA1_CH8_TC)      \
   || ((source) == HAL_HSP_TRGIN_DMA1_CH9_TC)   \
   || ((source) == HAL_HSP_TRGIN_DMA1_CH10_TC)  \
   || ((source) == HAL_HSP_TRGIN_DMA1_CH11_TC)  \
   || ((source) == HAL_HSP_TRGIN_EXTI0)         \
   || ((source) == HAL_HSP_TRGIN_EXTI1)         \
   || ((source) == HAL_HSP_TRGIN_TIM1_TRGO)     \
   || ((source) == HAL_HSP_TRGIN_TIM1_TRGO2)    \
   || ((source) == HAL_HSP_TRGIN_TIM2_TRGO)     \
   || ((source) == HAL_HSP_TRGIN_TIM3_TRGO)     \
   || ((source) == HAL_HSP_TRGIN_TIM6_TRGO)     \
   || ((source) == HAL_HSP_TRGIN_TIM7_TRGO)     \
   || ((source) == HAL_HSP_TRGIN_TIM8_TRGO)     \
   || ((source) == HAL_HSP_TRGIN_TIM8_TRGO2)    \
   || ((source) == HAL_HSP_TRGIN_TIM15_TRGO)    \
   || ((source) == HAL_HSP_TRGIN_LPTIM1_CH1)    \
   || ((source) == HAL_HSP_TRGIN_LPTIM1_CH2)    \
   || ((source) == HAL_HSP_TRGIN_LPTIM2_CH1)    \
   || ((source) == HAL_HSP_TRGIN_LPTIM2_CH2)    \
   || ((source) == HAL_HSP_TRGIN_ADF1_SAD_DET))
#endif /* STM32U3C5xx || STM32U3B5xx */


/**
  * @brief Verify the STREAM Error Interrupts.
  * @param  interrupts  Error Interrupt mask.
  * @retval SET    interrupts is valid.
  * @retval RESET  interrupts is invalid.
  */
#define IS_HSP_TRGIN_IT_ERR(interrupts)                            \
  (((interrupts) > 0UL)                                            \
   && ((((interrupts) & HAL_HSP_IT_ERR_TRGIN_ALL) == (interrupts))))

/**
  * @brief Verify the Processing Function Event Interrupts.
  * @param  interrupts  Event Interrupt mask.
  * @retval SET    interrupts is valid.
  * @retval RESET  interrupts is invalid.
  */
#define IS_HSP_PROCLIST_IT_PFCTEVT(interrupts)                     \
  (((interrupts) > 0UL)                                            \
   && ((((interrupts) & HAL_HSP_PROCLIST_IT_PFCTEVT_ALL) == (interrupts))))

/**
  * @brief Verify the Event Identifier.
  * @param  id  Event ID.
  * @retval SET    ID value is valid.
  * @retval RESET  ID value is invalid.
  */
#define IS_HSP_EVENT(id)          \
  (((id) == HAL_HSP_EVENT_1)      \
   || ((id) == HAL_HSP_EVENT_2)   \
   || ((id) == HAL_HSP_EVENT_3)   \
   || ((id) == HAL_HSP_EVENT_4)   \
   || ((id) == HAL_HSP_EVENT_5)   \
   || ((id) == HAL_HSP_EVENT_6)   \
   || ((id) == HAL_HSP_EVENT_7)   \
   || ((id) == HAL_HSP_EVENT_8)   \
   || ((id) == HAL_HSP_EVENT_9)   \
   || ((id) == HAL_HSP_EVENT_10)  \
   || ((id) == HAL_HSP_EVENT_11)  \
   || ((id) == HAL_HSP_EVENT_12)  \
   || ((id) == HAL_HSP_EVENT_13)  \
   || ((id) == HAL_HSP_EVENT_14)  \
   || ((id) == HAL_HSP_EVENT_15)  \
   || ((id) == HAL_HSP_EVENT_16)  \
   || ((id) == HAL_HSP_EVENT_17)  \
   || ((id) == HAL_HSP_EVENT_18)  \
   || ((id) == HAL_HSP_EVENT_19)  \
   || ((id) == HAL_HSP_EVENT_20)  \
   || ((id) == HAL_HSP_EVENT_21)  \
   || ((id) == HAL_HSP_EVENT_22))

/**
  * @brief Verify the mask of Event Identifiers.
  * @param  mask  Event IDs mask
  * @retval SET    Mask is valid.
  * @retval RESET  Mask is invalid.
  */
#define IS_HSP_EVENTS_MASK(mask)              \
  (((mask) > 0U) && STM32_IS_BIT_SET(HAL_HSP_EVENT_ALL, (mask)))


/**
  * @brief Verify the Event Sync State.
  * @param  state  Event state (@ref HAL_HSP_EVENT_Sync_StateTypeDef)
  * @retval SET    state is valid.
  * @retval RESET  state is invalid.
  */
#define IS_HSP_EVENT_SYNC_STATE(state)        \
  (((state) == HAL_HSP_EVENT_SYNC_DISABLE)    \
   || ((state) == HAL_HSP_EVENT_SYNC_ENABLE))

/**
  * @brief Verify the value of EVENT source.
  * @param  source  id of the trigger signal (@ref HAL_HSP_EVENT_SourceTypeDef).
  * @retval SET (id is valid) or RESET (id is invalid)
  */
#define IS_HSP_EVENT_SOURCE(source)          \
  (((source) == HAL_HSP_EVENT_1_STREAM0)     \
   || ((source) == HAL_HSP_EVENT_1_TRGIN3)   \
   || ((source) == HAL_HSP_EVENT_1_TRGIN8)   \
   || ((source) == HAL_HSP_EVENT_1_HSEG)     \
   || ((source) == HAL_HSP_EVENT_1_CSEG)     \
   || ((source) == HAL_HSP_EVENT_2_STREAM1)  \
   || ((source) == HAL_HSP_EVENT_2_TRGIN4)   \
   || ((source) == HAL_HSP_EVENT_2_TRGIN9)   \
   || ((source) == HAL_HSP_EVENT_2_HSEG)     \
   || ((source) == HAL_HSP_EVENT_2_CSEG)     \
   || ((source) == HAL_HSP_EVENT_3_STREAM2)  \
   || ((source) == HAL_HSP_EVENT_3_TRGIN0)   \
   || ((source) == HAL_HSP_EVENT_3_TRGIN5)   \
   || ((source) == HAL_HSP_EVENT_3_HSEG)     \
   || ((source) == HAL_HSP_EVENT_3_CSEG)     \
   || ((source) == HAL_HSP_EVENT_4_STREAM3)  \
   || ((source) == HAL_HSP_EVENT_4_TRGIN1)   \
   || ((source) == HAL_HSP_EVENT_4_TRGIN6)   \
   || ((source) == HAL_HSP_EVENT_4_HSEG)     \
   || ((source) == HAL_HSP_EVENT_4_CSEG)     \
   || ((source) == HAL_HSP_EVENT_5_STREAM0)  \
   || ((source) == HAL_HSP_EVENT_5_TRGIN2)   \
   || ((source) == HAL_HSP_EVENT_5_TRGIN7)   \
   || ((source) == HAL_HSP_EVENT_5_HSEG)     \
   || ((source) == HAL_HSP_EVENT_5_CSEG)     \
   || ((source) == HAL_HSP_EVENT_6_STREAM1)  \
   || ((source) == HAL_HSP_EVENT_6_TRGIN3)   \
   || ((source) == HAL_HSP_EVENT_6_TRGIN8)   \
   || ((source) == HAL_HSP_EVENT_6_HSEG)     \
   || ((source) == HAL_HSP_EVENT_6_CSEG)     \
   || ((source) == HAL_HSP_EVENT_7_STREAM2)  \
   || ((source) == HAL_HSP_EVENT_7_TRGIN4)   \
   || ((source) == HAL_HSP_EVENT_7_TRGIN9)   \
   || ((source) == HAL_HSP_EVENT_7_HSEG)     \
   || ((source) == HAL_HSP_EVENT_7_CSEG)     \
   || ((source) == HAL_HSP_EVENT_8_STREAM3)  \
   || ((source) == HAL_HSP_EVENT_8_TRGIN0)   \
   || ((source) == HAL_HSP_EVENT_8_TRGIN5)   \
   || ((source) == HAL_HSP_EVENT_8_HSEG)     \
   || ((source) == HAL_HSP_EVENT_8_CSEG)     \
   || ((source) == HAL_HSP_EVENT_9_STREAM0)  \
   || ((source) == HAL_HSP_EVENT_9_TRGIN1)   \
   || ((source) == HAL_HSP_EVENT_9_TRGIN6)   \
   || ((source) == HAL_HSP_EVENT_9_HSEG)     \
   || ((source) == HAL_HSP_EVENT_9_CSEG)     \
   || ((source) == HAL_HSP_EVENT_10_STREAM1) \
   || ((source) == HAL_HSP_EVENT_10_TRGIN2)  \
   || ((source) == HAL_HSP_EVENT_10_TRGIN7)  \
   || ((source) == HAL_HSP_EVENT_10_HSEG)    \
   || ((source) == HAL_HSP_EVENT_10_CSEG)    \
   || ((source) == HAL_HSP_EVENT_11_STREAM2) \
   || ((source) == HAL_HSP_EVENT_11_TRGIN3)  \
   || ((source) == HAL_HSP_EVENT_11_TRGIN8)  \
   || ((source) == HAL_HSP_EVENT_11_HSEG)    \
   || ((source) == HAL_HSP_EVENT_11_CSEG)    \
   || ((source) == HAL_HSP_EVENT_12_STREAM3) \
   || ((source) == HAL_HSP_EVENT_12_TRGIN4)  \
   || ((source) == HAL_HSP_EVENT_12_TRGIN9)  \
   || ((source) == HAL_HSP_EVENT_12_HSEG)    \
   || ((source) == HAL_HSP_EVENT_12_CSEG)    \
   || ((source) == HAL_HSP_EVENT_13_STREAM0) \
   || ((source) == HAL_HSP_EVENT_13_TRGIN0)  \
   || ((source) == HAL_HSP_EVENT_13_TRGIN5)  \
   || ((source) == HAL_HSP_EVENT_13_HSEG)    \
   || ((source) == HAL_HSP_EVENT_13_CSEG)    \
   || ((source) == HAL_HSP_EVENT_14_STREAM1) \
   || ((source) == HAL_HSP_EVENT_14_TRGIN1)  \
   || ((source) == HAL_HSP_EVENT_14_TRGIN6)  \
   || ((source) == HAL_HSP_EVENT_14_HSEG)    \
   || ((source) == HAL_HSP_EVENT_14_CSEG)    \
   || ((source) == HAL_HSP_EVENT_15_STREAM2) \
   || ((source) == HAL_HSP_EVENT_15_TRGIN2)  \
   || ((source) == HAL_HSP_EVENT_15_TRGIN7)  \
   || ((source) == HAL_HSP_EVENT_15_HSEG)    \
   || ((source) == HAL_HSP_EVENT_15_CSEG)    \
   || ((source) == HAL_HSP_EVENT_16_STREAM3) \
   || ((source) == HAL_HSP_EVENT_16_TRGIN3)  \
   || ((source) == HAL_HSP_EVENT_16_TRGIN8)  \
   || ((source) == HAL_HSP_EVENT_16_HSEG)    \
   || ((source) == HAL_HSP_EVENT_16_CSEG)    \
   || ((source) == HAL_HSP_EVENT_17_STREAM0) \
   || ((source) == HAL_HSP_EVENT_17_TRGIN4)  \
   || ((source) == HAL_HSP_EVENT_17_TRGIN9)  \
   || ((source) == HAL_HSP_EVENT_17_HSEG)    \
   || ((source) == HAL_HSP_EVENT_17_CSEG)    \
   || ((source) == HAL_HSP_EVENT_18_STREAM1) \
   || ((source) == HAL_HSP_EVENT_18_TRGIN0)  \
   || ((source) == HAL_HSP_EVENT_18_TRGIN5)  \
   || ((source) == HAL_HSP_EVENT_18_HSEG)    \
   || ((source) == HAL_HSP_EVENT_18_CSEG)    \
   || ((source) == HAL_HSP_EVENT_19_STREAM2) \
   || ((source) == HAL_HSP_EVENT_19_TRGIN1)  \
   || ((source) == HAL_HSP_EVENT_19_TRGIN6)  \
   || ((source) == HAL_HSP_EVENT_19_HSEG)    \
   || ((source) == HAL_HSP_EVENT_19_CSEG)    \
   || ((source) == HAL_HSP_EVENT_20_STREAM3) \
   || ((source) == HAL_HSP_EVENT_20_TRGIN2)  \
   || ((source) == HAL_HSP_EVENT_20_TRGIN7)  \
   || ((source) == HAL_HSP_EVENT_20_HSEG)    \
   || ((source) == HAL_HSP_EVENT_20_CSEG)    \
   || ((source) == HAL_HSP_EVENT_21_STREAM0) \
   || ((source) == HAL_HSP_EVENT_21_TRGIN3)  \
   || ((source) == HAL_HSP_EVENT_21_TRGIN8)  \
   || ((source) == HAL_HSP_EVENT_21_HSEG)    \
   || ((source) == HAL_HSP_EVENT_21_CSEG)    \
   || ((source) == HAL_HSP_EVENT_22_STREAM1) \
   || ((source) == HAL_HSP_EVENT_22_TRGIN4)  \
   || ((source) == HAL_HSP_EVENT_22_TRGIN9)  \
   || ((source) == HAL_HSP_EVENT_22_HSEG)    \
   || ((source) == HAL_HSP_EVENT_22_CSEG))

/**
  * @brief Verify the SmartClocking Identifier.
  * @param  clock_id  SmartClocking ID.
  * @retval SET    ID value is valid.
  * @retval RESET  ID value is invalid.
  */
#define IS_HSP_SMARTCLOCKING(clock_id)  \
  (((clock_id) > 0U)                    \
   && (((clock_id) & HAL_HSP_SMARTCLOCKING_ALL) == (clock_id)))

/**
  * @brief Verify the Task Identifier.
  * @param  task_id  Task ID (@ref HAL_HSP_TaskTypeDef).
  * @retval SET    ID value is valid.
  * @retval RESET  ID value is invalid.
  */
#define IS_HSP_TASK(task_id)          \
  (((task_id) == HAL_HSP_TASK_0)      \
   || ((task_id) == HAL_HSP_TASK_1)   \
   || ((task_id) == HAL_HSP_TASK_2)   \
   || ((task_id) == HAL_HSP_TASK_3)   \
   || ((task_id) == HAL_HSP_TASK_4)   \
   || ((task_id) == HAL_HSP_TASK_5)   \
   || ((task_id) == HAL_HSP_TASK_6)   \
   || ((task_id) == HAL_HSP_TASK_7)   \
   || ((task_id) == HAL_HSP_TASK_8)   \
   || ((task_id) == HAL_HSP_TASK_9)   \
   || ((task_id) == HAL_HSP_TASK_10)  \
   || ((task_id) == HAL_HSP_TASK_11)  \
   || ((task_id) == HAL_HSP_TASK_12)  \
   || ((task_id) == HAL_HSP_TASK_13)  \
   || ((task_id) == HAL_HSP_TASK_14)  \
   || ((task_id) == HAL_HSP_TASK_15)  \
   || ((task_id) == HAL_HSP_TASK_16)  \
   || ((task_id) == HAL_HSP_TASK_17)  \
   || ((task_id) == HAL_HSP_TASK_18)  \
   || ((task_id) == HAL_HSP_TASK_19)  \
   || ((task_id) == HAL_HSP_TASK_20)  \
   || ((task_id) == HAL_HSP_TASK_21)  \
   || ((task_id) == HAL_HSP_TASK_22)  \
   || ((task_id) == HAL_HSP_TASK_23)  \
   || ((task_id) == HAL_HSP_TASK_24)  \
   || ((task_id) == HAL_HSP_TASK_25)  \
   || ((task_id) == HAL_HSP_TASK_26)  \
   || ((task_id) == HAL_HSP_TASK_27)  \
   || ((task_id) == HAL_HSP_TASK_28)  \
   || ((task_id) == HAL_HSP_TASK_29)  \
   || ((task_id) == HAL_HSP_TASK_30)  \
   || ((task_id) == HAL_HSP_TASK_31)  \
   || ((task_id) == HAL_HSP_TASK_32)  \
   || ((task_id) == HAL_HSP_TASK_33)  \
   || ((task_id) == HAL_HSP_TASK_34)  \
   || ((task_id) == HAL_HSP_TASK_35)  \
   || ((task_id) == HAL_HSP_TASK_36)  \
   || ((task_id) == HAL_HSP_TASK_SUPERVISOR))

/**
  * @brief Verify the Task Comparator Unit Identifier.
  * @param  id  TCU ID (@ref HAL_HSP_TASK_ComparatorTypeDef).
  * @retval SET    ID value is valid.
  * @retval RESET  ID value is invalid.
  */
#define IS_HSP_TCU(id)                     \
  (((id) == HAL_HSP_TASK_COMPARATOR_0)     \
   || ((id) == HAL_HSP_TASK_COMPARATOR_1)  \
   || ((id) == HAL_HSP_TASK_COMPARATOR_2)  \
   || ((id) == HAL_HSP_TASK_COMPARATOR_3))

/**
  * @brief Verify the Task Comparator Unit 0 interrupts.
  * @param  interrupts  Interrupt mask.
  * @retval SET    interrupts is valid.
  * @retval RESET  interrupts is invalid.
  */
#define IS_HSP_TCU0_IT(interrupts)  \
  (((interrupts) & HAL_HSP_IT_EVT_TCU0_ALL) == (interrupts))

/**
  * @brief Verify the Task Comparator Unit 1 interrupts.
  * @param  interrupts  Interrupt mask.
  * @retval SET    interrupts is valid.
  * @retval RESET  interrupts is invalid.
  */
#define IS_HSP_TCU1_IT(interrupts)  \
  (((interrupts) & HAL_HSP_IT_EVT_TCU1_ALL) == (interrupts))

/**
  * @brief Verify the Task Comparator Unit 2 interrupts.
  * @param  interrupts  Interrupt mask.
  * @retval SET    interrupts is valid.
  * @retval RESET  interrupts is invalid.
  */
#define IS_HSP_TCU2_IT(interrupts)  \
  (((interrupts) & HAL_HSP_IT_EVT_TCU2_ALL) == (interrupts))

/**
  * @brief Verify the Task Comparator Unit 3 interrupts.
  * @param  interrupts  Interrupt mask.
  * @retval SET    interrupts is valid.
  * @retval RESET  interrupts is invalid.
  */
#define IS_HSP_TCU3_IT(interrupts)  \
  (((interrupts) & HAL_HSP_IT_EVT_TCU3_ALL) == (interrupts))

/**
  * @brief Verify the TCU Interrupts.
  * @param  tcu_id      Task Comparator Unit ID.
  * @param  interrupts  Interrupt mask.
  * @retval SET    interrupts is valid.
  * @retval RESET  interrupts is invalid.
  */
#define IS_HSP_TCU_IT(tcu_id, interrupts)                                        \
  ((((tcu_id) == HAL_HSP_TASK_COMPARATOR_0)    && IS_HSP_TCU0_IT((interrupts)))  \
   || (((tcu_id) == HAL_HSP_TASK_COMPARATOR_1) && IS_HSP_TCU1_IT((interrupts)))  \
   || (((tcu_id) == HAL_HSP_TASK_COMPARATOR_2) && IS_HSP_TCU2_IT((interrupts)))  \
   || (((tcu_id) == HAL_HSP_TASK_COMPARATOR_3) && IS_HSP_TCU3_IT((interrupts))))

/**
  * @brief Verify the TCU Flags.
  * @param  flags   Flags mask.
  * @retval SET     interrupts is valid.
  * @retval RESET   interrupts is invalid.
  */
#define IS_HSP_TCU_FLAGS(flags)  \
  (STM32_IS_BIT_SET(HAL_HSP_FLAG_EVT_TCU_ALL, (flags)) != 0U)

/**
  * @brief Verify the Task Overlap interrupts.
  * @param  interrupts  Interrupts mask.
  * @retval SET     interrupts is valid.
  * @retval RESET   interrupts is invalid.
  */
#define IS_HSP_TASK_OVERLAP_IT(interrupts)  \
  (((interrupts) == HAL_HSP_IT_NONE) || ((interrupts) == HAL_HSP_IT_EVT_TCU_TASK_OVL))

/**
  * @brief Verify the Trigger Output Identifier.
  * @param  id  Trigger Output Id (@ref HAL_HSP_OUTPUT_TriggerTypeDef).
  * @retval SET    ID value is valid.
  * @retval RESET  ID value is invalid.
  */
#define IS_HSP_OUTPUT_TRIGGER(id)         \
  (((id) == HAL_HSP_OUTPUT_TRIGGER_0)     \
   || ((id) == HAL_HSP_OUTPUT_TRIGGER_1)  \
   || ((id) == HAL_HSP_OUTPUT_TRIGGER_2)  \
   || ((id) == HAL_HSP_OUTPUT_TRIGGER_3))

/**
  * @brief Verify the Trigger Output Source Identifier.
  * @param  id  Trigger Output Source ID (@ref HAL_HSP_OUTPUT_TRIGGER_SourceTypeDef).
  * @retval SET    ID value is valid.
  * @retval RESET  ID value is invalid.
  */
#define IS_HSP_OUTPUT_TRIGGER_SOURCE(id)                \
  (((id) == HAL_HSP_OUTPUT_TRIGGER_NONE)                \
   || ((id) == HAL_HSP_OUTPUT_TRIGGER_STREAM)           \
   || ((id) == HAL_HSP_OUTPUT_TRIGGER_CORE)             \
   || ((id) == HAL_HSP_OUTPUT_TRIGGER_TIMESTAMPCAPTURE))

