zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
/**
  * @brief Verify the TimeStamp Capture Prescaler value.
  * @param  value  Prescaler value (@ref HAL_HSP_TSC_PrescalerTypeDef).
  * @retval SET    Prescaler value is valid.
  * @retval RESET  Prescaler value is invalid.
  */
#define IS_HSP_TSC_PRESCALER(value)                \
  (((value) == HAL_HSP_TSC_PRESCALER_BYPASSED)     \
   || ((value) == HAL_HSP_TSC_PRESCALER_DIV2)      \
   || ((value) == HAL_HSP_TSC_PRESCALER_DIV4)      \
   || ((value) == HAL_HSP_TSC_PRESCALER_DIV8)      \
   || ((value) == HAL_HSP_TSC_PRESCALER_DIV16)     \
   || ((value) == HAL_HSP_TSC_PRESCALER_DIV32)     \
   || ((value) == HAL_HSP_TSC_PRESCALER_DIV64)     \
   || ((value) == HAL_HSP_TSC_PRESCALER_DIV128)    \
   || ((value) == HAL_HSP_TSC_PRESCALER_DIV256)    \
   || ((value) == HAL_HSP_TSC_PRESCALER_DIV512)    \
   || ((value) == HAL_HSP_TSC_PRESCALER_DIV1024)   \
   || ((value) == HAL_HSP_TSC_PRESCALER_DIV2048)   \
   || ((value) == HAL_HSP_TSC_PRESCALER_DIV4096)   \
   || ((value) == HAL_HSP_TSC_PRESCALER_DIV8192)   \
   || ((value) == HAL_HSP_TSC_PRESCALER_DIV16384)  \
   || ((value) == HAL_HSP_TSC_PRESCALER_DIV32768))

/**
  * @brief Verify the TimeStamp Capture Free Counter value.
  * @param  value  Free Counter value (@ref HAL_HSP_TSC_FreeRunningCounterStateTypeDef).
  * @retval SET    Value is valid.
  * @retval RESET  Value is invalid.
  */
#define IS_HSP_TSC_FREE_COUNTER(value)              \
  (((value) == HAL_HSP_TSC_FREE_COUNTER_DISABLE)    \
   || ((value) == HAL_HSP_TSC_FREE_COUNTER_ENABLE))

/**
  * @brief Verify the TimeStamp Capture Filter.
  * @param  value  Filter value (@ref HAL_HSP_TSC_TaskFilterTypeDef).
  * @retval SET    Value is valid.
  * @retval RESET  Value is invalid.
  */
#define IS_HSP_TSC_FILTER(value)                    \
  (((value) == HAL_HSP_TSC_TASK_FILTER_NONE)        \
   || ((value) == HAL_HSP_TSC_TASK_FILTER_TSKCMP0))

/**
  * @brief Verify the TimeStamp Capture Mode.
  * @param  mode  Mode value (@ref HAL_HSP_TSC_Capture_ModeTypeDef).
  * @retval SET    Value is valid.
  * @retval RESET  Value is invalid.
  */
#define IS_HSP_TSC_CAPTURE_MODE(mode)                        \
  (((mode) == HAL_HSP_TSC_CAPTURE_MODE_SPE_BREAKS)           \
   || ((mode) == HAL_HSP_TSC_CAPTURE_MODE_TASK_NBR_CHANGES)  \
   || ((mode) == HAL_HSP_TSC_CAPTURE_MODE_PFCT_NBR_CHANGES))

/**
  * @brief Verify the BRAM Arbitration value.
  * @param  value  BRAM Arbitration (@ref HAL_HSP_BRAM_ArbitrationTypeDef).
  * @retval SET    Value is valid.
  * @retval RESET  Value is invalid.
  */
#define IS_HSP_BRAM_ARBITRATION(value)                        \
  (((value) == HAL_HSP_BRAM_ARBITRATION_LATENCY_16_CYCLES)    \
   || ((value) == HAL_HSP_BRAM_ARBITRATION_LATENCY_8_CYCLES)  \
   || ((value) == HAL_HSP_BRAM_ARBITRATION_LATENCY_4_CYCLES))

/**
  * @brief Verify the Polling mode value.
  * @param  mode  Polling mode (@ref HAL_HSP_POLLING_ModeTypeDef).
  * @retval SET    Value is valid.
  * @retval RESET  Value is invalid.
  */
#define IS_HSP_POLL_MODE(mode)                   \
  (((mode) == HAL_HSP_POLLING_FOR_ALL_EVENT)     \
   || ((mode) == HAL_HSP_POLLING_FOR_ANY_EVENT))

/**
  * @brief Verify the SNOOP Group.
  * @param  group  Group Indetifier.
  * @retval SET    Value is valid.
  * @retval RESET  Value is invalid.
  */
#define IS_HSP_SNOOP_GROUP(group)         \
  (((group) == HAL_HSP_SNOOP_GROUP_A)     \
   || ((group) == HAL_HSP_SNOOP_GROUP_B))

/**
  * @brief Verify the SNOOP Signal set.
  * @param  signal  Signal set.
  * @retval SET    Value is valid.
  * @retval RESET  Value is invalid.
  */
#define IS_HSP_SNOOP_SIGNAL(signal)                              \
  (((signal) == HAL_HSP_SNOOP_GRPA_TASK_2_1_0)                   \
   || ((signal) == HAL_HSP_SNOOP_GRPA_DMA_CH_2_1_0_IT)           \
   || ((signal) == HAL_HSP_SNOOP_GRPA_TRGIN_BUFF_ADC)            \
   || ((signal) == HAL_HSP_SNOOP_GRPA_TSC_PFCTNB_2_1_0)          \
   || ((signal) == HAL_HSP_SNOOP_GRPA_TSC_CMP_2_1_0)             \
   || ((signal) == HAL_HSP_SNOOP_GRPA_EVTCWKUP_SPEJUMP_SPEWFE)   \
   || ((signal) == HAL_HSP_SNOOP_GRPA_PE_2_1_0)                  \
   || ((signal) == HAL_HSP_SNOOP_GRPB_TASK_5_4_3)                \
   || ((signal) == HAL_HSP_SNOOP_GRPB_PRC_25_24_23)              \
   || ((signal) == HAL_HSP_SNOOP_GRPB_DCMD_CDEG_HDEG)            \
   || ((signal) == HAL_HSP_SNOOP_GRPB_TSC_PFCTNB_5_4_3)          \
   || ((signal) == HAL_HSP_SNOOP_GRPB_TSC_CMP_3)                 \
   || ((signal) == HAL_HSP_SNOOP_GRPB_TSC_PULSE_CALL_IF_IFTRUE)  \
   || ((signal) == HAL_HSP_SNOOP_GRPB_PE_5_4_3))

/**
  * @brief Verify the Critical Event value.
  * @param  events  Critical Events mask.
  * @retval SET    Value is valid.
  * @retval RESET  Value is invalid.
  */
#define IS_HSP_BREAK_CRITICAL_EVENT(events)                          \
  (((events) != HAL_HSP_BREAK_CRITICAL_EVENT_ALL)                    \
   && (STM32_IS_BIT_SET(HAL_HSP_BREAK_CRITICAL_EVENT_ALL, (events))))

/**
  * @brief Verify the Freeze Event value.
  * @param  events  Freeze Events mask.
  * @retval SET    Value is valid.
  * @retval RESET  Value is invalid.
  */
#define IS_HSP_BREAK_FREEZE_EVENT(events)                          \
  (((events) != HAL_HSP_BREAK_FREEZE_EVENT_ALL)                    \
   && (STM32_IS_BIT_SET(HAL_HSP_BREAK_FREEZE_EVENT_ALL, (events))))

/**
  * @brief Verify the Break Output value.
  * @param  id  Break Output id (@ref HAL_HSP_BREAK_OutputTypeDef).
  * @retval SET    Value is valid.
  * @retval RESET  Value is invalid.
  */
#define IS_HSP_BREAK_OUTPUT(id)         \
  (((id) == HAL_HSP_BREAK_OUTPUT_0)     \
   || ((id) == HAL_HSP_BREAK_OUTPUT_1)  \
   || ((id) == HAL_HSP_BREAK_OUTPUT_2)  \
   || ((id) == HAL_HSP_BREAK_OUTPUT_3))

/**
  * @brief Verify the Polling Mode value.
  * @param  mode  Polling mode (@ref HAL_HSP_POLLING_ModeTypeDef).
  * @retval SET    Value is valid.
  * @retval RESET  Value is invalid.
  */
#define IS_HSP_POLLING_MODE(mode)                \
  (((mode) == HAL_HSP_POLLING_FOR_ALL_EVENT)     \
   || ((mode) == HAL_HSP_POLLING_FOR_ANY_EVENT))

/**
  * @brief Verify the SPE Error Interrupts.
  * @param  interrupts  Interrupts mask.
  * @retval SET    Value is valid.
  * @retval RESET  Value is invalid.
  */
#define IS_HSP_IT_ERR_SPE(interrupts)                                \
  (((interrupts) > 0U)                                               \
   && (STM32_IS_BIT_SET(HAL_HSP_IT_ERR_SPE_ALL, (interrupts)) != 0U))

/**
  * @brief Verify the SPE Event Interrupts.
  * @param  interrupts  Interrupts mask.
  * @retval SET    Value is valid.
  * @retval RESET  Value is invalid.
  */
#define IS_HSP_IT_EVT_SPE(interrupts)                                \
  (((interrupts) > 0U)                                               \
   && (STM32_IS_BIT_SET((HAL_HSP_IT_EVT_SPE_ALL | HAL_HSP_IT_EVT_CMD_DIRECT_COMMAND_DONE), (interrupts)) != 0U))


/**
  * @}
  */

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @defgroup HSP_Private_Functions HSP Private Functions
  * @{
  */
static HAL_StatusTypeDef HSP_Reset(const HSP_HandleTypeDef *hhsp);

static void HSP_STREAM_Handler(HSP_HandleTypeDef *hhsp, uint32_t reg_evt_misr);
static void HSP_TCU_Handler(HSP_HandleTypeDef *hhsp, uint32_t reg_evt_misr);
static void HSP_CMD_Handler(HSP_HandleTypeDef *hhsp, uint32_t reg_evt_misr);
static void HSP_SPE_Handler(HSP_HandleTypeDef *hhsp, uint32_t reg_evt_misr);
static void HSP_TSC_Handler(HSP_HandleTypeDef *hhsp, uint32_t reg_evt_misr);

