zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
static void HSP_STREAM_Error_Handler(const HSP_HandleTypeDef *hhsp, uint32_t reg_err_misr, uint32_t *p_errors);
static void HSP_TRGIN_Error_Handler(const HSP_HandleTypeDef *hhsp, uint32_t reg_err_misr, uint32_t *p_errors);
static void HSP_TSC_Error_Handler(const HSP_HandleTypeDef *hhsp, uint32_t reg_err_misr, uint32_t *p_errors);
static void HSP_SPE_Error_Handler(const HSP_HandleTypeDef *hhsp, uint32_t reg_err_misr, uint32_t *p_errors);

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup HSP_Exported_Functions
  * @{
  */

/** @addtogroup HSP_Exported_Functions_Group1
  * @brief  Initialization and De-Initialization functions.
  *
@verbatim
 ===============================================================================
            ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Initialize the HSP peripheral and the associated handle
      (+) DeInitialize the HSP peripheral
      (+) Initialize the HSP MSP (MCU Specific Package)
      (+) DeInitialize the HSP MSP

@endverbatim
  * @{
  */

/**
  * @brief  Initialize the HSP according to the associated handle.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @note   If the selected HSP is locked, initialization can't be performed.
  *         To unlock the configuration, perform a system reset of the peripheral.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR HSP handle or instance is NULL.
  */
HAL_StatusTypeDef HAL_HSP_Init(HSP_HandleTypeDef *hhsp)
{
  const HSP_TypeDef *p_hspx;
  HAL_HSP_StateTypeDef state;

  /* Check the HSP handle allocation */
  if (hhsp == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  if (hhsp->Instance == NULL)
  {
    hhsp->last_error_codes = HAL_HSP_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  if (hhsp->global_state == HAL_HSP_STATE_FAULT)
  {
    return HAL_ERROR;
  }

  ASSERT_DBG_PARAM(IS_HSP_ALL_INSTANCE(hhsp->Instance));

  /* Init the peripheral */
  if (hhsp->global_state == HAL_HSP_STATE_RESET)
  {
#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
    /* Register the default callback functions */
    hhsp->EVT_SPE_RunStateCallback = HAL_HSP_EVT_SPE_RunStateCallback;
    hhsp->EVT_SPE_TaskCpltCallback = HAL_HSP_EVT_SPE_TaskCpltCallback;
    hhsp->EVT_SPE_DirectCommandCpltCallback = HAL_HSP_EVT_SPE_DirectCommandCpltCallback;
    hhsp->EVT_SPE_FPUSaturationCallback = HAL_HSP_EVT_SPE_FPUSaturationCallback;
    hhsp->EVT_TSC_TimestampReadyCallback = HAL_HSP_EVT_TSC_TimestampReadyCallback;
    hhsp->EVT_TCU_TaskStartedCallback = HAL_HSP_EVT_TCU_TaskStartedCallback;
    hhsp->EVT_TCU_TaskEndedCallback = HAL_HSP_EVT_TCU_TaskEndedCallback;
    hhsp->EVT_TCU_TaskOverlapCallback = HAL_HSP_EVT_TCU_TaskOverlapCallback;
    hhsp->EVT_STREAM_BufferEmptyCallback = HAL_HSP_EVT_STREAM_BufferEmptyCallback;
    hhsp->EVT_STREAM_BufferFullCallback = HAL_HSP_EVT_STREAM_BufferFullCallback;
    hhsp->FWEVT_ProcessingEventCallback = HAL_HSP_FWEVT_ProcessingEventCallback;
    hhsp->ErrorCallback = HAL_HSP_ErrorCallback;

    if (NULL == hhsp->MspInitCallback)
    {
      hhsp->MspInitCallback = HAL_HSP_MspInit;
    }

    if (NULL == hhsp->MspDeInitCallback)
    {
      hhsp->MspDeInitCallback = HAL_HSP_MspDeInit;
    }

    /* Init the low level hardware */
    hhsp->MspInitCallback(hhsp);
#else
    /* Init the low level hardware */
    HAL_HSP_MspInit(hhsp);
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */
  }

  /* Reset the last error codes */
  hhsp->last_error_codes = HAL_HSP_ERROR_NONE;
  hhsp->boot_error_code = 0U;
  hhsp->last_msgbox_error_code  = 0U;

  /* Reset pointer of HSP Performance Counter */
  hhsp->p_perf_counter = NULL;

  /* Reset CNN Safe mode */
  hhsp->backup_enabled_itfs = 0U;
  hhsp->backup_enabled_events = 0U;
  hhsp->backup_event_its = 0U;
  hhsp->backup_pfctevt_its = 0U;

  /* Reset Sub-Routine for IRQ Handlers */
  hhsp->stream_handler = NULL;
  hhsp->tcu_handler = NULL;
  hhsp->spe_handler = NULL;
  hhsp->tsc_handler = NULL;
  hhsp->cmd_handler = NULL;
  hhsp->stream_err_handler = NULL;
  hhsp->trgin_err_handler = NULL;
  hhsp->tsc_err_handler = NULL;
  hhsp->spe_err_handler = NULL;
  hhsp->fwevt_handler = NULL;

  /* Check Register Lock Status and set the Handle State as expected */
  p_hspx = HSP_GET_INSTANCE(hhsp);
  state = hhsp->global_state;
  if (STM32_IS_BIT_SET(p_hspx->CR, HSP_CR_REGLCK) || (state == HAL_HSP_STATE_RUNNING))
  {
    hhsp->global_state = HAL_HSP_STATE_RUNNING;
  }
  else
  {
    hhsp->global_state = HAL_HSP_STATE_INIT;

    /* Initialize CRAM & DRAM free sizes */
    hhsp->cram_free_size_in_word = HSP_GET_CRAM_SIZE_IN_WORD(hhsp->Instance);
    hhsp->dram_free_size_in_word = HSP_GET_DRAM_SIZE_IN_WORD(hhsp->Instance);

    /* Reset Plugin address */
    hhsp->cram_address_for_plugin = 0U;
  }

  return HAL_OK;
}

/**
  * @brief  DeInitialize the HSP peripheral.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @note  HAL_HSP_DeInit does not reset all registers.
  *        The Application must call RCC API to force the reset of all registers
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR wrong parameter.
  */
HAL_StatusTypeDef HAL_HSP_DeInit(HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM((hhsp != NULL));

  /* Check the HSP handle allocation */
  if (hhsp == NULL)
  {
    return HAL_ERROR;
  }

  ASSERT_DBG_PARAM(IS_HSP_ALL_INSTANCE(hhsp->Instance));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Disable all the Events, but if HSP Registers are locked, the disabling will failed */
  STM32_CLEAR_BIT(p_hspx->EVTENR, HSP_EVTENR_EVTEN_Msk);

  /* Disable all Interfaces, but if HSP Registers are locked, the disabling will failed */
  /* STM32_WRITE_REG allows to set the DCMDDIS bit and clear all others */
  STM32_WRITE_REG(p_hspx->ITFENR, HSP_ITFENR_DCMDDIS);

  /* Disable ITs & Clear Flags. */
  STM32_CLEAR_BIT(p_hspx->PFCTEVT_IER, HSP_PFCTEVT_IER_PFCTIE_Msk); /* Disable all PFCT Event Interrupts */
  STM32_WRITE_REG(p_hspx->PFCTEVT_ICR, HSP_PFCTEVT_ICR_PFCTC_Msk);  /* Clear all PFCT Event Flags        */

  STM32_CLEAR_BIT(p_hspx->EVT_IER, HSP_IT_EVT_ALL);  /* Disable all Event Interrupts */
  STM32_WRITE_REG(p_hspx->EVT_ICR, HSP_IT_EVT_ALL);  /* Clear all Event Flags        */

  STM32_CLEAR_BIT(p_hspx->ERR_IER, HSP_IT_ERR_ALL);  /* Disable all Error Interrupts */
  STM32_WRITE_REG(p_hspx->ERR_ICR, HSP_IT_ERR_ALL);  /* Clear all Error Flags        */

  /* Request the Reset of SPE - A HSP HW Reset must be done after */
  (void)HSP_Reset(hhsp);

#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
  /* Register the default callback functions */
  if (hhsp->MspDeInitCallback == NULL)
  {
    /* DeInit Callback not initialized as expected then force it to default MspDeInit */
    hhsp->MspDeInitCallback = HAL_HSP_MspDeInit;
  }

