zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  /* DeInit the low level hardware */
  hhsp->MspDeInitCallback(hhsp);
#else
  /* DeInit the low level hardware */
  HAL_HSP_MspDeInit(hhsp);
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS == 1 */

  /* Reset error codes */
  hhsp->last_error_codes = HAL_HSP_ERROR_NONE;
  hhsp->boot_error_code = 0U;
  hhsp->last_msgbox_error_code = 0U;

  /* Reset CRAM & DRAM data */
  hhsp->cram_free_size_in_word = 0U;
  hhsp->dram_free_size_in_word = 0U;
  hhsp->cram_address_for_plugin = 0U;

  /* Reset HSP state */
  hhsp->global_state = HAL_HSP_STATE_RESET;

  return HAL_OK;
}

/**
  * @brief  Initialize the HSP MSP.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval None
  */
__weak void HAL_HSP_MspInit(HSP_HandleTypeDef *hhsp)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhsp);

  /* NOTE : This function should not be modified, when the callback is needed,
          the HAL_HSP_MspInit could be implemented in the user file
  */
}

/**
  * @brief  DeInitialize the HSP MSP.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval None
  */
__weak void HAL_HSP_MspDeInit(HSP_HandleTypeDef *hhsp)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhsp);

  /* NOTE : This function should not be modified, when the callback is needed,
          the HAL_HSP_MspDeInit could be implemented in the user file
  */
}

/* Firmware/Plugin functions **************************************************/
/**
  * @brief Load HSP Firmware in CRAM & DRAM.
  * @param hhsp             Pointer to a @ref HSP_HandleTypeDef.
  * @param p_cram_bin       Pointer to the CRAM Firmware binary.
  * @param cram_size_bytes  Size in bytes of FW CRAM.
  * @param p_dram_bin       Pointer to the DRAM Firmware binary.
  * @param dram_size_bytes  Size in bytes of FW DRAM.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_INVALID_PARAM Array pointer is NULL.
  * @retval HAL_ERROR wrong parameter.
  */
HAL_StatusTypeDef HAL_HSP_LoadFirmware(HSP_HandleTypeDef *hhsp,
                                       const uint8_t *p_cram_bin, uint32_t cram_size_bytes,
                                       const uint8_t *p_dram_bin, uint32_t dram_size_bytes)
{
  ASSERT_DBG_PARAM(hhsp != NULL);

  if ((p_cram_bin == NULL) || (p_dram_bin == NULL))
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  ASSERT_DBG_PARAM((cram_size_bytes > 0UL));
  ASSERT_DBG_PARAM((cram_size_bytes < (hhsp->cram_free_size_in_word * 4U)));
  ASSERT_DBG_PARAM((dram_size_bytes > 0UL));
  ASSERT_DBG_PARAM((dram_size_bytes < (hhsp->dram_free_size_in_word * 4U)));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, HAL_HSP_STATE_INIT);

  /* Write data in HSP CRAM --------------------------------------------------*/
  volatile uint8_t *tmpAddr = (uint8_t *)HSP_GET_CRAM_BASE_ADDRESS(hhsp->Instance);

  for (uint32_t i = 0; i < cram_size_bytes; i++)
  {
    *tmpAddr = p_cram_bin[i];
    tmpAddr++;
  }

  /* Back to the last CRAM data */
  uint32_t *tmpAddr32 = ((uint32_t *)(uint32_t)tmpAddr);
  tmpAddr32--;

  /* Check if End FW Pattern is loaded */
  if (*tmpAddr32 != HSP_FW_END_PATTERN)
  {
    /* No "End" Pattern found. Then store the next cram address to load plugin */
    tmpAddr32++;
    hhsp->cram_free_size_in_word -= (cram_size_bytes / 4UL);
  }
  else
  {
    /* Store the cram address of the pattern which is override when loading the first plugin */
    hhsp->cram_free_size_in_word -= ((cram_size_bytes / 4UL) - 1UL); /* -1 to keep a word for End Pattern */
  }

  hhsp->cram_address_for_plugin = (uint32_t)tmpAddr32;

  /* Write data in HSP DRAM --------------------------------------------------*/
  tmpAddr = (uint8_t *)HSP_GET_DRAM_BASE_ADDRESS(hhsp->Instance);
  for (uint32_t i = 0; i < dram_size_bytes; i++)
  {
    *tmpAddr = p_dram_bin[i];
    tmpAddr++;
  }

  /* Compute the size of free DRAM */
  hhsp->dram_free_size_in_word -= (dram_size_bytes / 4UL);

  hhsp->global_state = HAL_HSP_STATE_READY_TO_BOOT;

  return HAL_OK;
}

/**
  * @brief Load HSP Plugin in CRAM.
  * @param hhsp          Pointer to a @ref HSP_HandleTypeDef.
  * @param p_plugin_bin  Pointer to the CRAM FW binary.
  * @param size_bytes    Number of bytes to load in CRAM.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_INVALID_PARAM Array pointer is NULL.
  * @retval HAL_ERROR wrong parameter.
  */
HAL_StatusTypeDef HAL_HSP_LoadPlugin(HSP_HandleTypeDef *hhsp, const uint8_t *p_plugin_bin, uint32_t size_bytes)
{
  ASSERT_DBG_PARAM(hhsp != NULL);

  if (p_plugin_bin == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  ASSERT_DBG_PARAM((size_bytes > 0UL));
  ASSERT_DBG_PARAM((size_bytes < (hhsp->cram_free_size_in_word * 4U)));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, HAL_HSP_STATE_READY_TO_BOOT);

  /* Write data in HSP CRAM */
  volatile uint8_t *tmpAddr = (uint8_t *)(hhsp->cram_address_for_plugin);

  for (uint32_t i = 0; i < size_bytes; i++)
  {
    *tmpAddr = p_plugin_bin[i];
    tmpAddr++;
  }

  /* Compute the size of free CRAM */
  hhsp->cram_free_size_in_word -= (size_bytes / 4UL);

  /* Store the free CRAM address to load the next plugin */
  hhsp->cram_address_for_plugin = (uint32_t)tmpAddr;

  return HAL_OK;
}

/* Boot functions *************************************************************/
/**
  * @brief Boot the HSP.
  * @param hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param p_config    Pointer to Boot configuration.
  * @param timeout_ms  Timeout in millisecond
  * @retval HAL_OK             Operation Completed successfully.
  * @retval HAL_INVALID_PARAM  Boot Config pointer is NULL.
  * @retval HAL_ERROR          HSP Boot Failure.
  */
HAL_StatusTypeDef HAL_HSP_Boot(HSP_HandleTypeDef *hhsp, const HAL_HSP_Boot_ConfigTypeDef *p_config,
                               uint32_t timeout_ms)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);

  /* Check the parameters */
  if (p_config == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  ASSERT_DBG_PARAM(IS_HSP_PERF_MONITOR_STATE(p_config->perf_mon));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, HAL_HSP_STATE_READY_TO_BOOT);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Close the FW */
  *((__IO uint32_t *)(hhsp->cram_address_for_plugin)) = HSP_FW_END_PATTERN;
  hhsp->dram_free_size_in_word--;

  /* Boot the HSP */
  STM32_SET_BIT(p_hspx->CR, HSP_CR_BOOTEN);

  /* Get timeout */
  uint32_t tickstart = HAL_GetTick();

  while (STM32_READ_BIT(p_hspx->CR, HSP_CR_BSTAT_Msk) != p_config->boot_success_code)
  {
    /* Check for the Timeout */
    if ((HAL_GetTick() - tickstart) > timeout_ms)
    {
      /* New check to avoid false timeout detection in case of preemption */
      uint32_t bstat = STM32_READ_BIT(p_hspx->CR, HSP_CR_BSTAT_Msk);
      if (bstat != p_config->boot_success_code)
      {
        hhsp->last_error_codes |= HAL_HSP_ERROR_BOOT;
        hhsp->boot_error_code = bstat;
        hhsp->global_state = HAL_HSP_STATE_FAULT;
        return HAL_ERROR;
      }
    }
  }

  /* The Boot is OK, but before to transmit the BRAM address and the performance monitor state */
  /* to finalize the boot, we put the handle state to READY to allow the call of HAL_HSP_MSGBOX_SendCommand */
  hhsp->global_state = HAL_HSP_STATE_RUNNING;

