zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  /* FW need to know this address at boot */
  uint32_t bramab_address = HSP_GET_BRAMAB_BASE_ADDRESS((uint32_t)(hhsp->Instance));
  HAL_HSP_WriteParameter(hhsp, HAL_HSP_PARAM_0, bramab_address);
  HAL_HSP_WriteParameter(hhsp, HAL_HSP_PARAM_1, (uint32_t)p_config->perf_mon);

  if (HAL_HSP_MSGBOX_SendCommand(hhsp, p_config->boot_cmd_id, timeout_ms) != HAL_OK)
  {
    hhsp->global_state = HAL_HSP_STATE_FAULT;
    return HAL_ERROR;
  }

  /* Retrieve the Performance Cycle Counter */
  hhsp->p_perf_counter = (((uint32_t *)bramab_address) + p_config->perf_counter_offset);

  /* Enable all event generators: CDEG, CSEG */
  STM32_SET_BIT(p_hspx->ITFENR, (HSP_ITFENR_CSEGEN | HSP_ITFENR_CDEGEN));

  /* HSP is ready to be configured, record processing list or process direct command */
  hhsp->global_state = HAL_HSP_STATE_RUNNING;

  /* Write Protection of CRAM & DRAM from any CPU access to prevent any corruption */
  /* CRAM & DRAM become read-only access */
  STM32_MODIFY_REG(p_hspx->CR, HSP_CR_CDRLCK_Msk, HSP_CR_CDRLCK_0);

  return HAL_OK;
}

/* Capabilities ***************************************************************/
/**
  * @brief  Retrieve the Firmware versions (ROM & RAM).
  * @param  hhsp       Pointer to a @ref HSP_HandleTypeDef.
  * @note  The call of this function must be done after booting the HSP
  * @return Return the FWVERR register value
  */
uint32_t HAL_HSP_GetFirmwareVersion(const HSP_HandleTypeDef *hhsp)
{
  const HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  return STM32_READ_REG(p_hspx->FWVERR);
}

/**
  * @brief Get the HSP capabilities.
  * @param hhsp            Pointer to a @ref HSP_HandleTypeDef.
  * @param p_capabilities  Pointer to capabilities structure.
  * @retval HAL_OK     Operation Completed successfully.
  * @retval HAL_ERROR  Invalid parameter.
  */
HAL_StatusTypeDef HAL_HSP_GetCapabilities(HSP_HandleTypeDef *hhsp, HAL_HSP_CapabilitiesTypeDef *p_capabilities)
{
  ASSERT_DBG_PARAM(hhsp != NULL);

  /* Check the parameters */
  if (p_capabilities == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  switch ((uint32_t)hhsp->Instance)
  {
    case (uint32_t)HSP1_BASE:
      p_capabilities->bramab_base_address = HSP1_BRAMAB_BASE;
      p_capabilities->bramab_size_byte = HSP1_BRAMAB_SIZE;
      p_capabilities->brama_base_address = HSP1_BRAMA_BASE;
      p_capabilities->bramb_base_address = HSP1_BRAMB_BASE;
      break;
    default:
      p_capabilities->bramab_base_address = 0UL;
      p_capabilities->bramab_size_byte = 0UL;
      p_capabilities->brama_base_address = 0UL;
      p_capabilities->bramb_base_address = 0UL;
      break;
  }

  return HAL_OK;
}


/**
  * @}
  */

/** @addtogroup HSP_Exported_Functions_Group2
  *
@verbatim
  ==============================================================================
                  ##### HSP Processing List configuration #####
  ==============================================================================
  [..]
    This section provides functions allowing to:
    (+) Start configuration sequence of a processing list
    (+) End configuration sequence of a processing list
    (+) Trig a processing list
    (+) Reset a processing list

@endverbatim
  * @{
  */
/**
  * @brief  Wait the end of a direct command.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  timeout_ms  Timeout in millisecond.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_TIMEOUT Timeout occurred.
  */
HAL_StatusTypeDef HAL_HSP_DIRECT_WaitEndOfCommand(const HSP_HandleTypeDef *hhsp, uint32_t timeout_ms)
{
  const HSP_TypeDef *p_hspx;
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hhsp != NULL);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Check if timeout is disabled (set to infinite wait) */
  if (timeout_ms != HAL_MAX_DELAY)
  {
    /* Get tick count */
    tickstart = HAL_GetTick();

    do
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0UL))
      {
        return HAL_TIMEOUT;
      }
    } while (STM32_READ_BIT(p_hspx->DCMDSR, HSP_DCMDSR_DCBSY) != 0U);
  }
  else
  {
    while (STM32_READ_BIT(p_hspx->DCMDSR, HSP_DCMDSR_DCBSY) != 0U)
    {}
  }

  return HAL_OK;
}

/**
  * @brief  Send a command by msgbox.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  cmd_id      Command ID
  * @param  timeout_ms  Timeout in millisecond.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Failed to send the command.
  * @retval HAL_BUSY  Send of Command is pending
  * @retval HAL_TIMEOUT Timeout occurred.
  */
HAL_StatusTypeDef HAL_HSP_MSGBOX_SendCommand(HSP_HandleTypeDef *hhsp, uint32_t cmd_id, uint32_t timeout_ms)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Read the HSP_C2HSEM bit via the CPU to HSP message control register (HSP_C2HSEMR)           */
  /* Wait until HSP_C2HSEM = 0. It indicates that the previous message has been read by the HSP, */
  /* and the content of C2HDATA can be overwrite. */
  if (STM32_READ_BIT(p_hspx->C2HSEMR, HSP_C2HSEMR_C2HSEM) == HSP_C2HSEMR_C2HSEM)
  {
    return HAL_BUSY;
  }

  /* Write command in mailbox */
  STM32_WRITE_REG(p_hspx->C2HMSGDR, cmd_id);
  STM32_SET_BIT(p_hspx->C2HSEMR, HSP_C2HSEMR_C2HSEM);

  /* Wait the answer of SPE */
  uint32_t tickstart = HAL_GetTick();

  while (STM32_READ_BIT(p_hspx->H2CSEMR, HSP_H2CSEMR_H2CSEM) == 0U)
  {
    /* Check for the Timeout */
    if ((HAL_GetTick() - tickstart) > timeout_ms)
    {
      return HAL_TIMEOUT;
    }
  }

  /* Read the SPE answer via HSP_H2CMSGDR register (HSP to CPU message data register). */
  uint32_t status = STM32_READ_REG(p_hspx->H2CMSGDR);

  /* Indicate to the HSP that the message is read */
  /* When CPU writes the bit H2CSEM to 1, it clears it to 0 ! */
  STM32_WRITE_REG(p_hspx->H2CSEMR, HSP_H2CSEMR_H2CSEM);

  /* Even if ITs are not enabled, the driver must clear the folowwings flags: */
  /*  - HSP_EVT_ISR_H2CMRDYF  indicating a message is available for the CPU   */
  /*  - HSP_EVT_ICR_C2HMFREEF indicating the MSGB is free for CPU to SPE      */
  STM32_WRITE_REG(p_hspx->EVT_ICR, (HSP_EVT_ICR_H2CMRDYC | HSP_EVT_ICR_C2HMFREEC));

  /* Check the HSP status */
  if (status != 0U)
  {
    hhsp->last_msgbox_error_code = status;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @}
  */

