zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
/** @addtogroup HSP_Exported_Functions_Group3_2
  * @{
  */
/* STREAM Interface ----------------------------------------------------------*/
/**
  * @brief  Configure a STREAM instance.
  * @param  hhsp       Pointer to a @ref HSP_HandleTypeDef.
  * @param  stream_id  STREAM Buffer id.
  * @param  p_config   Pointer to a @ref HAL_HSP_STREAM_Buffer_ConfigTypeDef.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Config pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_STREAM_SetConfig(HSP_HandleTypeDef *hhsp, HAL_HSP_STREAM_BufferTypeDef stream_id,
                                           const HAL_HSP_STREAM_Buffer_ConfigTypeDef *p_config)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

  if (p_config == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  ASSERT_DBG_PARAM(IS_HSP_STREAM_BUFFER(stream_id));
  ASSERT_DBG_PARAM(IS_HSP_STREAM_BUFFER_DIRECTION(p_config->direction));
  ASSERT_DBG_PARAM(IS_HSP_STREAM_BUFFER_SYNC_STATE(p_config->sync_state));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  if (p_config->direction == HAL_HSP_STREAM_BUFFER_DIRECTION_RX)
  {
    STM32_CLEAR_BIT(p_hspx->BUFFCFGR, (HSP_BUFFCFGR_BUFF0DIR << (uint32_t)(stream_id)));
  }
  else
  {
    STM32_SET_BIT(p_hspx->BUFFCFGR, (HSP_BUFFCFGR_BUFF0DIR << (uint32_t)(stream_id)));
  }

  if (p_config->sync_state == HAL_HSP_STREAM_BUFFER_SYNC_DISABLE)
  {
    STM32_CLEAR_BIT(p_hspx->BUFFCFGR, (HSP_BUFFCFGR_COMB0 << (uint32_t)(stream_id)));
  }
  else
  {
    STM32_SET_BIT(p_hspx->BUFFCFGR, (HSP_BUFFCFGR_COMB0 << (uint32_t)(stream_id)));
  }

  return HAL_OK;
}

/**
  * @brief  Get the configuration of a STREAM instance.
  * @param  hhsp      Pointer to a @ref HSP_HandleTypeDef.
  * @param  stream_id  STREAM Buffer id.
  * @param  p_config  Pointer to a @ref HAL_HSP_STREAM_Buffer_ConfigTypeDef.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Config pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_STREAM_GetConfig(HSP_HandleTypeDef *hhsp, HAL_HSP_STREAM_BufferTypeDef stream_id,
                                           HAL_HSP_STREAM_Buffer_ConfigTypeDef *p_config)
{
  const HSP_TypeDef *p_hspx;
  uint32_t value;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_HSP_STREAM_BUFFER(stream_id));

  if (p_config == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  HSP_ASSERT_DBG_STATE(hhsp->global_state, ((uint32_t)HAL_HSP_STATE_RUNNING | (uint32_t)HAL_HSP_STATE_FAULT));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Get the Direction */
  value = STM32_READ_BIT(p_hspx->BUFFCFGR, (HSP_BUFFCFGR_BUFF0DIR << (uint32_t)(stream_id)));
  if (value == 0U)
  {
    p_config->direction = HAL_HSP_STREAM_BUFFER_DIRECTION_RX;
  }
  else
  {
    p_config->direction = HAL_HSP_STREAM_BUFFER_DIRECTION_TX;
  }

  /* Get the Sync State */
  value = STM32_READ_BIT(p_hspx->BUFFCFGR, (HSP_BUFFCFGR_COMB0 << (uint32_t)(stream_id)));
  if (value == 0U)
  {
    p_config->sync_state = HAL_HSP_STREAM_BUFFER_SYNC_DISABLE;
  }
  else
  {
    p_config->sync_state = HAL_HSP_STREAM_BUFFER_SYNC_ENABLE;
  }

  return HAL_OK;
}

/**
  * @brief  Enable the Integer to Float conversion for all STREAM interfaces.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_STREAM_EnableIntToFloat(const HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_SET_BIT(p_hspx->BUFFCFGR, HSP_BUFFCFGR_I2FEN);

  return HAL_OK;
}

/**
  * @brief  Disable the Integer to Float conversion for all STREAM interfaces.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_STREAM_DisableIntToFloat(const HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_CLEAR_BIT(p_hspx->BUFFCFGR, HSP_BUFFCFGR_I2FEN);

  return HAL_OK;
}

/**
  * @brief  Return the Integer to Float conversion status.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval HAL_HSP_STREAM_INT_TO_FLOAT_DISABLED Conversion is disabled.
  * @retval HAL_HSP_STREAM_INT_TO_FLOAT_ENABLED  Conversion is enabled.
  */
HAL_HSP_STREAM_IntToFloat_StatusTypeDef HAL_HSP_STREAM_IsEnabledIntToFloat(const HSP_HandleTypeDef *hhsp)
{
  const HSP_TypeDef *p_hspx;
  uint32_t status;

  ASSERT_DBG_PARAM((hhsp != NULL));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  status = STM32_READ_BIT(p_hspx->BUFFCFGR, HSP_BUFFCFGR_I2FEN);
  return ((status == 0U) ? HAL_HSP_STREAM_INT_TO_FLOAT_DISABLED : HAL_HSP_STREAM_INT_TO_FLOAT_ENABLED);
}

/**
  * @brief  Start all the STREAM Buffers.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @param  evt_interrupts  mask of event interrupts
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_IT_EVT_STREAM0_READY
  *             @arg HAL_HSP_IT_EVT_STREAM1_READY
  *             @arg HAL_HSP_IT_EVT_STREAM2_READY
  *             @arg HAL_HSP_IT_EVT_STREAM3_READY
  *             @arg HAL_HSP_IT_EVT_STREAM_ALL
  * @param  err_interrupts  mask of error interrupts
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_IT_ERR_STREAM0_OVR
  *             @arg HAL_HSP_IT_ERR_STREAM1_OVR
  *             @arg HAL_HSP_IT_ERR_STREAM2_OVR
  *             @arg HAL_HSP_IT_ERR_STREAM3_OVR
  *             @arg HAL_HSP_IT_ERR_STREAM_ALL
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_STREAM_Start(HSP_HandleTypeDef *hhsp,
                                       uint32_t evt_interrupts, uint32_t err_interrupts)
{
  HSP_TypeDef *p_hspx;

