zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  ASSERT_DBG_PARAM(hhsp != NULL);

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_SET_BIT(p_hspx->ITFENR, HSP_ITFENR_STREAMEN);

  if (evt_interrupts != 0U)
  {
    hhsp->stream_handler = HSP_STREAM_Handler;
    STM32_SET_BIT(p_hspx->EVT_IER, evt_interrupts);
  }

  if (err_interrupts != 0U)
  {
    hhsp->stream_err_handler = HSP_STREAM_Error_Handler;
    STM32_SET_BIT(p_hspx->ERR_IER, err_interrupts);
  }

  return HAL_OK;
}

/**
  * @brief  Disable all the STREAM Buffer.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_STREAM_Stop(HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_CLEAR_BIT(p_hspx->ITFENR, HSP_ITFENR_STREAMEN);
  STM32_CLEAR_BIT(p_hspx->EVT_IER, HAL_HSP_IT_EVT_STREAM_ALL);
  STM32_CLEAR_BIT(p_hspx->ERR_IER, HAL_HSP_IT_ERR_STREAM_ALL);

  hhsp->stream_handler = NULL;
  hhsp->stream_err_handler = NULL;

  return HAL_OK;
}

/**
  * @brief  Get a STREAM Buffer address.
  * @param  hhsp       Pointer to a HSP_HandleTypeDef.
  * @param  stream_id  Stream buffer id.
  * @retval Stream Buffer Address
  */
volatile uint32_t *HAL_HSP_STREAM_GetBufferAddress(const HSP_HandleTypeDef *hhsp,
                                                   HAL_HSP_STREAM_BufferTypeDef stream_id)
{
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_STREAM_BUFFER(stream_id));

  return (volatile uint32_t *) & (hhsp->Instance->BUFFDR[(uint32_t)stream_id]);
}

/**
  * @}
  */

/** @addtogroup HSP_Exported_Functions_Group3_3 HSP TRGIN Interface
  * @{
  */
/* TRGIN Interface -----------------------------------------------------------*/
/**
  * @brief  Configure a TRGIN instance.
  * @param  hhsp      Pointer to a @ref HSP_HandleTypeDef.
  * @param  trgin_ids        TRGIN instance id
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_TRGIN_1
  *             @arg HAL_HSP_TRGIN_2
  *             @arg HAL_HSP_TRGIN_3
  *             @arg HAL_HSP_TRGIN_4
  *             @arg HAL_HSP_TRGIN_5
  *             @arg HAL_HSP_TRGIN_6
  *             @arg HAL_HSP_TRGIN_7
  *             @arg HAL_HSP_TRGIN_8
  *             @arg HAL_HSP_TRGIN_9
  *             @arg HAL_HSP_TRGIN_ALL
  * @param  p_config  Pointer to a @ref HAL_HSP_TRGIN_ConfigTypeDef.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Config pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_TRGIN_SetConfig(HSP_HandleTypeDef *hhsp, uint32_t trgin_ids,
                                          const HAL_HSP_TRGIN_ConfigTypeDef *p_config)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);

  if (p_config == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  ASSERT_DBG_PARAM(IS_HSP_TRGIN_COMBINATION(trgin_ids));
  ASSERT_DBG_PARAM(IS_HSP_TRGIN_POLARITY(p_config->polarity));
  ASSERT_DBG_PARAM(IS_HSP_TRGIN_SOURCE(p_config->source));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* configure the polarity */
  uint32_t trgins_mask = (trgin_ids >> HSP_ITFENR_TRGI0EN_Pos);
  uint32_t trgins_pol_mask = (trgins_mask << HSP_TRGINCFGR_TRG0POL_Pos);
  if (p_config->polarity == HAL_HSP_TRGIN_POLARITY_RISING)
  {
    STM32_CLEAR_BIT(p_hspx->TRGINCFGR, trgins_pol_mask);
  }
  else
  {
    STM32_SET_BIT(p_hspx->TRGINCFGR, trgins_pol_mask);
  }

  /* Check if TRGIN 0 to 3 must be configured */
  uint32_t trgin_mask = (trgins_mask & 0xFU);
  if (trgin_mask != 0U)
  {
    uint32_t reg_value = 0UL;
    uint32_t bitfiled_pos = 0UL;
    uint32_t reg_mask = 0UL;
    if ((trgin_mask & 0x1U) != 0U)
    {
      reg_mask = HSP_TRGINSELR0_TRG0SEL_Msk;
      reg_value = (uint32_t)p_config->source;
    }

    bitfiled_pos += HSP_REG_TRGINSEL_SELECT_FIELD_SIZE;
    if ((trgin_mask & 0x2U) != 0U)
    {
      reg_mask |= HSP_TRGINSELR0_TRG0SEL_Msk << bitfiled_pos;
      reg_value |= ((uint32_t)p_config->source << bitfiled_pos);
    }

    bitfiled_pos += HSP_REG_TRGINSEL_SELECT_FIELD_SIZE;
    if ((trgin_mask & 0x4U) != 0U)
    {
      reg_mask |= HSP_TRGINSELR0_TRG0SEL_Msk << bitfiled_pos;
      reg_value |= ((uint32_t)p_config->source << bitfiled_pos);
    }

    bitfiled_pos += HSP_REG_TRGINSEL_SELECT_FIELD_SIZE;
    if ((trgin_mask & 0x8U) != 0U)
    {
      reg_mask |= HSP_TRGINSELR0_TRG0SEL_Msk << bitfiled_pos;
      reg_value |= ((uint32_t)p_config->source << bitfiled_pos);
    }

    STM32_MODIFY_REG(p_hspx->TRGINSELR0, reg_mask, reg_value);
  }

  /* Check if TRGIN 4 to 7 must be configure */
  trgin_mask = (trgins_mask & 0xF0U) >> 4U;
  if (trgin_mask != 0U)
  {
    uint32_t reg_value = 0UL;
    uint32_t bitfiled_pos = 0UL;
    uint32_t reg_mask = 0UL;
    if ((trgin_mask & 0x1U) != 0U)
    {
      reg_mask = HSP_TRGINSELR0_TRG0SEL_Msk;
      reg_value = (uint32_t)p_config->source;
    }

    bitfiled_pos += HSP_REG_TRGINSEL_SELECT_FIELD_SIZE;
    if ((trgin_mask & 0x2U) != 0U)
    {
      reg_mask |= HSP_TRGINSELR0_TRG0SEL_Msk << bitfiled_pos;
      reg_value |= ((uint32_t)p_config->source << bitfiled_pos);
    }

    bitfiled_pos += HSP_REG_TRGINSEL_SELECT_FIELD_SIZE;
    if ((trgin_mask & 0x4U) != 0U)
    {
      reg_mask |= HSP_TRGINSELR0_TRG0SEL_Msk << bitfiled_pos;
      reg_value |= ((uint32_t)p_config->source << bitfiled_pos);
    }

    bitfiled_pos += HSP_REG_TRGINSEL_SELECT_FIELD_SIZE;
    if ((trgin_mask & 0x8U) != 0U)
    {
      reg_mask |= HSP_TRGINSELR0_TRG0SEL_Msk << bitfiled_pos;
      reg_value |= ((uint32_t)p_config->source << bitfiled_pos);
    }

    STM32_MODIFY_REG(p_hspx->TRGINSELR1, reg_mask, reg_value);
  }

  /* Check if TRGIN 8 to 9 must be configure */
  trgin_mask = (trgins_mask & 0xF00U) >> 8U;
  if (trgin_mask != 0U)
  {
    uint32_t reg_value = 0UL;
    uint32_t bitfiled_pos = 0UL;
    uint32_t reg_mask = 0UL;
    if ((trgin_mask & 0x1U) != 0U)
    {
      reg_mask = HSP_TRGINSELR0_TRG0SEL_Msk;
      reg_value = (uint32_t)p_config->source;
    }

    bitfiled_pos += HSP_REG_TRGINSEL_SELECT_FIELD_SIZE;
    if ((trgin_mask & 0x2U) != 0U)
    {
      reg_mask |= HSP_TRGINSELR0_TRG0SEL_Msk << bitfiled_pos;
      reg_value |= ((uint32_t)p_config->source << bitfiled_pos);
    }

    bitfiled_pos += HSP_REG_TRGINSEL_SELECT_FIELD_SIZE;
    if ((trgin_mask & 0x4U) != 0U)
    {
      reg_mask |= HSP_TRGINSELR0_TRG0SEL_Msk << bitfiled_pos;
      reg_value |= ((uint32_t)p_config->source << bitfiled_pos);
    }

    bitfiled_pos += HSP_REG_TRGINSEL_SELECT_FIELD_SIZE;
    if ((trgin_mask & 0x8U) != 0U)
    {
      reg_mask |= HSP_TRGINSELR0_TRG0SEL_Msk << bitfiled_pos;
      reg_value |= ((uint32_t)p_config->source << bitfiled_pos);
    }

    STM32_MODIFY_REG(p_hspx->TRGINSELR2, reg_mask, reg_value);
  }

  return HAL_OK;
}

/**
  * @brief  Get the configuration of a TRGIN instance.
  * @param  hhsp      Pointer to a @ref HSP_HandleTypeDef.
  * @param  trgin_id  TRGIN instance id.
  *         This parameter can be one of following values:
  *             @arg HAL_HSP_TRGIN_1
  *             @arg HAL_HSP_TRGIN_2
  *             @arg HAL_HSP_TRGIN_3
  *             @arg HAL_HSP_TRGIN_4
  *             @arg HAL_HSP_TRGIN_5
  *             @arg HAL_HSP_TRGIN_6
  *             @arg HAL_HSP_TRGIN_7
  *             @arg HAL_HSP_TRGIN_8
  *             @arg HAL_HSP_TRGIN_9
  * @param  p_config  Pointer to a @ref HAL_HSP_TRGIN_ConfigTypeDef.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Config pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_TRGIN_GetConfig(HSP_HandleTypeDef *hhsp, uint32_t trgin_id,
                                          HAL_HSP_TRGIN_ConfigTypeDef *p_config)
{
  const HSP_TypeDef *p_hspx;
  uint32_t reg_idx;
  uint32_t reg_pos;
  uint32_t bitfield_idx;
  uint32_t reg_mask;
  uint32_t reg_value;

