zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_HSP_TRGIN(trgin_id));

  if (p_config == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  HSP_ASSERT_DBG_STATE(hhsp->global_state, ((uint32_t)HAL_HSP_STATE_RUNNING | (uint32_t)HAL_HSP_STATE_FAULT));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Get the polarity */
  uint32_t trgin_mask = (trgin_id >> HSP_ITFENR_TRGI0EN_Pos);

  if (STM32_READ_BIT(p_hspx->TRGINCFGR, trgin_mask) == 0U)
  {
    p_config->polarity = HAL_HSP_TRGIN_POLARITY_RISING;
  }
  else
  {
    p_config->polarity = HAL_HSP_TRGIN_POLARITY_FALLING;
  }

  /* Get the trigger source */
  uint32_t id = STM32_POSITION_VAL(trgin_mask);
  reg_idx = ((uint32_t)id) / HSP_REG_TRGINSEL_CFG_NBR;
  bitfield_idx = ((uint32_t)id) % HSP_REG_TRGINSEL_CFG_NBR;
  reg_pos = HSP_TRGINSELR0_TRG0SEL_Pos + ((uint32_t)bitfield_idx * HSP_REG_TRGINSEL_SELECT_FIELD_SIZE);
  reg_mask = (HSP_TRGINSELR0_TRG0SEL_Msk << reg_pos);

  switch (reg_idx)
  {
    case 0:
    {
      reg_value = STM32_READ_BIT(p_hspx->TRGINSELR0, reg_mask) >> reg_pos;
      break;
    }
    case 1:
    {
      reg_value = STM32_READ_BIT(p_hspx->TRGINSELR1, reg_mask) >> reg_pos;
      break;
    }
    case 2:
    {
      reg_value = STM32_READ_BIT(p_hspx->TRGINSELR2, reg_mask) >> reg_pos;
      break;
    }
    default:
    {
      return HAL_ERROR;
      break;
    }
  }

  p_config->source = (HAL_HSP_TRGIN_SourceTypeDef)reg_value;

  return HAL_OK;
}

/**
  * @brief  Enable a TRGIN instance.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @param  trgin_ids    TRGIN instance id.
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_TRGIN_1
  *             @arg HAL_HSP_TRGIN_2
  *             @arg HAL_HSP_TRGIN_3
  *             @arg HAL_HSP_TRGIN_4
  *             @arg HAL_HSP_TRGIN_5
  *             @arg HAL_HSP_TRGIN_6
  *             @arg HAL_HSP_TRGIN_7
  *             @arg HAL_HSP_TRGIN_8
  *             @arg HAL_HSP_TRGIN_9
  *             @arg HAL_HSP_TRGIN_ALL
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_TRGIN_Enable(HSP_HandleTypeDef *hhsp, uint32_t trgin_ids)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_TRGIN_COMBINATION(trgin_ids));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_SET_BIT(p_hspx->ITFENR, trgin_ids);

  return HAL_OK;
}

/**
  * @brief  Disable a TRGIN instance.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @param  trgin_ids Set of TRGIN instance
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_TRGIN_1
  *             @arg HAL_HSP_TRGIN_2
  *             @arg HAL_HSP_TRGIN_3
  *             @arg HAL_HSP_TRGIN_4
  *             @arg HAL_HSP_TRGIN_5
  *             @arg HAL_HSP_TRGIN_6
  *             @arg HAL_HSP_TRGIN_7
  *             @arg HAL_HSP_TRGIN_8
  *             @arg HAL_HSP_TRGIN_9
  *             @arg HAL_HSP_TRGIN_ALL
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_TRGIN_Disable(HSP_HandleTypeDef *hhsp, uint32_t trgin_ids)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_TRGIN_COMBINATION(trgin_ids));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_CLEAR_BIT(p_hspx->ITFENR, trgin_ids);

  return HAL_OK;
}

/**
  * @brief  Check if the TRGIN x Interface is enabled.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @param  trgin_id  TRGIN instance id.
  *         This parameter can be one of following values:
  *             @arg HAL_HSP_TRGIN_1
  *             @arg HAL_HSP_TRGIN_2
  *             @arg HAL_HSP_TRGIN_3
  *             @arg HAL_HSP_TRGIN_4
  *             @arg HAL_HSP_TRGIN_5
  *             @arg HAL_HSP_TRGIN_6
  *             @arg HAL_HSP_TRGIN_7
  *             @arg HAL_HSP_TRGIN_8
  *             @arg HAL_HSP_TRGIN_9
  * @retval HAL_HSP_TRGIN_DISABLED  The TRGIN instance is disabled
  * @retval HAL_HSP_TRGIN_ENABLED   The TRGIN instance is enabled
  */
HAL_HSP_TRGIN_StatusTypeDef HAL_HSP_TRGIN_IsEnabled(const HSP_HandleTypeDef *hhsp, uint32_t trgin_id)
{
  const HSP_TypeDef *p_hspx;
  uint32_t status;

  ASSERT_DBG_PARAM((hhsp != NULL));
  ASSERT_DBG_PARAM(IS_HSP_TRGIN(trgin_id));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  status = STM32_READ_BIT(p_hspx->ITFENR, trgin_id);

  return ((status == 0U) ? HAL_HSP_TRGIN_DISABLED : HAL_HSP_TRGIN_ENABLED);
}

/**
  * @brief  Enable TRGIN Error Interrupts.
  * @param  hhsp      Pointer to a @ref HSP_HandleTypeDef.
  * @param  interrupts  Mask of TRGIN Error Interrupts
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_IT_ERR_TRGIN_OVR
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_TRGIN_EnableIT(HSP_HandleTypeDef *hhsp, uint32_t interrupts)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_TRGIN_IT_ERR(interrupts));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  if (interrupts != HAL_HSP_IT_NONE)
  {
    hhsp->trgin_err_handler = HSP_TRGIN_Error_Handler;
    STM32_SET_BIT(p_hspx->ERR_IER, interrupts);
  }

  return HAL_OK;
}

/**
  * @brief  Disable the TRGIN Error Interrupts.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @param  interrupts  Mask of TRGIN Error Interrupts
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_IT_ERR_TRGIN_OVR
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_TRGIN_DisableIT(HSP_HandleTypeDef *hhsp, uint32_t interrupts)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_TRGIN_IT_ERR(interrupts));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_CLEAR_BIT(p_hspx->ERR_IER, interrupts);
  if (STM32_READ_BIT(p_hspx->ERR_IER, HAL_HSP_IT_ERR_TRGIN_ALL) == 0U)
  {
    hhsp->trgin_err_handler = NULL;
  }

  return HAL_OK;
}

/**
  * @brief  Check whether or not the specified HSP TRGIN Error interrupt is set.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  interrupts  Mask of TRGIN Error Interrupts
  *         This parameter can be one the following values:
  *             @arg HAL_HSP_IT_ERR_TRGIN_OVR
  * @retval The state of HSP interrupt (0 or 1)
  */
uint32_t HAL_HSP_TRGIN_IsEnabledIT(const HSP_HandleTypeDef *hhsp, uint32_t interrupts)
{
  ASSERT_DBG_PARAM((hhsp != NULL));
  ASSERT_DBG_PARAM(IS_HSP_TRGIN_IT_ERR(interrupts));

  return (((STM32_READ_BIT(((HSP_TypeDef *)(uint32_t)(hhsp->Instance))->ERR_IER, interrupts) != 0U)) ? 1U : 0U);
}

