zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
/** @brief  Retrieve the TRGIN Overrun status.
  * @param  hhsp specifies the HSP Handle.
  * @note  Use the HAL_HSP_TRGIN_<x> defines to check the overrun status of each TRGIN.
  * @retval Overrun status of all TRGIN
  */
uint32_t HAL_HSP_TRGIN_GetOverrun(const HSP_HandleTypeDef *hhsp)
{
  const HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM((hhsp != NULL));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  return STM32_READ_BIT(p_hspx->ERRINFR, HSP_ERRINFR_TRGIERR_Msk);
}

/**
  * @}
  */

/** @addtogroup HSP_Exported_Functions_Group3_4 HSP Event Common management
  * @{
  */
/* Event Management ----------------------------------------------------------*/
/**
  * @brief  Configure an Event in the Processing Request Controller.
  * @param  hhsp       Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_config   Pointer to a @ref HAL_HSP_EVENT_ConfigTypeDef.
  * @retval HAL_OK     Operation completed successfully.
  * @retval HAL_ERROR  Pointer of configuration is NULL.
  */
HAL_StatusTypeDef HAL_HSP_EVENT_SetConfig(HSP_HandleTypeDef *hhsp,
                                          const HAL_HSP_EVENT_ConfigTypeDef *p_config)
{
  HSP_TypeDef *p_hspx;
  uint32_t event_id;
  uint32_t reg_idx;
  uint32_t bitfield_idx;
  uint32_t reg_pos;
  uint32_t reg_mask;
  uint32_t reg_value;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

  if (p_config == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  ASSERT_DBG_PARAM(IS_HSP_EVENT_SOURCE(p_config->source));
  ASSERT_DBG_PARAM(IS_HSP_TCU(p_config->sync.tcu));
  ASSERT_DBG_PARAM(IS_HSP_EVENT_SYNC_STATE(p_config->sync.state));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  event_id = ((uint32_t)p_config->source >> HAL_HSP_EVENT_PRIO_POS);
  reg_idx = ((event_id - 1UL) / HSP_REG_EVTSRC_CFG_NBR);
  bitfield_idx = ((event_id - 1UL) % HSP_REG_EVTSRC_CFG_NBR);

  reg_pos = HSP_EVTSRC0R_EVT1SRC_Pos + (bitfield_idx * HSP_REG_EVTSRC_FIELD_SIZE);
  reg_mask = (HSP_EVTSRC0R_EVT1SRC_Msk << reg_pos);
  reg_value = ((((uint32_t)p_config->source) & HAL_HSP_EVENT_SOURCE_MSK) >> HAL_HSP_EVENT_SOURCE_POS) << reg_pos;

  /* Update Event source register */
  switch (reg_idx)
  {
    case 0:
      STM32_MODIFY_REG(p_hspx->EVTSRC0R, reg_mask, reg_value);
      break;
    case 1:
      STM32_MODIFY_REG(p_hspx->EVTSRC1R, reg_mask, reg_value);
      break;
    case 2:
      STM32_MODIFY_REG(p_hspx->EVTSRC2R, reg_mask, reg_value);
      break;
    default:
      return HAL_ERROR;
      break;
  }

  /* Update Event synchronisation register */
  reg_mask = (HSP_ESYNC0SRCR_EV1SSRC_Msk << reg_pos);
  reg_value = ((((uint32_t)p_config->sync.tcu) & HAL_HSP_EVENT_SOURCE_MSK) >> HAL_HSP_EVENT_SOURCE_POS) << reg_pos;
  switch (reg_idx)
  {
    case 0:
      STM32_MODIFY_REG(p_hspx->ESYNC0SRCR, reg_mask, reg_value);
      break;
    case 1:
      STM32_MODIFY_REG(p_hspx->ESYNC1SRCR, reg_mask, reg_value);
      break;
    case 2:
      STM32_MODIFY_REG(p_hspx->ESYNC2SRCR, reg_mask, reg_value);
      break;
    default:
      return HAL_ERROR;
      break;
  }

  if (p_config->sync.state == HAL_HSP_EVENT_SYNC_ENABLE)
  {
    STM32_SET_BIT(p_hspx->ESYNCENR, (1UL << event_id));
  }
  else
  {
    STM32_CLEAR_BIT(p_hspx->ESYNCENR, (1UL << event_id));
  }

  return HAL_OK;
}

/**
  * @brief  Get the configuration of an Event in the Processing Request Controller.
  * @param  hhsp      Pointer to a @ref HSP_HandleTypeDef.
  * @param  event_id  Event ID
  *         This parameter can be one of the following values:
  *             @arg HAL_HSP_EVENT_1:   PRC Event number 1
  *             @arg HAL_HSP_EVENT_2:   PRC Event number 2
  *             @arg HAL_HSP_EVENT_3:   PRC Event number 3
  *             @arg HAL_HSP_EVENT_4:   PRC Event number 4
  *             @arg HAL_HSP_EVENT_5:   PRC Event number 5
  *             @arg HAL_HSP_EVENT_6:   PRC Event number 6
  *             @arg HAL_HSP_EVENT_7:   PRC Event number 7
  *             @arg HAL_HSP_EVENT_8:   PRC Event number 8
  *             @arg HAL_HSP_EVENT_9:   PRC Event number 9
  *             @arg HAL_HSP_EVENT_10:  PRC Event number 10
  *             @arg HAL_HSP_EVENT_11:  PRC Event number 11
  *             @arg HAL_HSP_EVENT_12:  PRC Event number 12
  *             @arg HAL_HSP_EVENT_13:  PRC Event number 13
  *             @arg HAL_HSP_EVENT_14:  PRC Event number 14
  *             @arg HAL_HSP_EVENT_15:  PRC Event number 15
  *             @arg HAL_HSP_EVENT_16:  PRC Event number 16
  *             @arg HAL_HSP_EVENT_17:  PRC Event number 17
  *             @arg HAL_HSP_EVENT_18:  PRC Event number 18
  *             @arg HAL_HSP_EVENT_19:  PRC Event number 19
  *             @arg HAL_HSP_EVENT_20:  PRC Event number 20
  *             @arg HAL_HSP_EVENT_21:  PRC Event number 21
  *             @arg HAL_HSP_EVENT_22:  PRC Event number 22
  * @param  p_config  Pointer to a @ref HAL_HSP_EVENT_ConfigTypeDef.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Config pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_EVENT_GetConfig(HSP_HandleTypeDef *hhsp, uint32_t event_id,
                                          HAL_HSP_EVENT_ConfigTypeDef *p_config)
{
  const HSP_TypeDef *p_hspx;
  uint32_t priority;
  uint32_t reg_idx;
  uint32_t bitfield_idx;
  uint32_t reg_pos;
  uint32_t reg_mask;
  uint32_t reg_src_value;
  uint32_t reg_tcu_value;

  ASSERT_DBG_PARAM(hhsp != NULL);

  ASSERT_DBG_PARAM(IS_HSP_EVENT(event_id));

  if (p_config == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  HSP_ASSERT_DBG_STATE(hhsp->global_state, ((uint32_t)HAL_HSP_STATE_RUNNING | (uint32_t)HAL_HSP_STATE_FAULT));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  uint32_t evt_id = (STM32_POSITION_VAL(event_id) - 1UL);
  reg_idx = (evt_id / HSP_REG_EVTSRC_CFG_NBR);
  bitfield_idx = (evt_id % HSP_REG_EVTSRC_CFG_NBR);
  reg_pos = HSP_EVTSRC0R_EVT1SRC_Pos + (bitfield_idx * HSP_REG_EVTSRC_FIELD_SIZE);
  reg_mask = (HSP_EVTSRC0R_EVT1SRC_Msk << reg_pos);

  switch (reg_idx)
  {
    case 0:
      reg_src_value = STM32_READ_BIT(p_hspx->EVTSRC0R, reg_mask);
      reg_tcu_value = STM32_READ_BIT(p_hspx->ESYNC0SRCR, reg_mask);
      break;
    case 1:
      reg_src_value = STM32_READ_BIT(p_hspx->EVTSRC1R, reg_mask);
      reg_tcu_value = STM32_READ_BIT(p_hspx->ESYNC1SRCR, reg_mask);
      break;
    case 2:
      reg_src_value = STM32_READ_BIT(p_hspx->EVTSRC2R, reg_mask);
      reg_tcu_value = STM32_READ_BIT(p_hspx->ESYNC2SRCR, reg_mask);
      break;
    default:
      return HAL_ERROR;
      break;
  }

  priority = (STM32_POSITION_VAL(event_id) << HAL_HSP_EVENT_PRIO_POS);

  p_config->source = (HAL_HSP_EVENT_SourceTypeDef)(uint32_t)(priority | (reg_src_value >> reg_pos));
  p_config->sync.tcu = (HAL_HSP_TASK_ComparatorTypeDef)reg_tcu_value;

