zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  if (STM32_READ_BIT(p_hspx->ESYNCENR, event_id) != 0U)
  {
    p_config->sync.state = HAL_HSP_EVENT_SYNC_ENABLE;
  }
  else
  {
    p_config->sync.state = HAL_HSP_EVENT_SYNC_DISABLE;
  }

  return HAL_OK;
}

/**
  * @brief  Enable Events in the Processing Request Controller.
  * @param  hhsp   Pointer to a @ref HSP_HandleTypeDef.
  * @param  events Mask of Event to enable
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_EVENT_1:   PRC Event number 1
  *             @arg HAL_HSP_EVENT_2:   PRC Event number 2
  *             @arg HAL_HSP_EVENT_3:   PRC Event number 3
  *             @arg HAL_HSP_EVENT_4:   PRC Event number 4
  *             @arg HAL_HSP_EVENT_5:   PRC Event number 5
  *             @arg HAL_HSP_EVENT_6:   PRC Event number 6
  *             @arg HAL_HSP_EVENT_7:   PRC Event number 7
  *             @arg HAL_HSP_EVENT_8:   PRC Event number 8
  *             @arg HAL_HSP_EVENT_9:   PRC Event number 9
  *             @arg HAL_HSP_EVENT_10:  PRC Event number 10
  *             @arg HAL_HSP_EVENT_11:  PRC Event number 11
  *             @arg HAL_HSP_EVENT_12:  PRC Event number 12
  *             @arg HAL_HSP_EVENT_13:  PRC Event number 13
  *             @arg HAL_HSP_EVENT_14:  PRC Event number 14
  *             @arg HAL_HSP_EVENT_15:  PRC Event number 15
  *             @arg HAL_HSP_EVENT_16:  PRC Event number 16
  *             @arg HAL_HSP_EVENT_17:  PRC Event number 17
  *             @arg HAL_HSP_EVENT_18:  PRC Event number 18
  *             @arg HAL_HSP_EVENT_19:  PRC Event number 19
  *             @arg HAL_HSP_EVENT_20:  PRC Event number 20
  *             @arg HAL_HSP_EVENT_21:  PRC Event number 21
  *             @arg HAL_HSP_EVENT_22:  PRC Event number 22
  *             @arg HAL_HSP_EVENT_ALL: ALL PRC Event
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_EVENT_Enable(HSP_HandleTypeDef *hhsp, uint32_t events)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_EVENTS_MASK(events));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_SET_BIT(p_hspx->EVTENR, events);

  return HAL_OK;
}

/**
  * @brief  Disable Events in the Processing Request Controller.
  * @param  hhsp   Pointer to a @ref HSP_HandleTypeDef.
  * @param  events Mask of Event to disable
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_EVENT_1:   PRC Event number 1
  *             @arg HAL_HSP_EVENT_2:   PRC Event number 2
  *             @arg HAL_HSP_EVENT_3:   PRC Event number 3
  *             @arg HAL_HSP_EVENT_4:   PRC Event number 4
  *             @arg HAL_HSP_EVENT_5:   PRC Event number 5
  *             @arg HAL_HSP_EVENT_6:   PRC Event number 6
  *             @arg HAL_HSP_EVENT_7:   PRC Event number 7
  *             @arg HAL_HSP_EVENT_8:   PRC Event number 8
  *             @arg HAL_HSP_EVENT_9:   PRC Event number 9
  *             @arg HAL_HSP_EVENT_10:  PRC Event number 10
  *             @arg HAL_HSP_EVENT_11:  PRC Event number 11
  *             @arg HAL_HSP_EVENT_12:  PRC Event number 12
  *             @arg HAL_HSP_EVENT_13:  PRC Event number 13
  *             @arg HAL_HSP_EVENT_14:  PRC Event number 14
  *             @arg HAL_HSP_EVENT_15:  PRC Event number 15
  *             @arg HAL_HSP_EVENT_16:  PRC Event number 16
  *             @arg HAL_HSP_EVENT_17:  PRC Event number 17
  *             @arg HAL_HSP_EVENT_18:  PRC Event number 18
  *             @arg HAL_HSP_EVENT_19:  PRC Event number 19
  *             @arg HAL_HSP_EVENT_20:  PRC Event number 20
  *             @arg HAL_HSP_EVENT_21:  PRC Event number 21
  *             @arg HAL_HSP_EVENT_22:  PRC Event number 22
  *             @arg HAL_HSP_EVENT_ALL: ALL PRC Event
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_EVENT_Disable(HSP_HandleTypeDef *hhsp, uint32_t events)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_EVENTS_MASK(events));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_CLEAR_BIT(p_hspx->EVTENR, events);

  return HAL_OK;
}

/**
  * @brief  Return the Status of each Event interface
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @note   The returned value can be a combination of following values:
  *             @arg HAL_HSP_EVENT_1:   PRC Event number 1
  *             @arg HAL_HSP_EVENT_2:   PRC Event number 2
  *             @arg HAL_HSP_EVENT_3:   PRC Event number 3
  *             @arg HAL_HSP_EVENT_4:   PRC Event number 4
  *             @arg HAL_HSP_EVENT_5:   PRC Event number 5
  *             @arg HAL_HSP_EVENT_6:   PRC Event number 6
  *             @arg HAL_HSP_EVENT_7:   PRC Event number 7
  *             @arg HAL_HSP_EVENT_8:   PRC Event number 8
  *             @arg HAL_HSP_EVENT_9:   PRC Event number 9
  *             @arg HAL_HSP_EVENT_10:  PRC Event number 10
  *             @arg HAL_HSP_EVENT_11:  PRC Event number 11
  *             @arg HAL_HSP_EVENT_12:  PRC Event number 12
  *             @arg HAL_HSP_EVENT_13:  PRC Event number 13
  *             @arg HAL_HSP_EVENT_14:  PRC Event number 14
  *             @arg HAL_HSP_EVENT_15:  PRC Event number 15
  *             @arg HAL_HSP_EVENT_16:  PRC Event number 16
  *             @arg HAL_HSP_EVENT_17:  PRC Event number 17
  *             @arg HAL_HSP_EVENT_18:  PRC Event number 18
  *             @arg HAL_HSP_EVENT_19:  PRC Event number 19
  *             @arg HAL_HSP_EVENT_20:  PRC Event number 20
  *             @arg HAL_HSP_EVENT_21:  PRC Event number 21
  *             @arg HAL_HSP_EVENT_22:  PRC Event number 22
  * @retval  status
  */
uint32_t HAL_HSP_EVENT_GetStatus(const HSP_HandleTypeDef *hhsp)
{
  const HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM((hhsp != NULL));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  return STM32_READ_BIT(p_hspx->EVTENR, HSP_EVTENR_EVTEN_Msk);
}

/**
  * @brief  Request the trig of an event to the Processing Request Controller.
  * @param  hhsp   Pointer to a @ref HSP_HandleTypeDef.
  * @param  events Mask of Events to trig
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_EVENT_1:   PRC Event number 1
  *             @arg HAL_HSP_EVENT_2:   PRC Event number 2
  *             @arg HAL_HSP_EVENT_3:   PRC Event number 3
  *             @arg HAL_HSP_EVENT_4:   PRC Event number 4
  *             @arg HAL_HSP_EVENT_5:   PRC Event number 5
  *             @arg HAL_HSP_EVENT_6:   PRC Event number 6
  *             @arg HAL_HSP_EVENT_7:   PRC Event number 7
  *             @arg HAL_HSP_EVENT_8:   PRC Event number 8
  *             @arg HAL_HSP_EVENT_9:   PRC Event number 9
  *             @arg HAL_HSP_EVENT_10:  PRC Event number 10
  *             @arg HAL_HSP_EVENT_11:  PRC Event number 11
  *             @arg HAL_HSP_EVENT_12:  PRC Event number 12
  *             @arg HAL_HSP_EVENT_13:  PRC Event number 13
  *             @arg HAL_HSP_EVENT_14:  PRC Event number 14
  *             @arg HAL_HSP_EVENT_15:  PRC Event number 15
  *             @arg HAL_HSP_EVENT_16:  PRC Event number 16
  *             @arg HAL_HSP_EVENT_17:  PRC Event number 17
  *             @arg HAL_HSP_EVENT_18:  PRC Event number 18
  *             @arg HAL_HSP_EVENT_19:  PRC Event number 19
  *             @arg HAL_HSP_EVENT_20:  PRC Event number 20
  *             @arg HAL_HSP_EVENT_21:  PRC Event number 21
  *             @arg HAL_HSP_EVENT_22:  PRC Event number 22
  * @note  The selected events must be configured with CSEG interface as source
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_EVENT_RequestSWTrigger(HSP_HandleTypeDef *hhsp, uint32_t events)
{
  HSP_TypeDef *p_hspx;

