zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_EVENTS_MASK(events));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Use CSEG and the PRC must be configured as well */
  STM32_SET_BIT(p_hspx->CSEGR, events);

  return HAL_OK;
}

/**
  * @brief  Wait the end of processing of events triggered by the CPU.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  poll_mode   Polling mode.
  * @param  events Mask of Event to poll
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_EVENT_1:   PRC Event number 1
  *             @arg HAL_HSP_EVENT_2:   PRC Event number 2
  *             @arg HAL_HSP_EVENT_3:   PRC Event number 3
  *             @arg HAL_HSP_EVENT_4:   PRC Event number 4
  *             @arg HAL_HSP_EVENT_5:   PRC Event number 5
  *             @arg HAL_HSP_EVENT_6:   PRC Event number 6
  *             @arg HAL_HSP_EVENT_7:   PRC Event number 7
  *             @arg HAL_HSP_EVENT_8:   PRC Event number 8
  *             @arg HAL_HSP_EVENT_9:   PRC Event number 9
  *             @arg HAL_HSP_EVENT_10:  PRC Event number 10
  *             @arg HAL_HSP_EVENT_11:  PRC Event number 11
  *             @arg HAL_HSP_EVENT_12:  PRC Event number 12
  *             @arg HAL_HSP_EVENT_13:  PRC Event number 13
  *             @arg HAL_HSP_EVENT_14:  PRC Event number 14
  *             @arg HAL_HSP_EVENT_15:  PRC Event number 15
  *             @arg HAL_HSP_EVENT_16:  PRC Event number 16
  *             @arg HAL_HSP_EVENT_17:  PRC Event number 17
  *             @arg HAL_HSP_EVENT_18:  PRC Event number 18
  *             @arg HAL_HSP_EVENT_19:  PRC Event number 19
  *             @arg HAL_HSP_EVENT_20:  PRC Event number 20
  *             @arg HAL_HSP_EVENT_21:  PRC Event number 21
  *             @arg HAL_HSP_EVENT_22:  PRC Event number 22
  * @param  timeout_ms Timeout duration (in ms).
  * @param  p_events_status  Pointer to return the ended event.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_TIMEOUT  Timeout occurred.
  * @retval HAL_ERROR  Invalid parameter.
  */
HAL_StatusTypeDef HAL_HSP_EVENT_PollForPending(HSP_HandleTypeDef *hhsp, HAL_HSP_POLLING_ModeTypeDef poll_mode,
                                               uint32_t events, uint32_t timeout_ms,
                                               uint32_t *p_events_status)
{
  const HSP_TypeDef *p_hspx;
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hhsp != NULL);

  if (p_events_status == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  ASSERT_DBG_PARAM(IS_HSP_POLLING_MODE(poll_mode));
  ASSERT_DBG_PARAM(IS_HSP_EVENTS_MASK(events));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Get tick count */
  tickstart = HAL_GetTick();

  /* Check selected event flag */
  *p_events_status = 0U;
  do
  {
    /* Check if timeout is disabled (set to infinite wait) */
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0UL))
      {
        return HAL_TIMEOUT;
      }
    }

    uint32_t current_status = ~(STM32_READ_BIT(p_hspx->PEVTLR, events));
    if (poll_mode == HAL_HSP_POLLING_FOR_ANY_EVENT)
    {
      *p_events_status = current_status;
    }
    else
    {
      *p_events_status = ((STM32_IS_BIT_SET(current_status, events) == 1U) ? current_status : 0U);
    }
  } while (*p_events_status == 0U);

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup HSP_Exported_Functions_Group4
  * @{
  */
/**
  * @brief  Enable the Smart Clocking of some HSP blocks.
  * @param  hhsp         Pointer to a @ref HSP_HandleTypeDef.
  * @param  clocks_mask  Mask of clocks to enable.
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_SMARTCLOCKING_CTRL
  *             @arg HAL_HSP_SMARTCLOCKING_SPE
  *             @arg HAL_HSP_SMARTCLOCKING_MMC
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_SMARTCLOCKING_Enable(HSP_HandleTypeDef *hhsp, uint32_t clocks_mask)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_SMARTCLOCKING(clocks_mask));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_CLEAR_BIT(p_hspx->CR, clocks_mask);

  return HAL_OK;
}

/**
  * @brief  Disable the Smart Clocking of some HSP blocks.
  * @param  hhsp         Pointer to a @ref HSP_HandleTypeDef.
  * @param  clocks_mask  Mask of clocks to disable.
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_SMARTCLOCKING_CTRL
  *             @arg HAL_HSP_SMARTCLOCKING_SPE
  *             @arg HAL_HSP_SMARTCLOCKING_MMC
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_SMARTCLOCKING_Disable(HSP_HandleTypeDef *hhsp, uint32_t clocks_mask)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_SMARTCLOCKING(clocks_mask));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_SET_BIT(p_hspx->CR, clocks_mask);

  return HAL_OK;
}

/**
  * @brief  Check whether or not the specified SmartClocking block is set.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  clock  Clock.
  *         This parameter can be one of the following values:
  *             @arg HAL_HSP_SMARTCLOCKING_CTRL
  *             @arg HAL_HSP_SMARTCLOCKING_SPE
  *             @arg HAL_HSP_SMARTCLOCKING_MMC
  * @retval The state of SmartClocking (0 or 1)
  */
uint32_t HAL_HSP_SMARTCLOCKING_IsEnabled(const HSP_HandleTypeDef *hhsp, uint32_t clock)
{
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_SMARTCLOCKING(clock));

  /* Note: if the bitfield is set to 0, it means the SmartClocking is enabled ! */
  return (((STM32_READ_BIT(((HSP_TypeDef *)(uint32_t)(hhsp->Instance))->CR, clock) != 0U) ? 1U : 0U));
}

/**
  * @}
  */

/** @addtogroup HSP_Exported_Functions_Group5
  * @{
  */
/**
  * @brief  Start the Task Comparator Unit.
  * @param  hhsp     Pointer to a @ref HSP_HandleTypeDef.
  * @param  tcu_id   Task Comparator Unit ID.
  * @param  task_id  Task ID to monitor.
  * @param  interrupts  Mask of Task Comparator Unit Interrupts.
  *         This parameter can be one of following values:
  *            @arg @ref  HAL_HSP_IT_NONE
  *            @arg @ref  HAL_HSP_IT_EVT_TCU0_TASK_STARTED
  *            @arg @ref  HAL_HSP_IT_EVT_TCU1_TASK_STARTED
  *            @arg @ref  HAL_HSP_IT_EVT_TCU2_TASK_STARTED
  *            @arg @ref  HAL_HSP_IT_EVT_TCU3_TASK_STARTED
  *            @arg @ref  HAL_HSP_IT_EVT_TCU0_TASK_ENDED
  *            @arg @ref  HAL_HSP_IT_EVT_TCU1_TASK_ENDED
  *            @arg @ref  HAL_HSP_IT_EVT_TCU2_TASK_ENDED
  *            @arg @ref  HAL_HSP_IT_EVT_TCU3_TASK_ENDED
  *            @arg @ref  HAL_HSP_IT_EVT_TCU0_ALL
  *            @arg @ref  HAL_HSP_IT_EVT_TCU1_ALL
  *            @arg @ref  HAL_HSP_IT_EVT_TCU2_ALL
  *            @arg @ref  HAL_HSP_IT_EVT_TCU3_ALL
  * @retval HAL_OK  Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_TCU_StartComparator(HSP_HandleTypeDef *hhsp,
                                              HAL_HSP_TASK_ComparatorTypeDef tcu_id, HAL_HSP_TaskTypeDef task_id,
                                              uint32_t interrupts)
{
  HSP_TypeDef *p_hspx;
  uint32_t reg_pos;
  uint32_t its_mask;

