zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_TCU(tcu_id));
  ASSERT_DBG_PARAM(IS_HSP_TASK(task_id));
  ASSERT_DBG_PARAM(IS_HSP_TCU_IT(tcu_id, interrupts));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  reg_pos = ((uint32_t)tcu_id) * HSP_REG_TCUCFGR_BITFIELD_SIZE;
  STM32_SET_BIT(p_hspx->TCUCFGR, (HSP_TCUCFGR_TC0EN_Msk << reg_pos));
  STM32_MODIFY_REG(p_hspx->TCUCFGR, (HSP_TCUCFGR_TSKCMP0_Msk << reg_pos), ((uint32_t)task_id) << reg_pos);

  if (interrupts != HAL_HSP_IT_NONE)
  {
    hhsp->tcu_handler = HSP_TCU_Handler;

    its_mask = ((HAL_HSP_IT_EVT_TCU0_TASK_STARTED | HAL_HSP_IT_EVT_TCU0_TASK_ENDED) << (uint32_t)tcu_id);
    STM32_MODIFY_REG(p_hspx->EVT_IER, its_mask, interrupts);
  }

  return HAL_OK;
}

/**
  * @brief  Stop the Task Comparator Unit.
  * @param  hhsp     Pointer to a @ref HSP_HandleTypeDef.
  * @param  tcu_id   Task Comparator Unit ID.
  * @retval HAL_OK  Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_TCU_StopComparator(HSP_HandleTypeDef *hhsp, HAL_HSP_TASK_ComparatorTypeDef tcu_id)
{
  HSP_TypeDef *p_hspx;
  uint32_t reg_pos;
  uint32_t its_mask;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_TCU(tcu_id));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  reg_pos = ((uint32_t)tcu_id) * HSP_REG_TCUCFGR_BITFIELD_SIZE;
  STM32_CLEAR_BIT(p_hspx->TCUCFGR, (HSP_TCUCFGR_TC0EN_Msk << reg_pos));

  its_mask = ((HAL_HSP_IT_EVT_TCU0_TASK_STARTED | HAL_HSP_IT_EVT_TCU0_TASK_ENDED) << (uint32_t)tcu_id);
  STM32_CLEAR_BIT(p_hspx->EVT_IER, its_mask);

  if (STM32_IS_BIT_SET(p_hspx->EVT_IER, HAL_HSP_IT_EVT_TCU_ALL) == 0U)
  {
    hhsp->tcu_handler = NULL;
  }

  return HAL_OK;
}

/**
  * @brief  Start the Task Overlap feature in polling mode.
  * @param  hhsp            Pointer to a @ref HSP_HandleTypeDef.
  * @param  lower_task_id   Lower Task ID.
  * @param  higher_task_id  Higher Task ID.
  * @param  interrupts      Mask of Task Comparator Overlap Interrupts.
  *         This parameter can be one of following values:
  *            @arg @ref  HAL_HSP_IT_NONE
  *            @arg @ref  HAL_HSP_IT_EVT_TCU_TASK_OVL
  * @retval HAL_OK  Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_TCU_StartOverlapDetector(HSP_HandleTypeDef *hhsp,
                                                   HAL_HSP_TaskTypeDef lower_task_id,
                                                   HAL_HSP_TaskTypeDef higher_task_id,
                                                   uint32_t interrupts)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_TASK(lower_task_id));
  ASSERT_DBG_PARAM(IS_HSP_TASK(higher_task_id));
  ASSERT_DBG_PARAM(IS_HSP_TASK_OVERLAP_IT(interrupts));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_SET_BIT(p_hspx->TOVLPCR, HSP_TOVLPCR_TOVLPEN);
  STM32_MODIFY_REG(p_hspx->TOVLPCR, HSP_TOVLPCR_LTNB_Msk, ((uint32_t)lower_task_id) << HSP_TOVLPCR_LTNB_Pos);
  STM32_MODIFY_REG(p_hspx->TOVLPCR, HSP_TOVLPCR_HTNB_Msk, ((uint32_t)higher_task_id) << HSP_TOVLPCR_HTNB_Pos);

  if (interrupts != HAL_HSP_IT_NONE)
  {
    hhsp->tcu_handler = HSP_TCU_Handler;

    STM32_MODIFY_REG(p_hspx->EVT_IER, HSP_EVT_IER_TOVLPIE_Msk, interrupts);
  }

  return HAL_OK;
}

/**
  * @brief  Stop the Task Overlap feature in polling mode.
  * @param  hhsp    Pointer to a @ref HSP_HandleTypeDef.
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_TCU_StopOverlapDetector(HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM((hhsp != NULL));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_CLEAR_BIT(p_hspx->TOVLPCR, HSP_TOVLPCR_TOVLPEN);
  STM32_CLEAR_BIT(p_hspx->EVT_IER, HSP_EVT_IER_TOVLPIE);

  if (STM32_IS_BIT_SET(p_hspx->EVT_IER, HAL_HSP_IT_EVT_TCU_ALL) == 0U)
  {
    hhsp->tcu_handler = NULL;
  }

  return HAL_OK;
}

/**
  * @brief  Poll until specified flags are raised.
  * @param  hhsp       Pointer to a @ref HSP_HandleTypeDef.
  * @param  poll_mode  Polling mode.
  * @param  flags      Mask of event flags to poll
  *         This parameter can be a combination of following values:
  *            @arg @ref  HAL_HSP_FLAG_EVT_TCU_OVERLAP
  *            @arg @ref  HAL_HSP_FLAG_EVT_TCU_COMP0_START_OF_TASK
  *            @arg @ref  HAL_HSP_FLAG_EVT_TCU_COMP1_START_OF_TASK
  *            @arg @ref  HAL_HSP_FLAG_EVT_TCU_COMP2_START_OF_TASK
  *            @arg @ref  HAL_HSP_FLAG_EVT_TCU_COMP3_START_OF_TASK
  *            @arg @ref  HAL_HSP_FLAG_EVT_TCU_COMP0_END_OF_TASK
  *            @arg @ref  HAL_HSP_FLAG_EVT_TCU_COMP1_END_OF_TASK
  *            @arg @ref  HAL_HSP_FLAG_EVT_TCU_COMP2_END_OF_TASK
  *            @arg @ref  HAL_HSP_FLAG_EVT_TCU_COMP3_END_OF_TASK
  * @param  timeout_ms Timeout duration (in ms).
  * @param  p_flags_status Pointer to return the raised flags.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Event pointer is NULL.
  * @retval HAL_TIMEOUT  Timeout occurred.
  */
HAL_StatusTypeDef HAL_HSP_TCU_PollForEvent(HSP_HandleTypeDef *hhsp,
                                           HAL_HSP_POLLING_ModeTypeDef poll_mode,
                                           uint32_t flags, uint32_t timeout_ms,
                                           uint32_t *p_flags_status)
{
  HSP_TypeDef *p_hspx;
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_flags_status != NULL);

  if (p_flags_status == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  ASSERT_DBG_PARAM(IS_HSP_POLLING_MODE(poll_mode));
  ASSERT_DBG_PARAM(IS_HSP_TCU_FLAGS(flags));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Get tick count */
  tickstart = HAL_GetTick();

  /* Check selected event flag */
  *p_flags_status = 0U;
  do
  {
    /* Check if timeout is disabled (set to infinite wait) */
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0UL))
      {
        return HAL_TIMEOUT;
      }
    }

    uint32_t current_status = STM32_READ_BIT(p_hspx->EVT_ISR, flags);
    if (poll_mode == HAL_HSP_POLLING_FOR_ANY_EVENT)
    {
      *p_flags_status = current_status;
    }
    else
    {
      *p_flags_status = ((STM32_IS_BIT_SET(current_status, flags) == 1U) ? current_status : 0U);
    }
  } while (*p_flags_status == 0U);

  /* Clear selected flags */
  STM32_WRITE_REG(p_hspx->EVT_ICR, *p_flags_status);

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup HSP_Exported_Functions_Group6
  * @{
  */
/**
  * @brief  Configure a Trigger Output.
  * @param  hhsp    Pointer to a @ref HSP_HandleTypeDef.
  * @param  id      Trigger Output id.
  * @param  source  Trigger source.
  * @retval HAL_OK  Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_OUTPUT_SetConfigTrigger(HSP_HandleTypeDef *hhsp,
                                                  HAL_HSP_OUTPUT_TriggerTypeDef id,
                                                  HAL_HSP_OUTPUT_TRIGGER_SourceTypeDef source)
{
  HSP_TypeDef *p_hspx;
  uint32_t bitfield_mask;
  uint32_t bitfield_pos;

