zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_OUTPUT_TRIGGER(id));
  ASSERT_DBG_PARAM(IS_HSP_OUTPUT_TRIGGER_SOURCE(source));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  bitfield_pos = HSP_TRGOCFGR_TRGO0SRC_Pos + (((uint32_t)id) * HSP_REG_TRGOCFGR_BITFIELD_SRC_SIZE);
  bitfield_mask = HSP_TRGOCFGR_TRGO0SRC << bitfield_pos;
  STM32_MODIFY_REG(p_hspx->TRGOCFGR, bitfield_mask, (uint32_t)source << bitfield_pos);

  return HAL_OK;
}

/**
  * @brief  Get the configuration of a Trigger Output.
  * @param  hhsp    Pointer to a @ref HSP_HandleTypeDef.
  * @param  id      Trigger Output id.
  * @retval Trigger Output source.
  */
HAL_HSP_OUTPUT_TRIGGER_SourceTypeDef HAL_HSP_OUTPUT_GetConfigTrigger(const HSP_HandleTypeDef *hhsp,
                                                                     HAL_HSP_OUTPUT_TriggerTypeDef id)
{
  const HSP_TypeDef *p_hspx;

  uint32_t bitfield_mask;
  uint32_t bitfield_pos;
  uint32_t source;

  ASSERT_DBG_PARAM((hhsp != NULL));
  ASSERT_DBG_PARAM(IS_HSP_OUTPUT_TRIGGER(id));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  bitfield_pos = HSP_TRGOCFGR_TRGO0SRC_Pos + (((uint32_t)id) * HSP_REG_TRGOCFGR_BITFIELD_SRC_SIZE);
  bitfield_mask = HSP_TRGOCFGR_TRGO0SRC << bitfield_pos;
  source = STM32_READ_BIT(p_hspx->TRGOCFGR, bitfield_mask) >> bitfield_pos;

  return ((HAL_HSP_OUTPUT_TRIGGER_SourceTypeDef)source);
}

/**
  * @brief  Enable the HSP Output.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_OUTPUT_Enable(HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_SET_BIT(p_hspx->ITFENR, HSP_ITFENR_TRGOEN);

  return HAL_OK;
}

/**
  * @brief  Disable the HSP Output.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_OUTPUT_Disable(HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_CLEAR_BIT(p_hspx->ITFENR, HSP_ITFENR_TRGOEN);

  return HAL_OK;
}

/**
  * @brief  Check whether or not the Trigger Output is enabled.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval HAL_HSP_OUTPUT_ENABLED   Output is enabled.
  * @retval HAL_HSP_OUTPUT_DISABLED  Output is disabled.
  */
HAL_HSP_OUTPUT_StatusTypeDef HAL_HSP_OUTPUT_IsEnabled(const HSP_HandleTypeDef *hhsp)
{
  uint32_t status;

  ASSERT_DBG_PARAM((hhsp != NULL));

  status = STM32_READ_BIT(((HSP_TypeDef *)(uint32_t)(hhsp->Instance))->ITFENR, HSP_ITFENR_TRGOEN);
  return ((status == 0U) ? HAL_HSP_OUTPUT_DISABLED : HAL_HSP_OUTPUT_ENABLED);
}

/**
  * @}
  */

/** @addtogroup HSP_Exported_Functions_Group7
  * @{
  */
/**
  * @brief  Configure the TimeStamp Capture
  * @param  hhsp      Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_config  Pointer to a @ref HAL_HSP_TSC_ConfigTypeDef.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Config pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_TSC_SetConfig(HSP_HandleTypeDef *hhsp, const HAL_HSP_TSC_ConfigTypeDef *p_config)
{
  HSP_TypeDef *p_hspx;
  uint32_t reg_value;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

  if (p_config == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  ASSERT_DBG_PARAM(IS_HSP_TSC_PRESCALER(p_config->prescaler));
  ASSERT_DBG_PARAM(IS_HSP_TSC_FREE_COUNTER(p_config->counter));
  ASSERT_DBG_PARAM(IS_HSP_TSC_FILTER(p_config->filter));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  reg_value = ((uint32_t)(p_config->prescaler) | (uint32_t)(p_config->counter) | (uint32_t)(p_config->filter));
  STM32_MODIFY_REG(p_hspx->CAPCR, HSP_TSC_CONFIG_CAPCR_MASK, reg_value);

  return HAL_OK;
}

/**
  * @brief  Get the configuration of the TimeStamp Capture
  * @param  hhsp      Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_config  Pointer to a @ref HAL_HSP_TSC_ConfigTypeDef.
  * @retval HAL_OK  Operation completed successfully.
  * @retval HAL_ERROR  Config pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_TSC_GetConfig(HSP_HandleTypeDef *hhsp, HAL_HSP_TSC_ConfigTypeDef *p_config)
{
  const HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, ((uint32_t)HAL_HSP_STATE_RUNNING | (uint32_t)HAL_HSP_STATE_FAULT));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  if (p_config == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  p_config->prescaler = (HAL_HSP_TSC_PrescalerTypeDef)(uint32_t)STM32_READ_BIT(p_hspx->CAPCR, HSP_CAPCR_PRESC_Msk);
  p_config->counter = (HAL_HSP_TSC_FreeRunningCounterStateTypeDef)(uint32_t)STM32_READ_BIT(p_hspx->CAPCR,
                      HSP_CAPCR_FRCNTEN_Msk);
  p_config->filter = (HAL_HSP_TSC_TaskFilterTypeDef)(uint32_t)STM32_READ_BIT(p_hspx->CAPCR, HSP_CAPCR_TSKFLT_Msk);

  return HAL_OK;
}

/**
  * @brief  Enable the TimeStamp Capture.
  * @param  hhsp      Pointer to a @ref HSP_HandleTypeDef.
  * @param  cap_mode  Capture Mode (@ref HAL_HSP_TSC_Capture_ModeTypeDef)
  * @retval HAL_OK     Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_TSC_Enable(HSP_HandleTypeDef *hhsp, HAL_HSP_TSC_Capture_ModeTypeDef cap_mode)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_TSC_CAPTURE_MODE(cap_mode));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_MODIFY_REG(p_hspx->CAPCR, HSP_CAPCR_CAPMOD_Msk, (((uint32_t)cap_mode) << HSP_CAPCR_CAPMOD_Pos));

  return HAL_OK;
}

/**
  * @brief  Disable the TimeStamp Capture.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval HAL_OK     Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_TSC_Disable(HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx;

