zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  ASSERT_DBG_PARAM(hhsp != NULL);

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_CLEAR_BIT(p_hspx->CAPCR, HSP_CAPCR_CAPMOD_Msk);

  return HAL_OK;
}

/**
  * @brief Indicates if the TimeStamp Data Ready Interrupt Flag is set or not.
  * @param hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval State of bit (1 or 0).
  */
uint32_t HAL_HSP_TSC_IsActiveFlag(const HSP_HandleTypeDef *hhsp)
{
  const HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM((hhsp != NULL));

  p_hspx = HSP_GET_INSTANCE(hhsp);
  return ((STM32_READ_BIT(p_hspx->EVT_ISR, HSP_EVT_ISR_CAPRDYF) == (HSP_EVT_ISR_CAPRDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Get the last captured TimeStamp.
  * @param  hhsp         Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_timestamp  Pointer to a @ref HAL_HSP_TSC_TimeStampTypeDef.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Wrong parameter.
  */
HAL_StatusTypeDef HAL_HSP_TSC_GetTimeStamp(HSP_HandleTypeDef *hhsp, HAL_HSP_TSC_TimeStampTypeDef *p_timestamp)
{
  const HSP_TypeDef *p_hspx;
  uint32_t reg_value;

  ASSERT_DBG_PARAM((hhsp != NULL));

  if (p_timestamp == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* The read of CAPDR register clears automatically the HSP_EVT_ISR_CAPRDYF flal */
  reg_value = STM32_READ_REG(p_hspx->CAPDR);

  if (STM32_IS_BIT_SET(p_hspx->CAPCR, HSP_CAPCR_FRCNTEN))
  {
    p_timestamp->task_number = (STM32_READ_BIT(reg_value, HSP_CAPDR_TSKNB_Msk) >> HSP_CAPDR_TSKNB_Pos);
    p_timestamp->if_counter = (STM32_READ_BIT(reg_value, HSP_CAPDR_IFCNT_Msk) >> HSP_CAPDR_IFCNT_Pos);
    p_timestamp->if_history = (STM32_READ_BIT(reg_value, HSP_CAPDR_IFHIST_Msk) >> HSP_CAPDR_IFHIST_Pos);
    p_timestamp->timestamp = (STM32_READ_BIT(p_hspx->CAPDR, HSP_CAPDR_TSTAMP_Msk) >> HSP_CAPDR_TSTAMP_Pos);
    p_timestamp->pfct_number = 0U;
  }
  else
  {
    p_timestamp->task_number = (STM32_READ_BIT(reg_value, HSP_CAPDR_ALT_TSKNB_Msk) >> HSP_CAPDR_ALT_TSKNB_Pos);
    p_timestamp->if_counter = (STM32_READ_BIT(reg_value, HSP_CAPDR_ALT_IFCNT_Msk) >> HSP_CAPDR_ALT_IFCNT_Pos);
    p_timestamp->if_history = (STM32_READ_BIT(reg_value, HSP_CAPDR_ALT_IFHIST_Msk) >> HSP_CAPDR_ALT_IFHIST_Pos);
    p_timestamp->timestamp = 0U;
    p_timestamp->pfct_number = (STM32_READ_BIT(reg_value, HSP_CAPDR_ALT_PFCTNB_Msk) >> HSP_CAPDR_ALT_PFCTNB_Pos);
  }

  return HAL_OK;
}

/**
  * @brief  Enable the TimeStamp Capture in interrupt mode.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @param  cap_mode  Capture mode.
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_TSC_Enable_IT(HSP_HandleTypeDef *hhsp, HAL_HSP_TSC_Capture_ModeTypeDef cap_mode)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_TSC_CAPTURE_MODE(cap_mode));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_MODIFY_REG(p_hspx->CAPCR, HSP_CAPCR_CAPMOD_Msk, (((uint32_t)cap_mode) << HSP_CAPCR_CAPMOD_Pos));

  hhsp->tsc_handler = HSP_TSC_Handler;
  STM32_SET_BIT(p_hspx->EVT_IER, HSP_EVT_IER_CAPRDYIE);

  hhsp->tsc_err_handler = HSP_TSC_Error_Handler;
  STM32_SET_BIT(p_hspx->ERR_IER, HSP_ERR_IER_CAPOVRIE);

  return HAL_OK;
}

/**
  * @brief  Disable the TimeStamp Capture in interrupt mode.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval HAL_OK  Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_TSC_Disable_IT(HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_CLEAR_BIT(p_hspx->CAPCR, HSP_CAPCR_CAPMOD_Msk);

  STM32_CLEAR_BIT(p_hspx->EVT_IER, HSP_EVT_IER_CAPRDYIE);
  hhsp->tsc_handler = NULL;

  STM32_CLEAR_BIT(p_hspx->ERR_IER, HSP_ERR_IER_CAPOVRIE);
  hhsp->tsc_err_handler = NULL;

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup HSP_Exported_Functions_Group8
  * @{
  */
/**
  * @brief  Enable the BRAM Conflict Access Counter.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_BRAM_EnableConflictAccessCounter(const HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_SET_BIT(p_hspx->CAPCR, HSP_CAPCR_CCNTREN);

  return HAL_OK;
}

/**
  * @brief  Disable the BRAM Conflict Access Counter.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_BRAM_DisableConflictAccessCounter(const HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_CLEAR_BIT(p_hspx->CAPCR, HSP_CAPCR_CCNTREN);

  return HAL_OK;
}

/**
  * @brief  Check whether or not the BRAM Conflict Access Counter is enabled.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval The state of enabling (0 or 1)
  */
uint32_t HAL_HSP_BRAM_IsEnabledConflictAccessCounter(const HSP_HandleTypeDef *hhsp)
{
  uint32_t bit_val;

  ASSERT_DBG_PARAM((hhsp != NULL));

  bit_val = STM32_READ_BIT(((HSP_TypeDef *)(uint32_t)(hhsp->Instance))->CAPCR, HSP_CAPCR_CCNTREN_Msk);
  return (uint32_t)(((bit_val == HSP_CAPCR_CCNTREN) != 0U) ? 1U : 0U);
}

/**
  * @brief  Get the BRAM Conflict Access Counter value.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @return Counter value
  */
uint32_t HAL_HSP_BRAM_GetConflictAccessCounter(const HSP_HandleTypeDef *hhsp)
{
  ASSERT_DBG_PARAM((hhsp != NULL));

  return STM32_READ_REG(((HSP_TypeDef *)(uint32_t)(hhsp->Instance))->CAPDR);
}

/**
  * @brief  Set the BRAM Bandwidth Arbitration.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @param  mode  Max abritration latency
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_BRAM_SetBandwidthArbitration(const HSP_HandleTypeDef *hhsp,
                                                       HAL_HSP_BRAM_ArbitrationTypeDef mode)
{
  HSP_TypeDef *p_hspx;

