zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_BRAM_ARBITRATION(mode));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_MODIFY_REG(p_hspx->CR, HSP_CR_BARB_Msk, (uint32_t)mode);

  return HAL_OK;
}

/**
  * @brief  Get the BRAM Bandwidth Arbitration.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval HAL_HSP_BRAM_ARBITRATION_LATENCY_16_CYCLES
  * @retval HAL_HSP_BRAM_ARBITRATION_LATENCY_8_CYCLES
  * @retval HAL_HSP_BRAM_ARBITRATION_LATENCY_4_CYCLES
  */
HAL_HSP_BRAM_ArbitrationTypeDef HAL_HSP_BRAM_GetBandwidthArbitration(const HSP_HandleTypeDef *hhsp)
{
  const HSP_TypeDef *p_hspx;
  uint32_t reg_value;

  ASSERT_DBG_PARAM((hhsp != NULL));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  reg_value = STM32_READ_BIT(p_hspx->CR, HSP_CR_BARB_Msk);
  return ((HAL_HSP_BRAM_ArbitrationTypeDef)reg_value);
}

/* SPE Performance Monitoring *************************************************/
/**
  * @brief  Get the Performance Cycle counter.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @return Counter value
  */
uint32_t HAL_HSP_GetPerformanceCycleCount(const HSP_HandleTypeDef *hhsp)
{
  ASSERT_DBG_PARAM((hhsp != NULL));

  if (hhsp->p_perf_counter == NULL)
  {
    return 0U;
  }

  return *(hhsp->p_perf_counter);
}

/**
  * @brief  Get the Firmware Error.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @return Error code
  */
uint32_t HAL_HSP_GetFirmwareError(const HSP_HandleTypeDef *hhsp)
{
  const HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM((hhsp != NULL));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  return (uint32_t)(STM32_READ_BIT(p_hspx->FWERR, HSP_FWERR_FWERRN_Msk) >> HSP_FWERR_FWERRN_Pos);
}

/* SPE Error Interrupt -------------------------------------------------------*/
/**
  * @brief  Enable the SPE Event Interrupts.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @param  interrupts  Event Interrupts mask.
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_IT_EVT_CMD_DIRECT_COMMAND_DONE
  *             @arg HAL_HSP_IT_EVT_SPE_ENTER_IN_WFE
  *             @arg HAL_HSP_IT_EVT_SPE_EXIT_FROM_WFE
  *             @arg HAL_HSP_IT_EVT_SPE_FPU_SATURATION
  *             @arg HAL_HSP_IT_EVT_SPE_ALL: All SPE Event Interrupts
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_SPE_EVENT_EnableIT(HSP_HandleTypeDef *hhsp, uint32_t interrupts)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_IT_EVT_SPE(interrupts));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  hhsp->spe_handler = HSP_SPE_Handler;
  STM32_SET_BIT(p_hspx->EVT_IER, interrupts);

  return HAL_OK;
}

/**
  * @brief  Disable SPE Event Interrupts.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  interrupts  Event Interrupts mask.
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_IT_EVT_CMD_DIRECT_COMMAND_DONE
  *             @arg HAL_HSP_IT_EVT_SPE_ENTER_IN_WFE
  *             @arg HAL_HSP_IT_EVT_SPE_EXIT_FROM_WFE
  *             @arg HAL_HSP_IT_EVT_SPE_FPU_SATURATION
  *             @arg HAL_HSP_IT_EVT_SPE_ALL: All SPE Event Interrupts
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_SPE_EVENT_DisableIT(HSP_HandleTypeDef *hhsp, uint32_t interrupts)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_IT_EVT_SPE(interrupts));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_CLEAR_BIT(p_hspx->EVT_IER, interrupts);

  if (STM32_READ_BIT(p_hspx->EVT_IER, HSP_IT_EVT_ALL) == HAL_HSP_IT_NONE)
  {
    /* All SPE Event Interrupts are disabled */
    hhsp->spe_handler = NULL;
  }

  return HAL_OK;
}

/**
  * @brief  Return the SPE Event Interrupt status.
  * @param  hhsp       Pointer to a @ref HSP_HandleTypeDef.
  * @param  interrupt  Interrupt mask.
  *         This parameter can be one of following values:
  *             @arg HAL_HSP_IT_EVT_CMD_DIRECT_COMMAND_DONE
  *             @arg HAL_HSP_IT_EVT_SPE_ENTER_IN_WFE
  *             @arg HAL_HSP_IT_EVT_SPE_EXIT_FROM_WFE
  *             @arg HAL_HSP_IT_EVT_SPE_FPU_SATURATION
  * @retval HAL_HSP_SPE_IT_ENABLED   Interrupt is enabled.
  * @retval HAL_HSP_SPE_IT_DISABLED  Interrupt is disabled.
  */
HAL_HSP_SPE_IT_StatusTypeDef HAL_HSP_SPE_EVENT_IsEnabledIT(const HSP_HandleTypeDef *hhsp, uint32_t interrupt)
{
  const HSP_TypeDef *p_hspx;
  uint32_t status;

  ASSERT_DBG_PARAM((hhsp != NULL));
  ASSERT_DBG_PARAM(IS_HSP_IT_EVT_SPE(interrupt));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  status = STM32_READ_BIT(p_hspx->EVT_IER, interrupt);
  return ((status != 0U) ? HAL_HSP_SPE_IT_ENABLED : HAL_HSP_SPE_IT_DISABLED);
}

/**
  * @brief  Enable the SPE Error Interrupts.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  interrupts  Error Interrupts mask.
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_IT_ERR_SPE_FW
  *             @arg HAL_HSP_IT_ERR_SPE_SCHEDULER
  *             @arg HAL_HSP_IT_ERR_SPE_BREAK
  *             @arg HAL_HSP_IT_ERR_SPE_HDEG_OVR
  *             @arg HAL_HSP_IT_ERR_SPE_INVALID_OPCODE
  *             @arg HAL_HSP_IT_ERR_SPE_ACCESS
  *             @arg HAL_HSP_IT_ERR_SPE_FPU_UDF
  *             @arg HAL_HSP_IT_ERR_SPE_FPU_OVF
  *             @arg HAL_HSP_IT_ERR_SPE_FPU_DBZ
  *             @arg HAL_HSP_IT_ERR_SPE_FPU_INVALID
  *             @arg HAL_HSP_IT_ERR_SPE_FPU_DENORMAL
  *             @arg HAL_HSP_IT_ERR_SPE_ALL: All SPE Error Interrupts
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_SPE_ERROR_EnableIT(HSP_HandleTypeDef *hhsp, uint32_t interrupts)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_IT_ERR_SPE(interrupts));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  hhsp->spe_err_handler = HSP_SPE_Error_Handler;
  STM32_SET_BIT(p_hspx->ERR_IER, interrupts);

  return HAL_OK;
}

/**
  * @brief  Disable SPE Error Interrupts.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  interrupts  Error Interrupts mask.
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_IT_ERR_SPE_FW
  *             @arg HAL_HSP_IT_ERR_SPE_SCHEDULER
  *             @arg HAL_HSP_IT_ERR_SPE_BREAK
  *             @arg HAL_HSP_IT_ERR_SPE_HDEG_OVR
  *             @arg HAL_HSP_IT_ERR_SPE_INVALID_OPCODE
  *             @arg HAL_HSP_IT_ERR_SPE_ACCESS
  *             @arg HAL_HSP_IT_ERR_SPE_FPU_UDF
  *             @arg HAL_HSP_IT_ERR_SPE_FPU_OVF
  *             @arg HAL_HSP_IT_ERR_SPE_FPU_DBZ
  *             @arg HAL_HSP_IT_ERR_SPE_FPU_INVALID
  *             @arg HAL_HSP_IT_ERR_SPE_FPU_DENORMAL
  *             @arg HAL_HSP_IT_ERR_SPE_ALL: All SPE Error Interrupts
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_SPE_ERROR_DisableIT(HSP_HandleTypeDef *hhsp, uint32_t interrupts)
{
  HSP_TypeDef *p_hspx;

