zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_IT_ERR_SPE(interrupts));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_CLEAR_BIT(p_hspx->ERR_IER, interrupts);

  if (STM32_READ_BIT(p_hspx->ERR_IER, HSP_IT_ERR_ALL) == HAL_HSP_IT_NONE)
  {
    /* All SPE Error Interrupts are disabled */
    hhsp->spe_err_handler = NULL;
  }

  return HAL_OK;
}

/**
  * @brief  Return the SPE Error Interrupt status.
  * @param  hhsp       Pointer to a @ref HSP_HandleTypeDef.
  * @param  interrupt  Interrupt.
  *         This parameter can be one of following values:
  *             @arg HAL_HSP_IT_ERR_SPE_FW
  *             @arg HAL_HSP_IT_ERR_SPE_SCHEDULER
  *             @arg HAL_HSP_IT_ERR_SPE_BREAK
  *             @arg HAL_HSP_IT_ERR_SPE_HDEG_OVR
  *             @arg HAL_HSP_IT_ERR_SPE_INVALID_OPCODE
  *             @arg HAL_HSP_IT_ERR_SPE_ACCESS
  *             @arg HAL_HSP_IT_ERR_SPE_FPU_UDF
  *             @arg HAL_HSP_IT_ERR_SPE_FPU_OVF
  *             @arg HAL_HSP_IT_ERR_SPE_FPU_DBZ
  *             @arg HAL_HSP_IT_ERR_SPE_FPU_INVALID
  *             @arg HAL_HSP_IT_ERR_SPE_FPU_DENORMAL
  * @retval HAL_HSP_SPE_IT_ENABLED   Interrupt is enabled.
  * @retval HAL_HSP_SPE_IT_DISABLED  Interrupt is disabled.
  */
HAL_HSP_SPE_IT_StatusTypeDef HAL_HSP_SPE_ERROR_IsEnabledIT(const HSP_HandleTypeDef *hhsp, uint32_t interrupt)
{
  const HSP_TypeDef *p_hspx;
  uint32_t status;

  ASSERT_DBG_PARAM((hhsp != NULL));
  ASSERT_DBG_PARAM(IS_HSP_IT_ERR_SPE(interrupt));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  status = STM32_READ_BIT(p_hspx->ERR_IER, interrupt);
  return ((status != 0U) ? HAL_HSP_SPE_IT_ENABLED : HAL_HSP_SPE_IT_DISABLED);
}

/**
  * @}
  */

/** @addtogroup HSP_Exported_Functions_Group9
  * @{
  */
/**
  * @brief  Select the internal signals to observe.
  * @param  hhsp     Pointer to a @ref HSP_HandleTypeDef.
  * @param  signals  Mask of signals to output.
  *         This parameter can be a combination of following values:
  *         @arg @ref  HAL_HSP_SNOOP_GRPA_TASK_2_1_0
  *         @arg @ref  HAL_HSP_SNOOP_GRPA_DMA_CH_2_1_0_IT
  *         @arg @ref  HAL_HSP_SNOOP_GRPA_TRGIN_BUFF_ADC
  *         @arg @ref  HAL_HSP_SNOOP_GRPA_TSC_PFCTNB_2_1_0
  *         @arg @ref  HAL_HSP_SNOOP_GRPA_TSC_CMP_2_1_0
  *         @arg @ref  HAL_HSP_SNOOP_GRPA_EVTCWKUP_SPEJUMP_SPEWFE
  *         @arg @ref  HAL_HSP_SNOOP_GRPA_PE_2_1_0
  *         @arg @ref  HAL_HSP_SNOOP_GRPB_TASK_5_4_3
  *         @arg @ref  HAL_HSP_SNOOP_GRPB_PRC_25_24_23
  *         @arg @ref  HAL_HSP_SNOOP_GRPB_DCMD_CDEG_HDEG
  *         @arg @ref  HAL_HSP_SNOOP_GRPB_TSC_PFCTNB_5_4_3
  *         @arg @ref  HAL_HSP_SNOOP_GRPB_TSC_CMP_3
  *         @arg @ref  HAL_HSP_SNOOP_GRPB_TSC_PULSE_CALL_IF_IFTRUE
  *         @arg @ref  HAL_HSP_SNOOP_GRPB_PE_5_4_3
  * @retval HAL_OK  Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_SNOOP_Enable(const HSP_HandleTypeDef *hhsp, uint32_t signals)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_SNOOP_SIGNAL(signals));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_MODIFY_REG(p_hspx->SNPR, (HSP_SNPR_SNPSELB_Msk | HSP_SNPR_SNPSELA_Msk), signals);

  return HAL_OK;
}

/**
  * @brief  Select the internal signals to observe.
  * @param  hhsp    Pointer to a @ref HSP_HandleTypeDef.
  * @param  groups  Mask of groups to disable.
  *         This parameter can be a combination of following values:
  *         @arg @ref  HAL_HSP_SNOOP_GROUP_A
  *         @arg @ref  HAL_HSP_SNOOP_GROUP_B
  *         @arg @ref  HAL_HSP_SNOOP_GROUP_ALL
  * @retval HAL_OK  Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_SNOOP_Disable(const HSP_HandleTypeDef *hhsp, uint32_t groups)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_SNOOP_SIGNAL(groups));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_CLEAR_BIT(p_hspx->SNPR, groups);

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup HSP_Exported_Functions_Group10
  * @{
  */
/**
  * @brief  Enable Critical Events to warn sensitive peripherals when a critical issue is detected by HSP.
  * @param  hhsp    Pointer to a @ref HSP_HandleTypeDef.
  * @param  output_id  ID of Break Output.
  * @param  events  Mask of Critical Event to enable.
  *         This parameter can be a combination of following values:
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_MEMORY_ACCESS
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_FPU
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_OPCODE
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_PFCT28
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_PFCT29
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_PFCT30
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_PFCT31
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_FIRMWARE
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_SPE_OVR
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_ALL
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_BREAK_EnableCriticalEvent(const HSP_HandleTypeDef *hhsp,
                                                    HAL_HSP_BREAK_OutputTypeDef output_id, uint32_t events)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_BREAK_OUTPUT(output_id));
  ASSERT_DBG_PARAM(STM32_IS_BIT_SET(HAL_HSP_BREAK_CRITICAL_EVENT_ALL, events));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_SET_BIT(p_hspx->BKOCFGR[(uint32_t)output_id], events);

  return HAL_OK;
}

/**
  * @brief  Disable Critical Events used to warn sensitive peripherals when a critical issue is detected by HSP.
  * @param  hhsp    Pointer to a @ref HSP_HandleTypeDef.
  * @param  output_id  ID of Break Output.
  * @param  events  Mask of Critical Event to disable.
  *         This parameter can be a combination of following values:
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_MEMORY_ACCESS
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_FPU
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_OPCODE
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_PFCT28
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_PFCT29
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_PFCT30
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_PFCT31
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_FIRMWARE
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_SPE_OVR
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_ALL
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_BREAK_DisableCriticalEvent(const HSP_HandleTypeDef *hhsp,
                                                     HAL_HSP_BREAK_OutputTypeDef output_id, uint32_t events)
{
  HSP_TypeDef *p_hspx;

