zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_BREAK_OUTPUT(output_id));
  ASSERT_DBG_PARAM(STM32_IS_BIT_SET(HAL_HSP_BREAK_CRITICAL_EVENT_ALL, events));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_CLEAR_BIT(p_hspx->BKOCFGR[(uint32_t)output_id], events);

  return HAL_OK;
}

/**
  * @brief  Get the enabling status of Critical Event used.
  * @param  hhsp   Pointer to a @ref HSP_HandleTypeDef.
  * @param  output_id  ID of Break Output.
  * @param  event  Mask of Critical Event to disable.
  *         This parameter can be one of following values:
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_MEMORY_ACCESS
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_FPU
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_OPCODE
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_PFCT28
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_PFCT29
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_PFCT30
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_PFCT31
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_FIRMWARE
  *         @arg @ref  HAL_HSP_BREAK_CRITICAL_EVENT_SPE_OVR
  * @retval HAL_HSP_BREAK_CRITICAL_EVENT_DISABLED Critical Event is disabled.
  * @retval HAL_HSP_BREAK_CRITICAL_EVENT_ENABLED  Critical Event is enabled.
  */
HAL_HSP_BREAK_Critical_Event_StatusTypeDef HAL_HSP_BREAK_IsEnabledCriticalEvent(const HSP_HandleTypeDef *hhsp,
                                                                                HAL_HSP_BREAK_OutputTypeDef output_id,
                                                                                uint32_t event)
{
  const HSP_TypeDef *p_hspx;
  uint32_t status;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_BREAK_OUTPUT(output_id));
  ASSERT_DBG_PARAM(IS_HSP_BREAK_CRITICAL_EVENT(event));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  status = STM32_READ_BIT(p_hspx->BKOCFGR[(uint32_t)output_id], event);

  return (((status == 0U) ? HAL_HSP_BREAK_CRITICAL_EVENT_DISABLED : HAL_HSP_BREAK_CRITICAL_EVENT_ENABLED));
}

/**
  * @brief  Enable Events to freeze the SPE from internal error or error reported by an external block.
  * @param  hhsp    Pointer to a @ref HSP_HandleTypeDef.
  * @param  events  Mask of Freeze Event to enable.
  *         This parameter can be a combination of following values:
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_MEMORY_ACCESS
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_FPU
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_OPCODE
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_PFCT28
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_PFCT29
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_PFCT30
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_PFCT31
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_FIRMWARE
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_SPE_OVR
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_FPU_SATURATION
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_ALL
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_BREAK_EnableFreezeEvent(const HSP_HandleTypeDef *hhsp, uint32_t events)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(STM32_IS_BIT_SET(HAL_HSP_BREAK_FREEZE_EVENT_ALL, events));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_SET_BIT(p_hspx->BKICFGR, events);

  return HAL_OK;
}

/**
  * @brief  Disable Events used to freeze the SPE from internal error
  *         or error reported by an external block.
  * @param  hhsp    Pointer to a @ref HSP_HandleTypeDef.
  * @param  events  Mask of Freeze Event to enable.
  *         This parameter can be a combination of following values:
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_MEMORY_ACCESS
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_FPU
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_OPCODE
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_PFCT28
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_PFCT29
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_PFCT30
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_PFCT31
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_FIRMWARE
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_SPE_OVR
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_FPU_SATURATION
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_ALL
  * @retval HAL_OK Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_BREAK_DisableFreezeEvent(const HSP_HandleTypeDef *hhsp, uint32_t events)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(STM32_IS_BIT_SET(HAL_HSP_BREAK_FREEZE_EVENT_ALL, events));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_CLEAR_BIT(p_hspx->BKICFGR, events);

  return HAL_OK;
}

/**
  * @brief  Get the enabling status of SPE Freeze Event used.
  * @param  hhsp   Pointer to a @ref HSP_HandleTypeDef.
  * @param  event  Mask of Critical Event to check.
  *         This parameter can be one of following values:
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_MEMORY_ACCESS
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_FPU
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_OPCODE
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_PFCT28
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_PFCT29
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_PFCT30
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_PFCT31
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_FIRMWARE
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_SPE_OVR
  *           @arg @ref HAL_HSP_BREAK_FREEZE_EVENT_FPU_SATURATION
  * @retval HAL_HSP_BREAK_FREEZE_EVENT_DISABLED Critical Event is disabled.
  * @retval HAL_HSP_BREAK_FREEZE_EVENT_ENABLED  Critical Event is enabled.
  */
HAL_HSP_BREAK_Freeze_Event_StatusTypeDef HAL_HSP_BREAK_IsEnabledFreezeEvent(const HSP_HandleTypeDef *hhsp,
                                                                            uint32_t event)
{
  const HSP_TypeDef *p_hspx;
  uint32_t status;

