zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_BREAK_FREEZE_EVENT(event));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  status = STM32_READ_BIT(p_hspx->BKICFGR, event);

  return (((status == 0U) ? HAL_HSP_BREAK_FREEZE_EVENT_DISABLED : HAL_HSP_BREAK_FREEZE_EVENT_ENABLED));
}

/**
  * @}
  */

/** @addtogroup HSP_Exported_Functions_Group11
  * @{
  */
/**
  * @brief  Lock the configuration.
  * @param  hhsp Pointer to a @ref HSP_HandleTypeDef.
  * @note   Once locked, HSP configuration cannot be changed (use case: safety purpose).
  * @note   HSP can be unlocked with a system reset.
  * @retval HAL_OK     Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_Lock(const HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_SET_BIT(p_hspx->CR, HSP_CR_REGLCK_Msk);

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup HSP_Exported_Functions_Group11_1
  * @{
  */
/**
  * @brief  Backup all interrupt and event activation states.
  * @param  hhsp  Pointer to a HSP_HandleTypeDef.
  * @note   This function is dedicated for CNN function usage.
  * @retval HAL_OK  Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_CNN_EnterSafeMode(HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Save some registers status */
  hhsp->backup_enabled_itfs = STM32_READ_REG(p_hspx->ITFENR);
  hhsp->backup_enabled_events = STM32_READ_REG(p_hspx->EVTENR);
  hhsp->backup_event_its = STM32_READ_REG(p_hspx->EVT_IER);
  hhsp->backup_pfctevt_its = STM32_READ_REG(p_hspx->PFCTEVT_IER);

  /* Disable all interrupts except Error ITs */
  STM32_WRITE_REG(p_hspx->EVT_IER, 0U);
  STM32_WRITE_REG(p_hspx->PFCTEVT_IER, 0U);

  /* Disable all events */
  STM32_WRITE_REG(p_hspx->EVTENR, 0U);

  /* Disable all interfaces except HDEG, HSEG, CDEG */
  STM32_WRITE_REG(p_hspx->ITFENR, 0xE0000000U);

  return HAL_OK;
}

/**
  * @brief  Restore all interrupt and event activation states.
  * @param  hhsp  Pointer to a HSP_HandleTypeDef.
  * @note   This function is dedicated for CNN function usage.
  * @retval HAL_OK  Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_CNN_ExitSafeMode(const HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Restore interrupts */
  STM32_WRITE_REG(p_hspx->EVT_IER, hhsp->backup_event_its);
  STM32_WRITE_REG(p_hspx->PFCTEVT_IER, hhsp->backup_pfctevt_its);

  /* Restore events */
  STM32_WRITE_REG(p_hspx->EVTENR, hhsp->backup_enabled_events);

  /* Restore interfaces */
  STM32_WRITE_REG(p_hspx->ITFENR, hhsp->backup_enabled_itfs);

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup HSP_Exported_Functions_Group12
  * @{
  */
/**
  * @brief  Run a task in Polling mode.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  task_id     Task Number.
  * @param  timeout_ms  Timeout duration (in ms).
  * @note   The task will be execute with the lower priority
  * @note   If a task is not linked to a processing list, the function will return an error
  * @retval HAL_OK     Operation completed successfully.
  * @retval HAL_BUSY   A running Task is going.
  * @retval HAL_TIMEOUT   Timeout occurred.
  */
HAL_StatusTypeDef HAL_HSP_TASK_Run(const HSP_HandleTypeDef *hhsp, HAL_HSP_TaskTypeDef task_id, uint32_t timeout_ms)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_TASK(task_id));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Check if a task is in progress */
  if (STM32_READ_BIT(p_hspx->CDEGR, HSP_CDEGR_CDEGBSY) == HSP_CDEGR_CDEGBSY)
  {
    return HAL_BUSY;
  }

  STM32_MODIFY_REG(p_hspx->CDEGR, HSP_CDEGR_CTSKN, ((uint32_t)task_id) << HSP_CDEGR_CTSKN_Pos);

  /* Wait until the CDEG is ready to accept the generation of a new event */
  uint32_t tick_start = HAL_GetTick();
  while (STM32_READ_BIT(p_hspx->CDEGR, HSP_CDEGR_CDEGBSY) != 0U)
  {
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if ((HAL_GetTick() - tick_start) > timeout_ms)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief  Run a task in IT mode.
  * @param  hhsp     Pointer to a @ref HSP_HandleTypeDef.
  * @param  task_id  Task Number
  * @note   The task will be execute with the lower priority
  * @note   If a task is not linked to a processing list, the function will return an error
  * @retval HAL_OK     Operation completed successfully.
  * @retval HAL_BUSY   A task execution is ongoing.
  */
HAL_StatusTypeDef HAL_HSP_TASK_Run_IT(HSP_HandleTypeDef *hhsp, HAL_HSP_TaskTypeDef task_id)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_TASK(task_id));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Check if a task is in progress */
  if (STM32_READ_BIT(p_hspx->CDEGR, HSP_CDEGR_CDEGBSY) == HSP_CDEGR_CDEGBSY)
  {
    return HAL_BUSY;
  }

  /* Initialize the IRQ subroutine to process miscelleanous SPE IT */
  hhsp->cmd_handler = HSP_CMD_Handler;

  STM32_SET_BIT(p_hspx->EVT_IER, HAL_HSP_IT_EVT_CMD_CDEG_READY);

  STM32_MODIFY_REG(p_hspx->CDEGR, HSP_CDEGR_CTSKN, ((uint32_t)task_id) << HSP_CDEGR_CTSKN_Pos);

  return HAL_OK;
}

/**
  * @brief  Poll on Processing Function Event Flags.
  * @param  hhsp       Pointer to a @ref HSP_HandleTypeDef.
  * @param  poll_mode  Polling mode.
  * @param  pfct_events  Mask of events to poll.
  *         This parameter can be a combination of the following values:
  *             @arg HAL_HSP_PROCLIST_EVT_0:   The Flag of Processing Function Event 0
  *             @arg HAL_HSP_PROCLIST_EVT_1:   The Flag of Processing Function Event 1
  *             @arg HAL_HSP_PROCLIST_EVT_2:   The Flag of Processing Function Event 2
  *             @arg HAL_HSP_PROCLIST_EVT_3:   The Flag of Processing Function Event 3
  *             @arg HAL_HSP_PROCLIST_EVT_4:   The Flag of Processing Function Event 4
  *             @arg HAL_HSP_PROCLIST_EVT_5:   The Flag of Processing Function Event 5
  *             @arg HAL_HSP_PROCLIST_EVT_6:   The Flag of Processing Function Event 6
  *             @arg HAL_HSP_PROCLIST_EVT_7:   The Flag of Processing Function Event 7
  *             @arg HAL_HSP_PROCLIST_EVT_8:   The Flag of Processing Function Event 8
  *             @arg HAL_HSP_PROCLIST_EVT_9:   The Flag of Processing Function Event 9
  *             @arg HAL_HSP_PROCLIST_EVT_10:  The Flag of Processing Function Event 10
  *             @arg HAL_HSP_PROCLIST_EVT_11:  The Flag of Processing Function Event 11
  *             @arg HAL_HSP_PROCLIST_EVT_12:  The Flag of Processing Function Event 12
  *             @arg HAL_HSP_PROCLIST_EVT_13:  The Flag of Processing Function Event 13
  *             @arg HAL_HSP_PROCLIST_EVT_14:  The Flag of Processing Function Event 14
  *             @arg HAL_HSP_PROCLIST_EVT_15:  The Flag of Processing Function Event 15
  *             @arg HAL_HSP_PROCLIST_EVT_16:  The Flag of Processing Function Event 16
  *             @arg HAL_HSP_PROCLIST_EVT_17:  The Flag of Processing Function Event 17
  *             @arg HAL_HSP_PROCLIST_EVT_18:  The Flag of Processing Function Event 18
  *             @arg HAL_HSP_PROCLIST_EVT_19:  The Flag of Processing Function Event 19
  *             @arg HAL_HSP_PROCLIST_EVT_20:  The Flag of Processing Function Event 20
  *             @arg HAL_HSP_PROCLIST_EVT_21:  The Flag of Processing Function Event 21
  *             @arg HAL_HSP_PROCLIST_EVT_22:  The Flag of Processing Function Event 22
  *             @arg HAL_HSP_PROCLIST_EVT_23:  The Flag of Processing Function Event 23
  *             @arg HAL_HSP_PROCLIST_EVT_24:  The Flag of Processing Function Event 24
  *             @arg HAL_HSP_PROCLIST_EVT_25:  The Flag of Processing Function Event 25
  *             @arg HAL_HSP_PROCLIST_EVT_26:  The Flag of Processing Function Event 26
  *             @arg HAL_HSP_PROCLIST_EVT_27:  The Flag of Processing Function Event 27
  *             @arg HAL_HSP_PROCLIST_EVT_28:  The Flag of Processing Function Event 28
  *             @arg HAL_HSP_PROCLIST_EVT_29:  The Flag of Processing Function Event 29
  *             @arg HAL_HSP_PROCLIST_EVT_30:  The Flag of Processing Function Event 30
  *             @arg HAL_HSP_PROCLIST_EVT_31:  The Flag of Processing Function Event 31
  *             @arg HAL_HSP_PROCLIST_EVT_ALL: All Flags of Processing Function Event
  * @param  timeout_ms           Timeout duration (in ms).
  * @param  p_pfct_events_status  Pointer to return the Processing Function Event flags.
  * @retval HAL_OK  Operation completed successfully.
  * @retval HAL_TIMEOUT Operation timed out.
  * @retval HAL_ERROR   Invalid parameter.
  */
HAL_StatusTypeDef HAL_HSP_PROCLIST_PollForNotification(HSP_HandleTypeDef *hhsp,
                                                       HAL_HSP_POLLING_ModeTypeDef poll_mode,
                                                       uint32_t pfct_events, uint32_t timeout_ms,
                                                       uint32_t *p_pfct_events_status)
{
  HSP_TypeDef *p_hspx;
  uint32_t tickstart;

