zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_POLLING_MODE(poll_mode));
  ASSERT_DBG_PARAM(IS_HSP_PROCLIST_IT_PFCTEVT(pfct_events));
  ASSERT_DBG_PARAM(p_pfct_events_status != NULL);

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  if (p_pfct_events_status == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Get tick count */
  tickstart = HAL_GetTick();

  /* Check selected event flag */
  *p_pfct_events_status = 0U;
  do
  {
    /* Check if timeout is disabled (set to infinite wait) */
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0UL))
      {
        return HAL_TIMEOUT;
      }
    }

    uint32_t current_flag_status = STM32_READ_BIT(p_hspx->PFCTEVT_ISR, pfct_events);
    if (poll_mode == HAL_HSP_POLLING_FOR_ANY_EVENT)
    {
      *p_pfct_events_status = current_flag_status;
    }
    else
    {
      *p_pfct_events_status = ((STM32_IS_BIT_SET(current_flag_status, pfct_events) == 1U) ? current_flag_status : 0U);
    }
  } while (*p_pfct_events_status == 0U);

  /* Clear flags triggered */
  STM32_WRITE_REG(p_hspx->PFCTEVT_ICR, *p_pfct_events_status);

  return HAL_OK;
}

/**
  * @brief  Enable Processing Function Event Interrupts.
  * @param  hhsp      Pointer to a @ref HSP_HandleTypeDef.
  * @param  interrupts  Mask of Processing Function Event Interrupts
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_0:   The Interrupt of Processing Function Event 0
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_1:   The Interrupt of Processing Function Event 1
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_2:   The Interrupt of Processing Function Event 2
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_3:   The Interrupt of Processing Function Event 3
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_4:   The Interrupt of Processing Function Event 4
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_5:   The Interrupt of Processing Function Event 5
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_6:   The Interrupt of Processing Function Event 6
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_7:   The Interrupt of Processing Function Event 7
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_8:   The Interrupt of Processing Function Event 8
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_9:   The Interrupt of Processing Function Event 9
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_10:  The Interrupt of Processing Function Event 10
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_11:  The Interrupt of Processing Function Event 11
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_12:  The Interrupt of Processing Function Event 12
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_13:  The Interrupt of Processing Function Event 13
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_14:  The Interrupt of Processing Function Event 14
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_15:  The Interrupt of Processing Function Event 15
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_16:  The Interrupt of Processing Function Event 16
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_17:  The Interrupt of Processing Function Event 17
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_18:  The Interrupt of Processing Function Event 18
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_19:  The Interrupt of Processing Function Event 19
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_20:  The Interrupt of Processing Function Event 20
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_21:  The Interrupt of Processing Function Event 21
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_22:  The Interrupt of Processing Function Event 22
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_23:  The Interrupt of Processing Function Event 23
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_24:  The Interrupt of Processing Function Event 24
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_25:  The Interrupt of Processing Function Event 25
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_26:  The Interrupt of Processing Function Event 26
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_27:  The Interrupt of Processing Function Event 27
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_28:  The Interrupt of Processing Function Event 28
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_29:  The Interrupt of Processing Function Event 29
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_30:  The Interrupt of Processing Function Event 30
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_31:  The Interrupt of Processing Function Event 31
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_ALL: All Interrupts of Processing Function Event
  * @retval HAL_OK  Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_PROCLIST_EnableIT(HSP_HandleTypeDef *hhsp, uint32_t interrupts)
{
  HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_PROCLIST_IT_PFCTEVT(interrupts));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_SET_BIT(p_hspx->PFCTEVT_IER, interrupts);

  return HAL_OK;
}

/**
  * @brief  Disable Processing Function Event Interrupts.
  * @param  hhsp      Pointer to a @ref HSP_HandleTypeDef.
  * @param  interrupts  Mask of Processing Function Event Interrupts
  *         This parameter can be a combination of following values:
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_0:   The Interrupt of Processing Function Event 0
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_1:   The Interrupt of Processing Function Event 1
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_2:   The Interrupt of Processing Function Event 2
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_3:   The Interrupt of Processing Function Event 3
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_4:   The Interrupt of Processing Function Event 4
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_5:   The Interrupt of Processing Function Event 5
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_6:   The Interrupt of Processing Function Event 6
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_7:   The Interrupt of Processing Function Event 7
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_8:   The Interrupt of Processing Function Event 8
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_9:   The Interrupt of Processing Function Event 9
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_10:  The Interrupt of Processing Function Event 10
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_11:  The Interrupt of Processing Function Event 11
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_12:  The Interrupt of Processing Function Event 12
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_13:  The Interrupt of Processing Function Event 13
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_14:  The Interrupt of Processing Function Event 14
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_15:  The Interrupt of Processing Function Event 15
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_16:  The Interrupt of Processing Function Event 16
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_17:  The Interrupt of Processing Function Event 17
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_18:  The Interrupt of Processing Function Event 18
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_19:  The Interrupt of Processing Function Event 19
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_20:  The Interrupt of Processing Function Event 20
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_21:  The Interrupt of Processing Function Event 21
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_22:  The Interrupt of Processing Function Event 22
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_23:  The Interrupt of Processing Function Event 23
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_24:  The Interrupt of Processing Function Event 24
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_25:  The Interrupt of Processing Function Event 25
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_26:  The Interrupt of Processing Function Event 26
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_27:  The Interrupt of Processing Function Event 27
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_28:  The Interrupt of Processing Function Event 28
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_29:  The Interrupt of Processing Function Event 29
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_30:  The Interrupt of Processing Function Event 30
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_31:  The Interrupt of Processing Function Event 31
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_ALL: All Interrupts of Processing Function Event
  * @retval HAL_OK  Operation completed successfully.
  */
HAL_StatusTypeDef HAL_HSP_PROCLIST_DisableIT(const HSP_HandleTypeDef *hhsp, uint32_t interrupts)
{
  HSP_TypeDef *p_hspx;

