zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_PROCLIST_IT_PFCTEVT(interrupts));

  HSP_ASSERT_DBG_STATE(hhsp->global_state, (uint32_t)HAL_HSP_STATE_RUNNING);

  p_hspx = HSP_GET_INSTANCE(hhsp);

  STM32_CLEAR_BIT(p_hspx->PFCTEVT_IER, interrupts);

  return HAL_OK;
}

/**
  * @brief  Check whether or not the specified Processing Function Event interrupt is set.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @param  interrupt  Mask of Processing Function Event Interrupt
  *         It can be one of the following values:
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_0:   The Interrupt of Processing Function Event 0
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_1:   The Interrupt of Processing Function Event 1
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_2:   The Interrupt of Processing Function Event 2
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_3:   The Interrupt of Processing Function Event 3
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_4:   The Interrupt of Processing Function Event 4
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_5:   The Interrupt of Processing Function Event 5
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_6:   The Interrupt of Processing Function Event 6
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_7:   The Interrupt of Processing Function Event 7
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_8:   The Interrupt of Processing Function Event 8
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_9:   The Interrupt of Processing Function Event 9
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_10:  The Interrupt of Processing Function Event 10
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_11:  The Interrupt of Processing Function Event 11
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_12:  The Interrupt of Processing Function Event 12
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_13:  The Interrupt of Processing Function Event 13
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_14:  The Interrupt of Processing Function Event 14
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_15:  The Interrupt of Processing Function Event 15
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_16:  The Interrupt of Processing Function Event 16
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_17:  The Interrupt of Processing Function Event 17
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_18:  The Interrupt of Processing Function Event 18
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_19:  The Interrupt of Processing Function Event 19
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_20:  The Interrupt of Processing Function Event 20
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_21:  The Interrupt of Processing Function Event 21
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_22:  The Interrupt of Processing Function Event 22
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_23:  The Interrupt of Processing Function Event 23
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_24:  The Interrupt of Processing Function Event 24
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_25:  The Interrupt of Processing Function Event 25
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_26:  The Interrupt of Processing Function Event 26
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_27:  The Interrupt of Processing Function Event 27
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_28:  The Interrupt of Processing Function Event 28
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_29:  The Interrupt of Processing Function Event 29
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_30:  The Interrupt of Processing Function Event 30
  *             @arg HAL_HSP_PROCLIST_IT_PFCTEVT_31:  The Interrupt of Processing Function Event 31
  * @retval The state of HSP interrupt (0 or 1)
  */
uint32_t HAL_HSP_PROCLIST_IsEnabledIT(const HSP_HandleTypeDef *hhsp,
                                      uint32_t interrupt)
{
  const HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM((hhsp != NULL));
  ASSERT_DBG_PARAM(IS_HSP_PROCLIST_IT_PFCTEVT(interrupt));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  return ((STM32_READ_BIT(p_hspx->PFCTEVT_IER, interrupt) != 0U) ? 1U : 0U);
}

/**
  * @}
  */

/** @addtogroup HSP_Exported_Functions_Group13
  * @{
  */
/* Global IRQ Handler *********************************************************/
/**
  * @brief  Handle all HSP interrupt request.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  */
void HAL_HSP_IRQHandler(HSP_HandleTypeDef *hhsp)
{
  ASSERT_DBG_PARAM(hhsp != NULL);

  HAL_HSP_ERR_IRQHandler(hhsp);
  HAL_HSP_EVT_IRQHandler(hhsp);
  HAL_HSP_FWEVT_IRQHandler(hhsp);
}

/* Event IRQ Handlers and Callbacks *******************************************/
/**
  * @brief  Handle all HSP Event interrupt request.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  */
void HAL_HSP_EVT_IRQHandler(HSP_HandleTypeDef *hhsp)
{
  const HSP_TypeDef *p_hspx;

  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_ALL_INSTANCE(hhsp->Instance));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Get Processing Status */
  uint32_t reg_evt_ier = STM32_READ_REG(p_hspx->EVT_IER);
  uint32_t reg_evt_isr = STM32_READ_REG(p_hspx->EVT_ISR);
  uint32_t reg_evt_misr = reg_evt_ier & reg_evt_isr;

  /* STREAM Interface --------------------------------------------------------*/
  if (hhsp->stream_handler != NULL)
  {
    hhsp->stream_handler(hhsp, reg_evt_misr);
  }

  /* Task Comparator Interface -----------------------------------------------*/
  if (hhsp->tcu_handler != NULL)
  {
    hhsp->tcu_handler(hhsp, reg_evt_misr);
  }

  /* Miscelleanous SPE Events ------------------------------------------------*/
  if (hhsp->spe_handler != NULL)
  {
    hhsp->spe_handler(hhsp, reg_evt_misr);
  }

  /* TimeStamp Ready ---------------------------------------------------------*/
  if (hhsp->tsc_handler != NULL)
  {
    hhsp->tsc_handler(hhsp, reg_evt_misr);
  }

  /* Command Interface -------------------------------------------------------*/
  if (hhsp->cmd_handler != NULL)
  {
    hhsp->cmd_handler(hhsp, reg_evt_misr);
  }
}

/**
  * @brief  Callback for STREAM Buffer Empty.
  * @param hhsp Pointer to a @ref HSP_HandleTypeDef.
  * @param buffer_ids  Buffer ID mask.
  */
__WEAK void HAL_HSP_EVT_STREAM_BufferEmptyCallback(HSP_HandleTypeDef *hhsp, uint32_t buffer_ids)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhsp);
  UNUSED(buffer_ids);

  /* NOTE: This function must not be modified. When the callback is needed,
           function HAL_HSP_EVT_STREAM_BufferEmptyCallback must be implemented in the user file.
   */
}

/**
  * @brief  Callback for STREAM Buffer Full.
  * @param hhsp Pointer to a @ref HSP_HandleTypeDef.
  * @param buffer_ids  Buffer ID mask.
  */
__WEAK void HAL_HSP_EVT_STREAM_BufferFullCallback(HSP_HandleTypeDef *hhsp, uint32_t buffer_ids)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhsp);
  UNUSED(buffer_ids);

  /* NOTE: This function must not be modified. When the callback is needed,
           function HAL_HSP_EVT_STREAM_BufferFullCallback must be implemented in the user file.
   */
}

/**
  * @brief  Callback for Start Of Task Interrupts.
  * @param hhsp Pointer to a @ref HSP_HandleTypeDef.
  * @param tcu_ids  TCU IDs mask.
  */
__WEAK void HAL_HSP_EVT_TCU_TaskStartedCallback(HSP_HandleTypeDef *hhsp, uint32_t tcu_ids)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhsp);
  UNUSED(tcu_ids);

  /* NOTE: This function must not be modified. When the callback is needed,
           function HAL_HSP_EVT_TCU_TaskStartedCallback must be implemented in the user file.
   */
}

/**
  * @brief  Callback for End Of Task Interrupts.
  * @param hhsp Pointer to a @ref HSP_HandleTypeDef.
  * @param tcu_ids  TCU IDs mask.
  */
__WEAK void HAL_HSP_EVT_TCU_TaskEndedCallback(HSP_HandleTypeDef *hhsp, uint32_t tcu_ids)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhsp);
  UNUSED(tcu_ids);

  /* NOTE: This function must not be modified. When the callback is needed,
           function HAL_HSP_EVT_TCU_TaskEndedCallback must be implemented in the user file.
   */
}

/**
  * @brief  Callback for Task Overlap Event.
  * @param hhsp Pointer to a @ref HSP_HandleTypeDef.
  */
__WEAK void HAL_HSP_EVT_TCU_TaskOverlapCallback(HSP_HandleTypeDef *hhsp)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhsp);

  /* NOTE: This function must not be modified. When the callback is needed,
           function HAL_HSP_EVT_TCU_TaskOverlapCallback must be implemented in the user file.
   */
}

/**
  * @brief  Callback for Direct Command Execution Complete.
  * @param hhsp Pointer to a @ref HSP_HandleTypeDef.
  */
__WEAK void HAL_HSP_EVT_SPE_DirectCommandCpltCallback(HSP_HandleTypeDef *hhsp)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhsp);

  /* NOTE: This function must not be modified. When the callback is needed,
           function HAL_HSP_EVT_SPE_DirectCommandCpltCallback must be implemented in the user file.
   */
}

/**
  * @brief  Callback for Task Execution Complete.
  * @param hhsp Pointer to a @ref HSP_HandleTypeDef.
  */
__WEAK void HAL_HSP_EVT_SPE_TaskCpltCallback(HSP_HandleTypeDef *hhsp)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhsp);

  /* NOTE: This function must not be modified. When the callback is needed,
           function HAL_HSP_EVT_SPE_TaskCpltCallback must be implemented in the user file.
   */
}

/**
  * @brief  Callback for SPE Run  State change.
  * @param hhsp Pointer to a @ref HSP_HandleTypeDef.
  * @param state  SPE State.
  */
__WEAK void HAL_HSP_EVT_SPE_RunStateCallback(HSP_HandleTypeDef *hhsp, uint32_t state)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhsp);
  UNUSED(state);

  /* NOTE: This function must not be modified. When the callback is needed,
           function HAL_HSP_EVT_SPE_RunStateCallback must be implemented in the user file.
   */
}

/**
  * @brief  Callback for FPU Saturation Event.
  * @param hhsp Pointer to a @ref HSP_HandleTypeDef.
  */
__WEAK void HAL_HSP_EVT_SPE_FPUSaturationCallback(HSP_HandleTypeDef *hhsp)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhsp);

  /* NOTE: This function must not be modified. When the callback is needed,
           function HAL_HSP_EVT_SPE_FPUSaturationCallback must be implemented in the user file.
   */
}

/**
  * @brief  Callback for TimeStamp Capture Date Ready.
  * @param hhsp Pointer to a @ref HSP_HandleTypeDef.
  * @param timestamp  Timestamp data.
  */
__WEAK void HAL_HSP_EVT_TSC_TimestampReadyCallback(HSP_HandleTypeDef *hhsp, uint32_t timestamp)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhsp);
  UNUSED(timestamp);

  /* NOTE: This function must not be modified. When the callback is needed,
           function HAL_HSP_EVT_TSC_TimestampReadyCallback must be implemented in the user file.
   */
}

/* Error IRQ Handlers and Callbacks *******************************************/
/**
  * @brief  Handle all HSP Error interrupt request.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  */
void HAL_HSP_ERR_IRQHandler(HSP_HandleTypeDef *hhsp)
{
  const HSP_TypeDef *p_hspx;
  uint32_t errors = 0U;

  /* Check the parameters */
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_ALL_INSTANCE(hhsp->Instance));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Get Processing Status */
  uint32_t reg_err_ier = STM32_READ_REG(p_hspx->ERR_IER);
  uint32_t reg_err_isr = STM32_READ_REG(p_hspx->ERR_ISR);
  uint32_t reg_err_misr = reg_err_ier & reg_err_isr;

  /* Adjust value of reg_err_misr for FPU ITs where there is only one FPU_ERR Flag */
  if ((reg_err_ier & HAL_HSP_IT_ERR_SPE_FPU_ALL) != 0U)
  {
    /* Complete the MISR for FPU Error */
    reg_err_misr |= (reg_err_isr & HAL_HSP_FLAG_ERR_SPE_FPU);
  }

  /* Read FWERR & ERRINFR before to process each IT while there are reset
     when the IT flags were cleared
  */
  uint32_t fw_error_code = STM32_READ_REG(p_hspx->FWERR);
  uint32_t spe_error_inf = STM32_READ_REG(p_hspx->ERRINFR);

  /* STREAM Interface --------------------------------------------------------*/
  if (hhsp->stream_err_handler != NULL)
  {
    hhsp->stream_err_handler(hhsp, reg_err_misr, &errors);
  }

  /* TRGIN Interface ---------------------------------------------------------*/
  if (hhsp->trgin_err_handler != NULL)
  {
    hhsp->trgin_err_handler(hhsp, reg_err_misr, &errors);
  }

