zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  /* TSC Interface -----------------------------------------------------------*/
  if (hhsp->tsc_err_handler != NULL)
  {
    hhsp->tsc_err_handler(hhsp, reg_err_misr, &errors);
  }

  /* SPE ---------------------------------------------------------------------*/
  if (hhsp->spe_err_handler != NULL)
  {
    hhsp->spe_err_handler(hhsp, reg_err_misr, &errors);
  }

  /* Store current volatile hhsp->last_error_codes, misra rule */
  hhsp->last_error_codes |= errors;
  uint32_t tmperror = (hhsp->last_error_codes) & HAL_HSP_ERROR_HW_ALL;

  /* Call the Error Callback in case of Error detected */
  if (tmperror != HAL_HSP_ERROR_NONE)
  {
    /* Call the corresponding callback to inform upper layer of Error */
#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
    hhsp->ErrorCallback(hhsp, fw_error_code, spe_error_inf);
#else
    HAL_HSP_ErrorCallback(hhsp, fw_error_code, spe_error_inf);
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */
  }
}

/* Firmware Event IRQ Handlers and Callbacks **********************************/
/**
  * @brief  Handle all HSP Firmware Event interrupt request.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  */
void HAL_HSP_FWEVT_IRQHandler(HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx;

  /* Check the parameters */
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(IS_HSP_ALL_INSTANCE(hhsp->Instance));

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Get Processing Status */
  uint32_t reg_processing_ier = STM32_READ_REG(p_hspx->PFCTEVT_IER);
  uint32_t reg_processing_isr = STM32_READ_REG(p_hspx->PFCTEVT_ISR);
  uint32_t reg_processing_misr = reg_processing_ier & reg_processing_isr;

  if (reg_processing_misr > 0U)
  {
    /* Clear Flags: Processing Status */
    STM32_WRITE_REG(p_hspx->PFCTEVT_ICR, reg_processing_misr);

    /* Call the callback */
#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
    hhsp->FWEVT_ProcessingEventCallback(hhsp, reg_processing_misr);
#else
    HAL_HSP_FWEVT_ProcessingEventCallback(hhsp, reg_processing_misr);
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  Callback for Processing Function Events.
  * @param hhsp Pointer to a @ref HSP_HandleTypeDef.
  * @param events  Processing Function Events mask.
  */
__WEAK void HAL_HSP_FWEVT_ProcessingEventCallback(HSP_HandleTypeDef *hhsp, uint32_t events)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhsp);
  UNUSED(events);

  /* NOTE: This function must not be modified. When the callback is needed,
           function HAL_HSP_FWEVT_ProcessingEventCallback must be implemented in the user file.
   */
}

/**
  * @brief  Callback for any Error.
  * @param hhsp Pointer to a @ref HSP_HandleTypeDef.
  * @param fw_error_code  Firmware Error Code
  * @param error_inf_mask  SPE Errors mask
  */
__WEAK void HAL_HSP_ErrorCallback(HSP_HandleTypeDef *hhsp, uint32_t fw_error_code, uint32_t error_inf_mask)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhsp);
  UNUSED(fw_error_code);
  UNUSED(error_inf_mask);

  /* NOTE: This function must not be modified. When the callback is needed,
           function HAL_HSP_ErrorCallback must be implemented in the user file.
   */
}

#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
/* Callbacks Register/UnRegister functions ************************************/
/**
  * @brief  Register a User HSP callback for MSP Init.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_callback  Pointer to the callback function.
  * @retval HAL_OK      Registering completed successfully.
  * @retval HAL_ERROR   p_callback pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_RegisterMspInitCallback(HSP_HandleTypeDef *hhsp, pHSP_CallbackTypeDef p_callback)
{
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  if (p_callback == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  /* Store the callback function within handle */
  hhsp->MspInitCallback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a User HSP callback for MSP DeInit.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_callback  Pointer to the callback function.
  * @retval HAL_OK      Registering completed successfully.
  * @retval HAL_ERROR   p_callback pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_RegisterMspDeInitCallback(HSP_HandleTypeDef *hhsp, pHSP_CallbackTypeDef p_callback)
{
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  if (p_callback == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  /* Store the callback function within handle */
  hhsp->MspDeInitCallback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a User HSP callback for SPE Event: Direct Command Complete.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_callback  Pointer to the callback function.
  * @retval HAL_OK      Registering completed successfully.
  * @retval HAL_ERROR   p_callback pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_RegisterSPE_DirectCommandCpltCallback(HSP_HandleTypeDef *hhsp,
                                                                pHSP_CallbackTypeDef p_callback)
{
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  if (p_callback == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  HSP_ASSERT_DBG_STATE(hhsp->global_state, ((uint32_t)HAL_HSP_STATE_INIT | (uint32_t)HAL_HSP_STATE_READY_TO_BOOT
                                            | (uint32_t)HAL_HSP_STATE_RUNNING));

  /* Store the callback function within handle */
  hhsp->EVT_SPE_DirectCommandCpltCallback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a User HSP callback for SPE Event: Ready For New Task in Lowest Priority.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_callback  Pointer to the callback function.
  * @retval HAL_OK      Registering completed successfully.
  * @retval HAL_ERROR   p_callback pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_RegisterSPE_TaskCpltCallback(HSP_HandleTypeDef *hhsp,
                                                       pHSP_CallbackTypeDef p_callback)
{
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

