zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  if (p_callback == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  HSP_ASSERT_DBG_STATE(hhsp->global_state, ((uint32_t)HAL_HSP_STATE_INIT | (uint32_t)HAL_HSP_STATE_READY_TO_BOOT
                                            | (uint32_t)HAL_HSP_STATE_RUNNING));

  /* Store the callback function within handle */
  hhsp->EVT_SPE_TaskCpltCallback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a User HSP callback for SPE Event: FPU Saturation.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_callback  Pointer to the callback function.
  * @retval HAL_OK      Registering completed successfully.
  * @retval HAL_ERROR   p_callback pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_RegisterSPE_FPUSaturationCallback(HSP_HandleTypeDef *hhsp,
                                                            pHSP_CallbackTypeDef p_callback)
{
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  if (p_callback == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  HSP_ASSERT_DBG_STATE(hhsp->global_state, ((uint32_t)HAL_HSP_STATE_INIT | (uint32_t)HAL_HSP_STATE_READY_TO_BOOT
                                            | (uint32_t)HAL_HSP_STATE_RUNNING));

  /* Store the callback function within handle */
  hhsp->EVT_SPE_FPUSaturationCallback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a User HSP callback for SPE Event: Run State Changed.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_callback  Pointer to the callback function.
  * @retval HAL_OK      Registering completed successfully.
  * @retval HAL_ERROR   p_callback pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_RegisterSPE_RunStateCallback(HSP_HandleTypeDef *hhsp,
                                                       pHSP_OneParamCallbackTypeDef p_callback)
{
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  if (p_callback == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  HSP_ASSERT_DBG_STATE(hhsp->global_state, ((uint32_t)HAL_HSP_STATE_INIT | (uint32_t)HAL_HSP_STATE_READY_TO_BOOT
                                            | (uint32_t)HAL_HSP_STATE_RUNNING));

  /* Store the callback function within handle */
  hhsp->EVT_SPE_RunStateCallback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a User HSP callback for STREAM Buffer Event: Buffer Empty.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_callback  Pointer to the callback function.
  * @retval HAL_OK      Registering completed successfully.
  * @retval HAL_ERROR   p_callback pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_RegisterSTREAM_BufferEmptyCallback(HSP_HandleTypeDef *hhsp,
                                                             pHSP_OneParamCallbackTypeDef p_callback)
{
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  if (p_callback == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  HSP_ASSERT_DBG_STATE(hhsp->global_state, ((uint32_t)HAL_HSP_STATE_INIT | (uint32_t)HAL_HSP_STATE_READY_TO_BOOT
                                            | (uint32_t)HAL_HSP_STATE_RUNNING));

  /* Store the callback function within handle */
  hhsp->EVT_STREAM_BufferEmptyCallback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a User HSP callback for STREAM Buffer Event: Buffer Full.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_callback  Pointer to the callback function.
  * @retval HAL_OK      Registering completed successfully.
  * @retval HAL_ERROR   p_callback pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_RegisterSTREAM_BufferFullCallback(HSP_HandleTypeDef *hhsp,
                                                            pHSP_OneParamCallbackTypeDef p_callback)
{
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  if (p_callback == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  HSP_ASSERT_DBG_STATE(hhsp->global_state, ((uint32_t)HAL_HSP_STATE_INIT | (uint32_t)HAL_HSP_STATE_READY_TO_BOOT
                                            | (uint32_t)HAL_HSP_STATE_RUNNING));

  /* Store the callback function within handle */
  hhsp->EVT_STREAM_BufferFullCallback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a User HSP callback for Task Comparator Event: Task Overlap.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_callback  Pointer to the callback function.
  * @retval HAL_OK      Registering completed successfully.
  * @retval HAL_ERROR   p_callback pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_RegisterTCU_TaskOverlapCallback(HSP_HandleTypeDef *hhsp,
                                                          pHSP_CallbackTypeDef p_callback)
{
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  if (p_callback == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  HSP_ASSERT_DBG_STATE(hhsp->global_state, ((uint32_t)HAL_HSP_STATE_INIT | (uint32_t)HAL_HSP_STATE_READY_TO_BOOT
                                            | (uint32_t)HAL_HSP_STATE_RUNNING));

  /* Store the callback function within handle */
  hhsp->EVT_TCU_TaskOverlapCallback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a User HSP callback for Task Comparator Events: Start Of Task.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_callback  Pointer to the callback function.
  * @retval HAL_OK      Registering completed successfully.
  * @retval HAL_ERROR   p_callback pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_RegisterTCU_TaskStartedCallback(HSP_HandleTypeDef *hhsp,
                                                          pHSP_OneParamCallbackTypeDef p_callback)
{
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

