zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  if (p_callback == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  HSP_ASSERT_DBG_STATE(hhsp->global_state, ((uint32_t)HAL_HSP_STATE_INIT | (uint32_t)HAL_HSP_STATE_READY_TO_BOOT
                                            | (uint32_t)HAL_HSP_STATE_RUNNING));

  /* Store the callback function within handle */
  hhsp->EVT_TCU_TaskStartedCallback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a User HSP callback for Task Comparator Events: End Of Task.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_callback  Pointer to the callback function.
  * @retval HAL_OK      Registering completed successfully.
  * @retval HAL_ERROR   p_callback pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_RegisterTCU_TaskEndedCallback(HSP_HandleTypeDef *hhsp,
                                                        pHSP_OneParamCallbackTypeDef p_callback)
{
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  if (p_callback == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  HSP_ASSERT_DBG_STATE(hhsp->global_state, ((uint32_t)HAL_HSP_STATE_INIT | (uint32_t)HAL_HSP_STATE_READY_TO_BOOT
                                            | (uint32_t)HAL_HSP_STATE_RUNNING));

  /* Store the callback function within handle */
  hhsp->EVT_TCU_TaskEndedCallback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a User HSP callback for TimeStamp Capture Event: Timestamp Ready.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_callback  Pointer to the callback function.
  * @retval HAL_OK      Registering completed successfully.
  * @retval HAL_ERROR   p_callback pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_RegisterTSC_TimestampReadyCallback(HSP_HandleTypeDef *hhsp,
                                                             pHSP_OneParamCallbackTypeDef p_callback)
{
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  if (p_callback == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  HSP_ASSERT_DBG_STATE(hhsp->global_state, ((uint32_t)HAL_HSP_STATE_INIT | (uint32_t)HAL_HSP_STATE_READY_TO_BOOT
                                            | (uint32_t)HAL_HSP_STATE_RUNNING));

  /* Store the callback function within handle */
  hhsp->EVT_TSC_TimestampReadyCallback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a User HSP callback for any Error Event.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_callback  Pointer to the callback function.
  * @retval HAL_OK      Registering completed successfully.
  * @retval HAL_ERROR   p_callback pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_RegisterErrorCallback(HSP_HandleTypeDef *hhsp, pHSP_TwoParamsCallbackTypeDef p_callback)
{
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  if (p_callback == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  HSP_ASSERT_DBG_STATE(hhsp->global_state, ((uint32_t)HAL_HSP_STATE_INIT | (uint32_t)HAL_HSP_STATE_READY_TO_BOOT
                                            | (uint32_t)HAL_HSP_STATE_RUNNING));

  /* Store the callback function within handle */
  hhsp->ErrorCallback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a User HSP callback for any Processing Function Event.
  * @param  hhsp        Pointer to a @ref HSP_HandleTypeDef.
  * @param  p_callback  Pointer to the callback function.
  * @retval HAL_OK      Registering completed successfully.
  * @retval HAL_ERROR   p_callback pointer is NULL.
  */
HAL_StatusTypeDef HAL_HSP_RegisterFWEVT_ProcessingEventCallback(HSP_HandleTypeDef *hhsp,
                                                                pHSP_OneParamCallbackTypeDef p_callback)
{
  ASSERT_DBG_PARAM(hhsp != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  if (p_callback == NULL)
  {
    hhsp->last_error_codes |= HAL_HSP_ERROR_INVALID_PARAM;

    return HAL_ERROR;
  }

  HSP_ASSERT_DBG_STATE(hhsp->global_state, ((uint32_t)HAL_HSP_STATE_INIT | (uint32_t)HAL_HSP_STATE_READY_TO_BOOT
                                            | (uint32_t)HAL_HSP_STATE_RUNNING));

  /* Store the callback function within handle */
  hhsp->FWEVT_ProcessingEventCallback = p_callback;

  return HAL_OK;
}

#endif /* USE_HAL_HSP_REGISTER_CALLBACKS == 1 */
/**
  * @}
  */

/** @addtogroup HSP_Exported_Functions_Group14
  * @brief   Peripheral State, Mode and Error functions
  *
@verbatim
 ===============================================================================
            ##### Peripheral State, Mode and Error functions #####
 ===============================================================================
    [..]
    This subsection permit to get in run-time the status of the peripheral
    and the data flow.

@endverbatim
  * @{
  */
/**
  * @brief  Return the HSP handle state.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval HSP State
  */
HAL_HSP_StateTypeDef HAL_HSP_GetState(const HSP_HandleTypeDef *hhsp)
{
  ASSERT_DBG_PARAM((hhsp != NULL));

  return hhsp->global_state;
}

/**
  * @brief  Get the HSP last error codes.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @return uint32_t  This return value can be a combination of the following values:
  *         @arg @ref HAL_HSP_ERROR_NONE
  */
uint32_t HAL_HSP_GetError(const HSP_HandleTypeDef *hhsp)
{
  ASSERT_DBG_PARAM((hhsp != NULL));

  return hhsp->last_error_codes;
}

/**
  * @brief  Get the HSP Boot error code.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval HSP Error Code
  */
uint32_t HAL_HSP_GetBootErrorCode(const HSP_HandleTypeDef *hhsp)
{
  ASSERT_DBG_PARAM((hhsp != NULL));

  return hhsp->boot_error_code;
}

/**
  * @brief  Get the HSP MsgBox last error code.
  * @param  hhsp  Pointer to a @ref HSP_HandleTypeDef.
  * @retval HSP Error Code
  */
uint32_t HAL_HSP_GetMsgBoxErrorCode(const HSP_HandleTypeDef *hhsp)
{
  ASSERT_DBG_PARAM((hhsp != NULL));

  return hhsp->last_msgbox_error_code;
}

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup HSP_Private_Functions HSP Private Functions
  * @{
  */
/**
  * @brief HSP Firmware reset request.
  * @param hhsp  HSP handle.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_TIMEOUT Timeout elapsed !
  *                   No ensure that HSP reset does not disturb the activity of
  *                   other components of the product
  */
static HAL_StatusTypeDef HSP_Reset(const HSP_HandleTypeDef *hhsp)
{
  HSP_TypeDef *p_hspx;

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* Request the HSP Reset*/
  STM32_SET_BIT(p_hspx->CR, HSP_CR_RSTREQ);

  /* Get timeout */
  uint32_t tickstart = HAL_GetTick();

  while (!STM32_IS_BIT_SET(p_hspx->CR, HSP_CR_RSTOK))
  {
    /* Check for the Timeout */
    if ((HAL_GetTick() - tickstart) > HSP_TIMEOUT_RESET_MS)
    {
      /* New check to avoid false timeout detection in case of preemption */
      if (!STM32_IS_BIT_SET(p_hspx->CR, HSP_CR_RSTOK))
      {
        return HAL_TIMEOUT;
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief  Interrupt Sub-Routine which handles the STREAM Buffers in interrupt mode.
  * @param  hhsp          Pointer to a @ref HSP_HandleTypeDef.
  * @param  reg_evt_misr  Event Interrupt Status to handle.
  */
static void HSP_STREAM_Handler(HSP_HandleTypeDef *hhsp, uint32_t reg_evt_misr)
{
  uint32_t stream_evts_status = (STM32_READ_BIT(reg_evt_misr, HAL_HSP_IT_EVT_STREAM_ALL) >> HSP_EVT_IER_B0EVTIE_Pos);

