zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  HSP_TypeDef *p_hspx;

  p_hspx = HSP_GET_INSTANCE(hhsp);

  if (stream_evts_status != 0U)
  {
    uint32_t stream_buff_reg = STM32_READ_REG(p_hspx->BUFFCFGR);
    uint32_t rx_buff_mask = (STM32_READ_BIT(~stream_buff_reg, HSP_BUFFCFGR_BUFFDIR_MSK) >> HSP_BUFFCFGR_BUFF0DIR_Pos);
    uint32_t tx_buff_mask = (STM32_READ_BIT(stream_buff_reg, HSP_BUFFCFGR_BUFFDIR_MSK) >> HSP_BUFFCFGR_BUFF0DIR_Pos);

    uint32_t stream_buffer_rx_ready = (rx_buff_mask & stream_evts_status);
    uint32_t stream_buffer_tx_ready = (tx_buff_mask & stream_evts_status);

    if (stream_buffer_rx_ready != 0U)
    {
      /* Some RX Buffers are empty */
      /* Disable ITs before the callback */
      STM32_CLEAR_BIT(p_hspx->EVT_IER, stream_buffer_rx_ready << HSP_EVT_IER_B0EVTIE_Pos);

#if defined(USE_HAL_HSP_REGISTER_CALLBACKS) && (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
      hhsp->EVT_STREAM_BufferEmptyCallback(hhsp, stream_buffer_rx_ready);
#else
      HAL_HSP_EVT_STREAM_BufferEmptyCallback(hhsp, stream_buffer_rx_ready);
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */
    }

    if (stream_buffer_tx_ready != 0U)
    {
      /* Some TX Buffers are full */
      /* Disable ITs before the callback */
      STM32_CLEAR_BIT(p_hspx->EVT_IER, stream_buffer_tx_ready << HSP_EVT_IER_B0EVTIE_Pos);

#if defined(USE_HAL_HSP_REGISTER_CALLBACKS) && (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
      hhsp->EVT_STREAM_BufferFullCallback(hhsp, stream_buffer_tx_ready);
#else
      HAL_HSP_EVT_STREAM_BufferFullCallback(hhsp, stream_buffer_tx_ready);
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */
    }
  }
}

/**
  * @brief  Interrupt Sub-Routine which handles the Task Comparator Unit in interrupt mode.
  * @param  hhsp          Pointer to a @ref HSP_HandleTypeDef.
  * @param  reg_evt_misr  Event Interrupt Status to handle.
  */
static void HSP_TCU_Handler(HSP_HandleTypeDef *hhsp, uint32_t reg_evt_misr)
{
  uint32_t tcu_start_flags = STM32_READ_BIT(reg_evt_misr, HSP_EVT_ISR_TCU_START_OF_TASK_FLAGS_MASK);
  uint32_t tcu_end_flags = STM32_READ_BIT(reg_evt_misr, HSP_EVT_ISR_TCU_END_OF_TASK_FLAGS_MASK);
  HSP_TypeDef *p_hspx;

  p_hspx = HSP_GET_INSTANCE(hhsp);

  if (tcu_start_flags != 0U)
  {
    /* Clear flag: Start of Task for Task Comparator Units */
    STM32_WRITE_REG(p_hspx->EVT_ICR, tcu_start_flags);

    /* Call the corresponding callback to inform upper layer of Start of Tasks */
#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
    hhsp->EVT_TCU_TaskStartedCallback(hhsp, tcu_start_flags);
#else
    HAL_HSP_EVT_TCU_TaskStartedCallback(hhsp, tcu_start_flags);
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */
  }

  if (tcu_end_flags != 0U)
  {
    /* Clear flag: End of Task for Task Comparator Units */
    STM32_WRITE_REG(p_hspx->EVT_ICR, tcu_end_flags);

    /* Call the corresponding callback to inform upper layer of End of Tasks */
#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
    hhsp->EVT_TCU_TaskEndedCallback(hhsp, tcu_end_flags);
#else
    HAL_HSP_EVT_TCU_TaskEndedCallback(hhsp, tcu_end_flags);
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */
  }

  if (STM32_IS_BIT_SET(reg_evt_misr, HSP_EVT_ISR_TOVLPF))
  {
    /* Clear flag: Task Overlap */
    STM32_WRITE_REG(p_hspx->EVT_ICR, HSP_EVT_ISR_TOVLPF);

    /* Call the corresponding callback to inform upper layer of a Task Overlapping */
#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
    hhsp->EVT_TCU_TaskOverlapCallback(hhsp);
#else
    HAL_HSP_EVT_TCU_TaskOverlapCallback(hhsp);
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  Interrupt Sub-Routine which handles the Command Events in interrupt mode.
  * @param  hhsp          Pointer to a @ref HSP_HandleTypeDef.
  * @param  reg_evt_misr  Event Interrupt Status to handle.
  */
static void HSP_CMD_Handler(HSP_HandleTypeDef *hhsp, uint32_t reg_evt_misr)
{
  HSP_TypeDef *p_hspx;

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* DCMD Event --------------------------------------------------------------*/
  if (STM32_IS_BIT_SET(reg_evt_misr, HSP_EVT_ISR_DCDONEF))
  {
    /* Clear flag: Direct Command done */
    STM32_WRITE_REG(p_hspx->EVT_ICR, HSP_EVT_ISR_DCDONEF);

    /* Call the corresponding callback to inform upper layer of the end of Direct Command processing */
#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
    hhsp->EVT_SPE_DirectCommandCpltCallback(hhsp);
#else
    HAL_HSP_EVT_SPE_DirectCommandCpltCallback(hhsp);
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */
  }

  /* CDEG Event --------------------------------------------------------------*/
  if (STM32_IS_BIT_SET(reg_evt_misr, HSP_EVT_ISR_CDEGRDYF))
  {
    /* Disable the IT enabled by HAL_HSP_TASK_Run_IT */
    STM32_CLEAR_BIT(p_hspx->EVT_IER, HSP_EVT_IER_CDEGRDYIE);

    /* Note: No need to clear the flag. It will be done when sending a new Task */

    /* Call the corresponding callback to inform upper layer of CDEG is Ready */
#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
    hhsp->EVT_SPE_TaskCpltCallback(hhsp);
#else
    HAL_HSP_EVT_SPE_TaskCpltCallback(hhsp);
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  Interrupt Sub-Routine which handles the SPE Events in interrupt mode.
  * @param  hhsp          Pointer to a @ref HSP_HandleTypeDef.
  * @param  reg_evt_misr  Event Interrupt Status to handle.
  */
static void HSP_SPE_Handler(HSP_HandleTypeDef *hhsp, uint32_t reg_evt_misr)
{
  HSP_TypeDef *p_hspx;

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* SPE State Events --------------------------------------------------------*/
  if (STM32_IS_BIT_SET(reg_evt_misr, HSP_EVT_ISR_SOFWFEF))
  {
    /* Clear flag: Start Of WFE */
    STM32_WRITE_REG(p_hspx->EVT_ICR, HSP_EVT_ISR_SOFWFEF);

    /* Call the corresponding callback to inform upper layer of SPE enters in WFE mode */
#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
    hhsp->EVT_SPE_RunStateCallback(hhsp, HAL_HSP_SPE_RUN_STATE_WFE);
#else
    HAL_HSP_EVT_SPE_RunStateCallback(hhsp, HAL_HSP_SPE_RUN_STATE_WFE);
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */
  }
  else if (STM32_IS_BIT_SET(reg_evt_misr, HSP_EVT_ISR_EOFWFEF))
  {
    /* Clear flag: End Of WFE */
    STM32_SET_BIT(p_hspx->EVT_ICR, HSP_EVT_ISR_EOFWFEF);

    /* Call the corresponding callback to inform upper layer of SPE exits from WFE mode */
#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
    hhsp->EVT_SPE_RunStateCallback(hhsp, HAL_HSP_SPE_RUN_STATE_ACTIVE);
#else
    HAL_HSP_EVT_SPE_RunStateCallback(hhsp, HAL_HSP_SPE_RUN_STATE_ACTIVE);
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */
  }
  else
  {
    /* No action to performed */
  }

  /* FPU Saturation Event ----------------------------------------------------*/
  if (STM32_IS_BIT_SET(reg_evt_misr, HSP_EVT_ISR_FPUSATF))
  {
    /* Clear flag: FPU Saturation */
    STM32_WRITE_REG(p_hspx->EVT_ICR, HSP_EVT_ISR_FPUSATF);

    /* Call the corresponding callback to inform upper layer of a Task Overlapping */
#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
    hhsp->EVT_SPE_FPUSaturationCallback(hhsp);
#else
    HAL_HSP_EVT_SPE_FPUSaturationCallback(hhsp);
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  Interrupt Sub-Routine which handles the TimeStamp Capture Events in interrupt mode.
  * @param  hhsp          Pointer to a @ref HSP_HandleTypeDef.
  * @param  reg_evt_misr  Event Interrupt Status to handle.
  */
static void HSP_TSC_Handler(HSP_HandleTypeDef *hhsp, uint32_t reg_evt_misr)
{
  const HSP_TypeDef *p_hspx;

  p_hspx = HSP_GET_INSTANCE(hhsp);

