zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/drivers/src/stm32u3xx_hal_hsp.c
  if (STM32_IS_BIT_SET(reg_evt_misr, HSP_EVT_ISR_CAPRDYF))
  {
    uint32_t timestamp = STM32_READ_REG(p_hspx->CAPDR);

    /* Note: No need to clear the flag HSP_EVT_ISR_CAPRDYF. It is node by HW when CAPDR register is read */

    /* Call the corresponding callback to inform upper layer of a Task Overlapping */
#if (USE_HAL_HSP_REGISTER_CALLBACKS == 1)
    hhsp->EVT_TSC_TimestampReadyCallback(hhsp, timestamp);
#else
    HAL_HSP_EVT_TSC_TimestampReadyCallback(hhsp, timestamp);
#endif /* USE_HAL_HSP_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  Interrupt Sub-Routine which handles the STREAM Error in interrupt mode.
  * @param  hhsp          Pointer to a @ref HSP_HandleTypeDef.
  * @param  reg_err_misr  Error Interrupt Status to handle.
  * @param  p_errors      Pointer to error codes variable to be updated.
  */
static void HSP_STREAM_Error_Handler(const HSP_HandleTypeDef *hhsp, uint32_t reg_err_misr, uint32_t *p_errors)
{
  HSP_TypeDef *p_hspx;

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* STREAM Interface --------------------------------------------------------*/
  if (STM32_IS_BIT_SET(reg_err_misr, HSP_ERR_ISR_B0ERRF))
  {
    /* Clear flag: H2CBUFF0 Underrun or C2HBUFF0 Overrun */
    STM32_WRITE_REG(p_hspx->ERR_ICR, HSP_ERR_ICR_B0ERRC);

    *p_errors |= HAL_HSP_ERROR_BUFFER_UDR_OR_OVR;
  }

  if (STM32_IS_BIT_SET(reg_err_misr, HSP_ERR_ISR_B1ERRF))
  {
    /* Clear flag: H2CBUFF1 Underrun or C2HBUFF1 Overrun */
    STM32_WRITE_REG(p_hspx->ERR_ICR, HSP_ERR_ICR_B1ERRC);

    *p_errors |= HAL_HSP_ERROR_BUFFER_UDR_OR_OVR;
  }

  if (STM32_IS_BIT_SET(reg_err_misr, HSP_ERR_ISR_B2ERRF))
  {
    /* Clear flag: H2CBUFF2 Underrun or C2HBUFF2 Overrun */
    STM32_WRITE_REG(p_hspx->ERR_ICR, HSP_ERR_ICR_B2ERRC);

    *p_errors |= HAL_HSP_ERROR_BUFFER_UDR_OR_OVR;
  }

  if (STM32_IS_BIT_SET(reg_err_misr, HSP_ERR_ISR_B3ERRF))
  {
    /* Clear flag: H2CBUFF3 Underrun or C2HBUFF3 Overrun */
    STM32_WRITE_REG(p_hspx->ERR_ICR, HSP_ERR_ICR_B3ERRC);

    *p_errors |= HAL_HSP_ERROR_BUFFER_UDR_OR_OVR;
  }
}

/**
  * @brief  Interrupt Sub-Routine which handles the TRGIN Error in interrupt mode.
  * @param  hhsp          Pointer to a @ref HSP_HandleTypeDef.
  * @param  reg_err_misr  Error Interrupt Status to handle.
  * @param  p_errors      Pointer to error codes variable to be updated.
  */
static void HSP_TRGIN_Error_Handler(const HSP_HandleTypeDef *hhsp, uint32_t reg_err_misr, uint32_t *p_errors)
{
  HSP_TypeDef *p_hspx;

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* TRGIN Interface ---------------------------------------------------------*/
  if (STM32_IS_BIT_SET(reg_err_misr, HSP_ERR_ISR_TRGIOVRF))
  {
    /* Clear flag: TRGITF Overrun */
    STM32_WRITE_REG(p_hspx->ERR_ICR, HSP_ERR_ICR_TRGIOVRC);

    *p_errors |= HAL_HSP_ERROR_TRGIN_OVR;
  }
}

/**
  * @brief  Interrupt Sub-Routine which handles the TimeStamp Capture Errors in interrupt mode.
  * @param  hhsp          Pointer to a @ref HSP_HandleTypeDef.
  * @param  reg_err_misr  Error Interrupt Status to handle.
  * @param  p_errors      Pointer to error codes variable to be updated.
  */
static void HSP_TSC_Error_Handler(const HSP_HandleTypeDef *hhsp, uint32_t reg_err_misr, uint32_t *p_errors)
{
  HSP_TypeDef *p_hspx;

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* TSC Interface -----------------------------------------------------------*/
  if (STM32_IS_BIT_SET(reg_err_misr, HSP_ERR_ISR_CAPOVRF))
  {
    /* Clear flag: Capture register Overrun */
    STM32_WRITE_REG(p_hspx->ERR_ICR, HSP_ERR_ICR_CAPOVRC);

    *p_errors |= HAL_HSP_ERROR_CAPTURE_OVR;
  }
}

/**
  * @brief  Interrupt Sub-Routine which handles the SPE Errors in interrupt mode.
  * @param  hhsp          Pointer to a @ref HSP_HandleTypeDef.
  * @param  reg_err_misr  Error Interrupt Status to handle.
  * @param  p_errors      Pointer to error codes variable to be updated.
  */
static void HSP_SPE_Error_Handler(const HSP_HandleTypeDef *hhsp, uint32_t reg_err_misr, uint32_t *p_errors)
{
  HSP_TypeDef *p_hspx;

  p_hspx = HSP_GET_INSTANCE(hhsp);

  /* SPE Interface -----------------------------------------------------------*/
  if (STM32_IS_BIT_SET(reg_err_misr, HSP_ERR_ISR_FWERRF))
  {
    /* Clear flag: Firmware Error */
    STM32_WRITE_REG(p_hspx->ERR_ICR, HSP_ERR_ICR_FWERRC);

    *p_errors |= HAL_HSP_ERROR_FIRMWARE;
  }

  if (STM32_IS_BIT_SET(reg_err_misr, HSP_ERR_ISR_SCHERRF))
  {
    /* Clear flag: Scheduler Error */
    STM32_WRITE_REG(p_hspx->ERR_ICR, HSP_ERR_ICR_SCHERRC);

    *p_errors |= HAL_HSP_ERROR_SCHEDULER;
  }

  if (STM32_IS_BIT_SET(reg_err_misr, HSP_ERR_ISR_BKINF))
  {
    /* Clear flag: Break Input */
    STM32_WRITE_REG(p_hspx->ERR_ICR, HSP_ERR_ICR_BKINC);

    *p_errors |= HAL_HSP_ERROR_BREAK_IN;
  }

  if (STM32_IS_BIT_SET(reg_err_misr, HSP_ERR_ISR_HDEGOVRF))
  {
    /* Clear flag: SPE Event Overrun */
    STM32_WRITE_REG(p_hspx->ERR_ICR, HSP_ERR_ICR_HDEGOVRC);

    *p_errors |= HAL_HSP_ERROR_HDEG_OVR;
  }

  if (STM32_IS_BIT_SET(reg_err_misr, HSP_ERR_ISR_OPCOERRF))
  {
    /* Clear flag: Invalid OpCode */
    STM32_WRITE_REG(p_hspx->ERR_ICR, HSP_ERR_ICR_OPCOERRC);

    *p_errors |= HAL_HSP_ERROR_OPCODE_INVALID;
  }

  if (STM32_IS_BIT_SET(reg_err_misr, HSP_ERR_ISR_ACCERRF))
  {
    /* Clear flag: SPE Access Error */
    STM32_WRITE_REG(p_hspx->ERR_ICR, HSP_ERR_ICR_ACCERRC);

    *p_errors |= HAL_HSP_ERROR_SPE_ACCESS;
  }

  if (STM32_IS_BIT_SET(reg_err_misr, HSP_ERR_ISR_FPUERRF))
  {
    /* Clear flag: Computation Error */
    STM32_WRITE_REG(p_hspx->ERR_ICR, HSP_ERR_ICR_FPUERRC);

    *p_errors |= HAL_HSP_ERROR_FPU;
  }

}

/**
  * @}
  */

#endif /* HAL_HSP_MODULE_ENABLED */

/**
  * @}
  */

#endif /* HSP1 */

/**
  * @}
  */
